[{"job_title":"Project Architect","company_name":"Zinn Architecture + Interiors","company_location":"Jacksonville, FL 32204 \n(Riverside area)","salary_range":"$60,000 - $65,000 a year","days_ago_posted":"Posted\nToday","job_description":"Job details\nSalary\n$60,000 - $65,000 a year\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nArchitecture: 4 years (Preferred)\n\nBenefits\nPulled from the full job description\nFlexible schedule\nPaid time off\nParental leave\nProfessional development assistance\nReferral program\nFull Job Description\n\nZINN Architecture + Interiors is a young and creative architecture practice in Jacksonville, FL with a wide range of clients. Our team is seeking a highly-functioning self-starter with at least 5+ years of firm experience with a strong background in conceptualizing and developing designs for high-end residential and small commercial projects.\n\nDuties include:\n\nCorrespond with Clients politely and professionally, listen to them closely, document their requests, and be prepared to discuss their motivations and expectations with others.\nConduct Existing Conditions surveys.\nConduct preliminary zoning analysis, document findings, and be able to translate findings into 3D massing and area diagrams for use in determining project feasibility.\nUnderstand basic Life Safety and Building Code requirements and be able to include them while designing new layouts.\nHelp organize and shape a project program based on a review of a project's Scope of Work, interviews with the Client(s), and a review of the existing conditions.\nWork well with the project team in design charrettes to develop a project’s unique response.\nHelp to create diagrams or other graphic methods to communicate the basic parti to the client.\nDesign a ground-up or renovation floor plan for residential projects based on a defined program.\nHave a grasp of Visual Composition and be open to developing strategies for improving composition creation.\nUnderstand basic building systems and be able to coordinate and communicate with MEPS engineers.\nBe familiar with basic waterproofing strategies, details, and terminology.\nWork in 3D using sketchup to develop floor plan and project exterior, including roofs, and site elements.\nWork in 2D using Layout to setup views, dimension, annotate, keynote, tag, reference, schedule, and callout the design.\nReview drawings and create clear and concise markups. Assign markups to others but be prepared to clarify and assist with their execution.\nPrepare for and attend project meetings, listen carefully, ask pertinent questions, speak confidently and with kindness, and make notes\\markups. After every meeting, transcribe and clarify notes\\markups and add notes to ZINN’s project management software.\nMaintain an understanding of a project’s fee and report if project progress is on track with the budgeted time.\nUnderstand the overall design and construction process including permitting and the standard phases: Predesign, Schematic Design, Design Development, Construction Documents, and Construction Administration.\nGenerate compelling and realistic visualizations and renderings to communicate a project’s intent, spatial characteristics, or feel.\nMaintain an awareness of current and new building products, materials\\finishes, methods, equipment, furniture, fixtures, and trends.\nReceive client requests on everything from design updates to billing status, log them into ZINN’s project tracking system and either incorporate into your work schedule or re-assign to the appropriate co-worker.\n\nProfessional Values:\n\nBe willing to follow ZINN’s operational standards for everything from file naming to font usage to maintain brand clarity.\nCommunicate clearly but efficiently both verbally and in writing.\nListen actively and pose relevant and specific questions.\nTrack, follow through, and complete multiple simultaneous tasks; Meet deadlines and report on ongoing task status.\nSelf motivate -- work independently but identify and inquire with others when directives are not clear or complete.\nMaintain an open mind and accept different approaches and points of view.\nDeal with others openly, honestly, and fairly.\nRespond to requests and correspondence in a timely manner.\nInform others of your whereabouts if not in the office.\nMaintain a tidy, organized, and clean work environment.\nPresent oneself professionally in speech, manner, and dress.\nMaintain prompt and consistent attendance.\n\nAbout ZINN Architecture + Interiors\n\nZINN Architecture + Interiors is a small firm with brains, talent, and heart. We believe in an all hands on deck approach and value the unique perspective of every team member. Creative, Caring, Curious – these are just some of the values at our core.\n\nJob Type: Full-time\n\nPay: $60,000.00 - $65,000.00 per year\n\nBenefits:\n\nFlexible schedule\nPaid time off\nParental leave\nProfessional development assistance\nReferral program\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nApplication Question(s):\n\nAre you a licensed architect?\n\nExperience:\n\nArchitecture: 4 years (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted Today"},{"job_title":"Architect III","company_name":"G.M. Hill Engineering, Inc.","company_location":"Jacksonville, FL 32256 \n(Swamp area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nQualifications\n\nProject Architect or Project Management: 3 years (Preferred)\n\nArchitectural: 10 years (Preferred)\n\nRegistered Architect (Preferred)\n\nWork authorization (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$66.4K - $84.1K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nTitle: Architect III\n\nReports to: Vice President of Architecture\n\nLocation: Jacksonville, FL\n\nExempt/Non-Exempt: F/T Non-Exempt\n\nTravel: < 20% Travel\n\nJoin the GMHILL team! Founded in 2004, G.M. Hill Engineering, Inc. (GMHILL) is a fast growing 8(a), woman-owned small business (WOSB) headquartered in Jacksonville, FL, and has offices in Alexandria, VA, Virginia Beach, VA, Tallahassee, FL, Panama City, FL, Beaufort, SC, and Thomasville, GA. GMHILL has a 17-year history of providing clients with a wide range of engineering, architecture, and construction services. GMHILL’s team of professionals bring the experience and proven past performance to provide full-service building solutions that few WOSB, 8(a) firms can match. We have recent Prime experience in facility assessments and building inspections; developing and reviewing D/B RFP’s; planning; architecture; engineering; construction management; general construction; design-build for federal defense and civilian agencies; state and local governments. GMHILL’s varied A/E, construction management, and design-build experience and lessons learned, provides comprehensive designs, and delivers more complete solutions that result in lower risk and better client value, higher safety ratings, and repeat business. This is an entry level position for a person who has completed a bachelor’s or master’s degree in architecture from a NAAB accredited program, has limited professional experience and strong CADD / Revit skills.\n\nPosition Summary\n\nThe position Architect III is responsible for the delivery of a completed project, including schematic design, design development, construction documents and construction administration. As an Architect with GMHILL you must be able to oversee multiple projects simultaneously and successfully lead a design team with exceptional quality, while remaining within scope, schedule, and budget. This position is fully responsible for project delivery, including responding to client needs, creating design solutions, coordinating design sub consultants, negotiating change orders, authoring construction documents, and facilitating invoicing. You may also be called on to review the drawings of other architects for an independent quality assurance review. Your expertise will devise new design solutions, and prepare or modify drawings, specifications, and monitor work of design team on your project for compliance to applicable building codes, ADA/ABA Guidelines, and GMHILL standards.\n\nKey Tasks\n\nFollowing is a general list of tasks falling into the areas of responsibility of the Architect III. It attempts to present a comprehensive, but not complete, listing of potential assignments that may be undertaken.\n\nPerform routine to moderately difficult architectural projects with minimal supervision\nConduct programming charrettes among the project team members, end users, and key stakeholders to lead the transformation of a project from a static, complex problem to a successful, buildable plan that is within budget, scope, and schedule\nCarefully prepare working drawings, calculations, specifications, basis of design narratives, schedules, and cost estimates on specific projects\nProduce a well-coordinated set of construction documents\nEnsure that projects meet applicable building codes, ADA guidelines, Whole Building Design Guide, and other Federal and State and Local laws\nEffectively communicate with Director of Architecture, and Contracting Officers, regarding contract documents, change orders and other contract modifications, approvals, and any additional services-related to billing\nEffectively coordinate and work with in-house team and outside consultants\nMaintain all drawings, documents, and communications according to GMHILL filing system in format that is retrievable and efficiently accessed by team members\nDeploy problem-solving skills and analysis, and report problems to the Director of Architecture, as necessary\nCoordinate routine contract administration and monthly project invoicing with project administrator\nPerform field activities such as observe and record existing field conditions, take photos, provide condition assessments, and verify measurements within project area\nTravel to project sites (In town and out of town) for client meetings and field observations\nReview shop drawings, and respond timely to RFI’s\nAssume the lead Architect role on assigned projects\nUse computer-assisted engineering and design software and equipment to prepare design documents\nMay direct and supervise other Designers/Drafters activities\nCoordinate work with other disciplines such as structural, mechanical, electrical, etc.\nOrganize, draft, and coordinate technical documents\nDemonstrate capability and experience in managing and performing projects in a fast-paced environment\nCoordinate with GMHILL Construction group personnel on D/B projects, when needed\nParticipate in proposals, presentations, interviews, and business development activities, when needed\nPerform additional assignments, as directed by the Director of Architecture\n\nEducation and Training Requirements:\n\nRegistered Architect, required (Florida, Virginia, South Carolina, Georgia, preferred)\nBachelor’s and/or Master’s degree in Architecture from an NAAB accredited institution\nMinimum 10 years’ experience in increasingly responsible architectural positions\nMinimum 3 years’ experience as project architect or project manager\nFederal project and task order experience (Defense and/or Civilian Agency), preferred\nLEED AP BD+C, a plus\nExcellent computer skills in Microsoft Office Suite\n\nSkill and Competency Requirements:\n\nSelf-starter, highly motivated, enthusiastic, able to provide architectural rigor while operating within contractual scope, budget, and schedule requirements for project deliverables on multiple concurrent projects\nCustomer Service – able to personally provide high level of interactive service to targeted customer base/market, building relationships, and acting as internal company advocate\nTeam Orientation & Interpersonal – highly motivated, passionate, and creative team-player with ability to develop and maintain collaborative relationships with all levels within and external to the organization\nCommunication – able to effectively and persuasively express self verbally and in writing, using correct language and grammar in a professional, diplomatic, and tactful manner\nOrganization & Time Management – able to work independently with minimal supervision, planning, scheduling, and organizing professional schedule to complete actions within established deadlines, handling multiple priorities with strong attention to detail\nWillingness to learn and adapt to change\nLeadership – ability to train, develop, coach, and mentor others\nSystems & Software – proficient in the use of REVIT, AutoCAD, and Microsoft Office software applications\nBasic proficiency in business processes, including contractual and legal procedures\nExperience in all phases of the design process from project planning and concepts through working drawings and construction administration.\nProblem-solving – able to apply creative solutions to a wide variety of building projects, from renovation to new construction\nStrong design review skills\nAbility to work well with others under deadline situations and respond to changes in priorities\nAbility to work independently, take initiative, set priorities, and see projects through to completion\nStrong service orientation\nValid driver’s license and current passport\nAbility to travel as needed\nSatisfactory criminal background check\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nParental leave\nRetirement plan\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nJacksonville, FL 32256: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nProject Architect or Project Management: 3 years (Preferred)\nArchitectural: 10 years (Preferred)\n\nLicense/Certification:\n\nRegistered Architect (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"Mayo Clinic","company_location":"Jacksonville, FL 32224 \n(Beach Haven area)","salary_range":"$84,094 - $117,728 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$84,094 - $117,728 a year\nJob Type\nFull-time\nFull Job Description\n\nWhy Mayo Clinic\nMayo Clinic is the nation's best hospital (U.S. News & World Report, 2021-2022) and ranked #1 in more specialties than any other care provider. We have a vast array of opportunities ranging from Nursing, Clinical, to Finance, IT, Administrative, Research and Support Services to name a few. Across all locations, you’ll find career opportunities that support diversity, equity and inclusion. At Mayo Clinic, we invest in you with opportunities for growth and development and our benefits and compensation package are highly competitive. We invite you to be a part of our team where you’ll discover a culture of teamwork, professionalism, mutual respect, and most importantly, a life-changing career!\n\nMayo Clinic offers a variety of employee benefits. For additional information please visit Mayo Clinic Benefits. Eligibility may vary.\n\nPosition description\nThis position is responsible for the preparation of signed and sealed construction documents for special and small projects. The candidate must thoroughly understand building construction and the construction/fabrication details associated with complex quality environments. Responsible for the recruiting and development of staff to operate and manage the Facilities Services' electronic database.\n\nQualifications\nEDUCATION: Requires Bachelor of Science degree in Architecture or an Associate degree and professional experience of 8-10 years. A current Architectural Registration in the State of Florida; along with significant prior architectural work experience with an architectural firm specializing in health care projects required.\nEXPERIENCE: Must demonstrate proficiency in Computer Aided Design and Drafting (CADD), computer operating systems, and other computer software applications. Must possess strong interpersonal skills.\n\nAdditional qualifications\nCOMPETENCY: Proficient with AutoCAD 2000(I) for preparation of design documents. Ability to design and prepare architectural/engineering documents. Ability to review proponent requests for compliance with institutional standards, compliance with building codes and help resolve any problems with project manager. JOB KNOWLEDGE: Must have good oral and written communication skills along with the ability to establish and meet deadlines. Must have good understanding of building mechanics, a knowledge of building materials, equipment and construction techniques, comprehensive understanding of life safety issues, building codes, and standards; ability to adapt codes to specific design conditions and solution. Must also have the ability to read and interpret construction documents, construction details, and specifications for all types of buildings. Expected to assume responsibility for maintaining personal technical competency and growth. Must be able to handle the pressure associated with heavy project load and tight time lines. ADDL CONSIDERATIONS: Must stay current with \"state of the art\" software. Expected to provide support to team members during all phases of a project to facilitate completion. Must maintain high quality standards. Required to establish and meet schedules, attend meetings, or visit work areas before or after normal working hours. Required to attend training/classes/seminars to maintain skills. Must maintain current architectural registration in the State of Florida and be in good standing.\n\nExemption status\nExempt\n\nCompensation Detail\n$84,094.40 - $117,728.00 / year\n\nBenefits eligible\nYes\n\nSchedule\nFull Time\n\nHours / Pay period\n40\n\nSchedule details\nMonday - Friday, General Hours 8am-5pm\n\nWeekend schedule\nSelect site visits during construction or for special events.\n\nInternational Assignment\nNo\n\nSite description\nJacksonville is the largest city in area in the continental United States. A beautiful coastal Florida city that features excellent year-round climate, over 20 miles of beaches and outstanding outdoor recreational, cultural and family-oriented amenities. The “River City by the Sea” has an excellent school system, reasonable cost of living and a thriving business environment. Medical professionals and patients are drawn to Jacksonville by an extraordinary network of high-profile healthcare facilities. Jacksonville continues to grow as more people relocate from all over the U.S. and abroad, to see what the great River City has to offer!\n\nRecruiter\nStephanie Dillon\n\nEOE\nAs an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"Group 4 Design","company_location":"Jacksonville, FL 32207 \n(Spring Park area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$84,094 - $117,728 a year\nJob Type\nFull-time\nFull Job Description\n\nWhy Mayo Clinic\nMayo Clinic is the nation's best hospital (U.S. News & World Report, 2021-2022) and ranked #1 in more specialties than any other care provider. We have a vast array of opportunities ranging from Nursing, Clinical, to Finance, IT, Administrative, Research and Support Services to name a few. Across all locations, you’ll find career opportunities that support diversity, equity and inclusion. At Mayo Clinic, we invest in you with opportunities for growth and development and our benefits and compensation package are highly competitive. We invite you to be a part of our team where you’ll discover a culture of teamwork, professionalism, mutual respect, and most importantly, a life-changing career!\n\nMayo Clinic offers a variety of employee benefits. For additional information please visit Mayo Clinic Benefits. Eligibility may vary.\n\nPosition description\nThis position is responsible for the preparation of signed and sealed construction documents for special and small projects. The candidate must thoroughly understand building construction and the construction/fabrication details associated with complex quality environments. Responsible for the recruiting and development of staff to operate and manage the Facilities Services' electronic database.\n\nQualifications\nEDUCATION: Requires Bachelor of Science degree in Architecture or an Associate degree and professional experience of 8-10 years. A current Architectural Registration in the State of Florida; along with significant prior architectural work experience with an architectural firm specializing in health care projects required.\nEXPERIENCE: Must demonstrate proficiency in Computer Aided Design and Drafting (CADD), computer operating systems, and other computer software applications. Must possess strong interpersonal skills.\n\nAdditional qualifications\nCOMPETENCY: Proficient with AutoCAD 2000(I) for preparation of design documents. Ability to design and prepare architectural/engineering documents. Ability to review proponent requests for compliance with institutional standards, compliance with building codes and help resolve any problems with project manager. JOB KNOWLEDGE: Must have good oral and written communication skills along with the ability to establish and meet deadlines. Must have good understanding of building mechanics, a knowledge of building materials, equipment and construction techniques, comprehensive understanding of life safety issues, building codes, and standards; ability to adapt codes to specific design conditions and solution. Must also have the ability to read and interpret construction documents, construction details, and specifications for all types of buildings. Expected to assume responsibility for maintaining personal technical competency and growth. Must be able to handle the pressure associated with heavy project load and tight time lines. ADDL CONSIDERATIONS: Must stay current with \"state of the art\" software. Expected to provide support to team members during all phases of a project to facilitate completion. Must maintain high quality standards. Required to establish and meet schedules, attend meetings, or visit work areas before or after normal working hours. Required to attend training/classes/seminars to maintain skills. Must maintain current architectural registration in the State of Florida and be in good standing.\n\nExemption status\nExempt\n\nCompensation Detail\n$84,094.40 - $117,728.00 / year\n\nBenefits eligible\nYes\n\nSchedule\nFull Time\n\nHours / Pay period\n40\n\nSchedule details\nMonday - Friday, General Hours 8am-5pm\n\nWeekend schedule\nSelect site visits during construction or for special events.\n\nInternational Assignment\nNo\n\nSite description\nJacksonville is the largest city in area in the continental United States. A beautiful coastal Florida city that features excellent year-round climate, over 20 miles of beaches and outstanding outdoor recreational, cultural and family-oriented amenities. The “River City by the Sea” has an excellent school system, reasonable cost of living and a thriving business environment. Medical professionals and patients are drawn to Jacksonville by an extraordinary network of high-profile healthcare facilities. Jacksonville continues to grow as more people relocate from all over the U.S. and abroad, to see what the great River City has to offer!\n\nRecruiter\nStephanie Dillon\n\nEOE\nAs an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"American Systems Group","company_location":"Jacksonville, FL","salary_range":"$90,000 - $120,000 a year","days_ago_posted":"Employer\nActive 7 days ago","job_description":"Job details\nSalary\n$90,000 - $120,000 a year\nJob Type\nFull-time\nQualifications\n\nBachelor's (Required)\n\nArchitecture: 5 years (Required)\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nShow 4 more benefits\nFull Job Description\n\nJob description\n\nWork Authorization: US Citizenship Required.\n\nLocation: Naval Air Station, Jacksonville, FL\n\nEducation requirements:\n\nBachelors in Architecture or equivalent.\n\nJob Description –\n\nProvide technical support services as an Architect to directly support our US Navy Prime Contract. Prepare Design Bid and or Design Build Bid work Packages for various MILCON or other construction projects and provide Post Award Construction Support Services as required.\n\nProfessional training and experience requirements:\n\nMinimum Three (3) years of professional experience as an Architect.\n\nDesirable - Ten (10) Years of professional experience as an Architect.\n\nDesirable - Registered Architect\n\nStart Date: Immediate\n\nSalary: From $90,000.00 per year\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nEducation:\n\nBachelor's (Required)\n\nWork Location: One location\n\nJob Type: Full-time\n\nPay: $90,000.00 - $120,000.00 per year\n\nBenefits:\n\nDental insurance\nEmployee assistance program\nHealth insurance\nLife insurance\nPaid time off\nReferral program\nRelocation assistance\nRetirement plan\nTuition reimbursement\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nCOVID-19 considerations:\nFollow All COVID 19 Protocols @ Naval Station, Mayport, FL\n\nEducation:\n\nBachelor's (Required)\n\nExperience:\n\nArchitecture: 5 years (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 4 candidates for this role\n\nUrgently hiring\n\nJob activity\nEmployer reviewed job 7 days ago\nPosted 30+ days ago"},{"job_title":"Architect - Jacksonville, FL","company_name":"Halff Associates","company_location":"Jacksonville, FL 32256","salary_range":null,"days_ago_posted":"Posted\nPosted 1 day ago","job_description":"Benefits\nPulled from the full job description\n401(k)\nDental insurance\nDisability insurance\nEmployee assistance program\nEmployee stock ownership plan\nHealth insurance\nShow 3 more benefits\nIndeed's salary guide\nNot provided by employer\n$73.3K - $92.9K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nArchitect - Jacksonville, FL\nHalff Associates is a full service architectural and engineering firm with creative architects and engineers and experience professionals working on impactful projects and experienced at creating sustainable buildings. We offer clients a full suite of architectural and engineering services through our collaborative process that results in projects that are thoughtful engaging. Our portfolio includes corporate, government, higher education, industrial, commercial architecture projects, and more, and is continuing to expand. We are actively seeking energetic, self-motivated, and highly collaborative Architects with demonstrated capabilities in design, production, as well as verbal and written communication skills. Previous experience working in an architectural and or an architectural and engineering firm is preferred as is a strong willingness to learn and work as a team member.\n\nResponsibilities:\nDisplay design and graphic skills\nEnsure that drawings incorporate industry standards and compliance with applicable building codes\nWork both independently and in a team environment on a variety of projects and tasks\nWork with senior architects, and engineers through the planning, design and production of project documents\nLead production of project documents\nInterface with consultants, owner representatives, and review officials\nRequirements:\nBachelor’s Degree in Architecture, Master’s Degree in Architecture highly desirable\n3-8 years’ experience\nLicensed Architect in Florida preferred or ability to become licensed in Florida\nWorking knowledge in design and production of all phases of architectural project delivery including programming, design, design development, construction documents, and construction administration\nExcellent organizational and time management skills\nExcellent verbal and writing skills\nCollaborative, team oriented, and readiness to learn quickly\nLEED accreditation is a plus\nAbility to meet fast paced project demands\nProficient with Revit (BIM)\nFamiliarity with Navisworks, AutoCAD, and scheduling and spreadsheet applications a plus\nExperience in writing specifications a plus\n\n\nCompany Overview:\nHalff is a mid-sized, employee-owned, diverse and multi-disciplined professional services firm. For more than 70 years, Halff has provided smarter solutions throughout the United States offering services in Architecture, Construction Services, Energy, Environmental, Geographic Information Systems, Intelligent Transportation Systems, Land and Site Development, Planning and Landscape Architecture, MEP Engineering, Public Works, Right of Way, Structural Engineering, Subsurface Utility Engineering/Utility Coordination, Surveying, Transportation, Water Resources and Water/Wastewater.\nHalff has offices in the following locations:\nArkansas: Bentonville, Fort Smith, Little Rock and North Little Rock\nFlorida: Chipley, Jacksonville, Miramar Beach, Panama City Beach, Tallahassee, Tampa and Tavares\nLouisiana: Baton Rouge and Shreveport\nOklahoma: Oklahoma City\nTexas: Austin, Brownsville, Conroe, Corpus Christi, Flower Mound, Fort Worth, Frisco, Houston, Midland, McAllen, Richardson, San Antonio and Tyler\nWe offer excellent benefits including medical, dental, prescription, life insurance, long-term and short-term disability insurance, paid time off and holiday pay, Traditional and Roth 401(k) plans, Employee Stock Ownership Plan, Health Savings Account, 529 College Savings Plan, Flexible Spending, an Employee Assistance Plan and more.\nSalary is competitive and commensurate with experience.\nHalff is an Equal Opportunity Employer, including disability and protected veteran status.\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Architectural Associate","company_name":"Thomas Duke Architect, PA","company_location":"Hybrid remote in Jacksonville, FL 32204","salary_range":"$50,000 - $60,000 a year","days_ago_posted":"Employer\nActive 2 days ago","job_description":"Job details\nSalary\n$50,000 - $60,000 a year\nJob Type\nFull-time\nQualifications\n\nBachelor's (Preferred)\n\nAutoCAD: 1 year (Preferred)\n\nBenefits\nPulled from the full job description\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\nFull Job Description\n\nTDA is seeking a positive and creative architectural associate, for an immediate position, who would like to expand their experience with significant input on a wide variety of projects. We are an award winning firm doing work from Texas to the Caribbean looking to add a new member to our design team.\n\nTDA is located in the Railyard district, an up and coming area of Jacksonville. We offer a competitive salary, flexible work schedule and room for growth.\n\nJob Type: Full-time\n\nPay: $50,000.00 - $60,000.00 per year\n\nBenefits:\n\nDental insurance\nFlexible schedule\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nJacksonville, FL 32204: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nAutoCAD: 1 year (Preferred)\n\nWork Location: Hybrid remote in Jacksonville, FL 32204\n\nHiring Insights\n\nHiring 2 candidates for this role\n\nUrgently hiring\n\nJob activity\nEmployer reviewed job 2 days ago\nPosted 30+ days ago"},{"job_title":"Architectural Designer","company_name":"OMI Consulting, LLC","company_location":"Jacksonville, FL 32207 \n(San Marco area)","salary_range":"$70,000 - $100,000 a year","days_ago_posted":"Hiring ongoing","job_description":"Job details\nSalary\n$70,000 - $100,000 a year\nJob Type\nFull-time\nQualifications\n\nBachelor's (Required)\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nShow 3 more benefits\nFull Job Description\n\nIf you are a passionate Architecture Designer looking to join a growing firm, there is an incredible opportunity that awaits in the area. This reputable Architecture and Design Firm is looking for an experienced Architecture Designer that wants to be a part of a growing and successful culture. Looking to for great mentorship, leadership, growth look no more!\n\nSeeking an Architecture Designer with technical skills.\n\nAssist in developing building design concepts and solutions, generating construction documents\nMUST be familiar with Multifamily, Residential, Commercial\nParticipating in collaborative team design meetings, and occasionally working with outside consultants.\nYou will exercise your technical skills in preparing communication graphics, design visualizations, and preparing technical construction documents\n\nResponsibilities:\n\nMust be someone who is looking for career growth\nWill be working with design and drawing production teams through all phases of client projects. Use experience to bring new approaches to the design process. Help our clients imagine and create what is possible.\nUtilizing Revit, AutoCAD, software, design, prepare construction drawings\nUtilizing Adobe Creative Suite programs, prepare communication graphics, presentations\nWork collaboratively with project team members\nAssist in preparing assembly, enclosure, and waterproofing details under experienced supervision\nProcess construction submittals, RFIs, substitution requests and shop drawings\n\nBenefits:\n\nOur benefits include medical, paid holidays and paid time off.\nOffer employee stock ownership and annual bonus opportunities.\nOffer reimbursement for certain professional licenses and associates renewals\n$70-100K (negotiable depending on years of experience)\nExcellent Benefit Package (401k, Health, Dental, Bonus)\n\nQualifications:\n\n3-6 years of demonstrable experience as an architectural designer\nProficiency in Revit\n3D rendering and visualization skills\nConceptual understanding of building codes, standards and building structures\nConceptual understanding how buildings are constructed with the ability to co-create technical details and documents that succinctly describe the project\nStrong organizational, communication and interpersonal skills\nBachelor’s degree in Architecture or related field\nFamiliarity with LEED a plus\n\nJob Type: Full-time\n\nPay: $70,000.00 - $100,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nDelray Beach, FL: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Required)\n\nWork Location: One location\n\nHiring Insights\n\nApplication response rate: 51%\n\nOn-going need to fill this role\n\nJob activity\nPosted 9 days ago"},{"job_title":"Project Architect","company_name":"BDG Architects","company_location":"Jacksonville, FL 32202 \n(Downtown Jacksonville area)","salary_range":null,"days_ago_posted":"Posted\nPosted 5 days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$71.6K - $90.6K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nWe are looking for someone that understands the importance of high-quality documentation and specification development, works well independently as well as with a team, possesses strong organizational and communication skills, has a strong attention to detail and propensity for problem solving. If that sounds like you, we want to hear from you!\n\nPreference given to those with Multi-family, Healthcare, Mixed-use, Hospitality, and/or Retail experience.\n\nBDG Architects has established an excellent office location at 100 North Laura St., in the middle of the vibrant and growing central core on the north bank of Downtown Jacksonville. This is an opportunity to be a key asset in BDG's growing Jacksonville office, which was established in 2021. We offer a flexible and fun work environment backed by a growing pipeline of work both in Jacksonville and beyond. We offer a competitive compensation package, commensurate with experience.\n\nWe are currently seeking candidates with approximately 6-20 years of experience with licensure to practice Architecture within an NCARB jurisdiction of the United States. An in-depth understanding of and working proficiency in Revit is required. Ambitious, collaborative, goal-oriented individuals on the path to licensure will also be considered for a role that would progress to a Project Architect upon licensure.\n\nBDG Architects is a full-service architecture and design firm with its headquarters in Tampa, Florida. With southeast regional offices in Jacksonville, Florida, Birmingham, Alabama and Charlotte, North Carolina BDG has been in business more than 25 years, serving clients throughout Florida and the United States. We have built our reputation as being on the leading edge of our industry through design excellence, building lasting relationships, and delivering high value to our clients. BDG understands that each client has a unique set of business strategies, which we focus our services to support, creating a true partnership. Our projects are extremely diverse in terms of project type, design styles, practice areas and scale. Additional information can be found at www.BDGLLP.com.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 5 days ago"},{"job_title":"Aviation Architect","company_name":"RS&H","company_location":"Jacksonville, FL 32256 \n(Deerwood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nIndeed's salary guide\nNot provided by employer\n$81.9K - $104K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\nThe Opportunity:\nRS&H is currently seeking an Architect to join our Aviation Practice in Ft. Lauderdale, Florida.\nWhat we do:\n\nWe design airports and aviation-related facilities throughout the US and abroad. Aviation Architecture consistently represents a complex commingling of multiple building types/ functions (civic, cultural, commercial, hospitality, office, retail, workplace, interiors, etc.) often under one roof.\n\nOur projects are experienced by millions of people each year and can reach hundreds of millions of dollars in construction value. The clients we serve are focused on providing the best customer experience through outstanding design, technical excellence, and a desire for community.\n\n\nThe RS&H Design Philosophy: We believe the best buildings uplift and affirm the people they serve, embody elegant form and function, and manifest purpose, personality, and spirit.\n\nWho we are looking for:\n\nRS&H is actively seeking an experienced, registered Project Architect/Project Manager.\nWe foster, value, and reward people who are creative, self-motivated, and collegial. As an Aviation Architect with RS&H you will have the opportunity to deliver projects of various sizes and complexities. Your work will be informed and supported by in-house planners, airfield and building engineers, and environmental specialists to ensure that all aspects of any aviation facility are accounted for and integrated into the design.\n\n\nThis is a unique opportunity to join a team that will embrace your ideas to even better serve our great clients.\n\nQualifications:\nProfessional NAAB accredited degree in Architecture\nRegistered architect in good standing with the ability to obtain reciprocity\nMinimum 5+ years of related experience\nThorough knowledge of architectural design, drafting, detailing, building materials, building codes, construction techniques and costs\nProven knowledge of general architecture practice including programming, site planning, civil, structural, mechanical and electrical engineering\nCapable in marketing building-related services to existing and new clients\nAdept at mentoring and encouraging young architects to maximize their abilities\nStrong analytical, oral and written communication skills\nAbility to build quick rapport and assemble quality teams\nSkilled in the areas of problem identification and solving skills\nKnowledge of the aviation market sector's unique challenges for planning, design and regulation is preferred\nAdept in the preparation of architectural construction documents and coordination of those with building engineering disciplines\nCapacity to work on multiple projects concurrently in various stages of design and construction\nReview and process shop drawings, maintain and record changes on project during construction administration\nCoordinate with project leadership team to develop execution plans\nReview drawings, suggest revisions and work with team to update designs on those suggestion\nOversee a team of architects and engineers working on an architectural project, reporting progress to the project lead as needed\n\nBenefits:\nHoliday Pay\nPaid Time Off\n401K\nMedical and Dental\nClick Here for Full Benefits Information\nIf this sounds like the role for you and you're ready to join an amazing team, please apply.\n\n#LI-KA1\nThe Team:\nOur aviation experts are recognized, industry leaders who provide cutting-edge solutions that shape the future of aviation in four broad service areas: airfields, buildings, environmental, and planning. From large hub to small hub, commercial to private, you can help create aviation systems that serve communities around the world.\nThe Company:\nRS&H provides fully integrated architecture, engineering, and consulting services to help clients realize their most complex facility and infrastructure projects for land, air, and space. We are committed to bringing extraordinary solutions to our clients through the promise of imagination, ingenuity, and innovation. With a tradition of excellence that began in 1941, we are consistently ranked among the nation’s top 100 design firms. We attribute our success to an unwavering commitment to our core values of: integrity, quality service, business success and valuing associates.\n\nAn Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.\n\nPlease view Equal Employment Opportunity Posters provided by OFCCP here.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Associate","company_name":"RS&H","company_location":"Jacksonville, FL 32256 \n(Deerwood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 20 days ago","job_description":null},{"job_title":"Building Plans Examiner / Architect","company_name":"City of Jacksonville, FL","company_location":"Jacksonville, FL","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Building Envelope Specialist - Project Architect or Engineer","company_name":"Prime AE Group Inc","company_location":"Jacksonville, FL 32224 \n(Beach Haven area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Project Architect","company_name":"RS&H","company_location":"Jacksonville, FL 32256 \n(Deerwood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Project Architect","company_name":"Perkins+Will","company_location":"Jacksonville, FL 32258 \n(Del Rio area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Associate Architect II","company_name":"HNTB Corporation","company_location":"Jacksonville, FL 32232 \n(Spring Park area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$73.1K - $92.5K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nWhat We're Looking For\n\nWe are seeking a talented Architects to join our National Award Winning Architectural Practice! Those interested in joining our team should be proactive and approach design challenges with a willingness to explore lots of ideas.\n\nWe are a group of design professionals that are passionate about Aviation design. Our practice believes great design comes from a spirit of curiosity, imagination and collaboration. We value diverse perspectives during the design process and take pride in delivering solutions that are specifically tailored to each client. We view each project as an opportunity to\n\ncreate something truly unique that connects us as a community.\n\nCheck out our cool projects: https://hntbarch.wixsite.com/join\n\nThis position is responsible for specific technical design aspects of an assigned project including investigation, evaluation and recommendation of design solutions. Assigned to handle specific technical design aspects of a project for which he/she is responsible including investigating, evaluating, and recommending the design solutions that best meet the client's needs. Performs assignments under direction with limited responsibility for design.\n\nPrimary Focus Will Include:\n\nCollaborates with other lead professionals to ensure design and documentation are in accordance with project expectations\nLeads drawing development, including detailing, coordinates with quality control, and projects deadlines with the Project architect and/or Project Manager.\nProduces construction documents.\nAsist with the evaluation of code compliance.\nAttends coordination and construction meetings and prepares ﬁeld reports.\nConstruction Administration Experience: Site observation, assists answering RFI's, reviewing and processing submittals and prepares shop drawings.\n\nPreferred Qualifications and Skills:\n\nBachelor's degree in Architecture at an accredited university\n5+ years of architecture experience\nAbility to prioritize and concurrently service multiple projects\nStrong verbal and written communication skills\nEffective problem solving and interpersonal skills and the ability to interface with all clients and employees\nInteracts well with other disciplines and clients in a manner that builds productive relationships\nProﬁcient with Revit is a must\nDesire to grow team professionals through education and mentoring\nAbility to balance the needs of projects with corporate goals\nIND\n\nWhat You'll Need\n\nEssential Responsibilities:\n\nProvides professional architectural consulting in the planning, design and coordination of project assignments. Makes recommendations on design alternatives.\nApplies diverse knowledge of architectural principles and practices in broad array of assignments. Independently makes decisions on significant architectural design problems and methods. Has full technical responsibility for interpreting, organizing, executing and coordinating architectural design assignments.\nResponsible for specific technical design aspects of an assigned project, including investigation, evaluation and recommendation of design solutions that best meet the client's need. Frequently researches unusual and non-recurring problems.\nIndependently applies advanced architectural concepts and designs. Carries out assignments requiring the development of new or improved techniques and procedures.\nMay provide technical guidance to less experienced architects.\nMay assist with proposal preparation/business development.\nPerforms other duties as assigned.\n\nMinimum Qualifications:\n\nBachelor's degree in Architecture\n2 years related experience\nRevit skills\n\nAdditional Information\n\nClick here for benefits information: HNTB Total Rewards\n\nClick here to learn more about EOE including disability and vet\n\nVisa sponsorship is not available for this position.\n\n\\#KJ #Architecture\n\n.\n\nPay Range for New York, NY: $66,572.34 - $99,858.51\n\nActual Compensation will be dependent upon the individual's qualifications, skills and experience as well as physical work location within the state.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nNOTICE TO THIRD-PARTY AGENCIES:\n\nHNTB does not accept unsolicited resumes from recruiters or agencies. Any staffing/employment agency, person or entity that submits an unsolicited resume to this site does so with the understanding that the applicant's resume will become the property of HNTB. HNTB will have the right to hire that applicant at its discretion and without any fee owed to the submitting staffing/employment agency, person or entity. Staffing/employment agencies who have fee agreements with HNTB must submit applicants to the designated HNTB recruiter to be eligible for placement fees.\n\nJob Type: Regular\n\nFull/Part Time: Full time\n\nJob Category: Architecture Group\n\nReqID: R-11997\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect - Healthcare Market","company_name":"Gresham Smith","company_location":"Jacksonville, FL 32099","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$80.3K - $102K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\nJob Description:\n\n\nOur healthcare team specializes in architectural design and planning to deliver research-based, value-added solutions for health systems, care providers, and patients alike.\n\nResponsibilities:\n\nLead small to mid-size healthcare projects from conception through completion of the construction phase as Architect of Record.\nPlay a key role on large projects.\nIn design phases, lead and manage all phases of document production.\nIn construction administration review submittals, support and/or lead field observations, and agency reviews.\nManage the work of project coordinators and outside consultants.\nAttend and/or lead meetings with AHJ’s and Agency Reviews.\nAnalyze client problems and develop architectural solutions to those problems.\n\n\n\n\n5 year Bachelor's/Master's degree in Architecture, Architecture License required.\n6-10 years of job-related experience as an architect within the AE industry.\n4 years of Healthcare experience is required.\nDemonstrated experience using AutoCAD, REVIT Sketchup, BIM modeling software.\nAbility to interact professionally and comfortably with a variety of personalities and communication styles and build and maintain excellent interpersonal relationships.\nProficient in Microsoft Office applications, particularly Word and Excel.\nExcellent Quality Control skills\nTime management skills.\nYou must include a portfolio of work samples along with a resume/CV in your online application.\n\nGresham Smith is committed to a diverse and inclusive workplace. Gresham Smith provides equal employment opportunities to applicants and employees and does not discriminate on the basis of age, race, color, ancestry, religion, sex, sexual orientation, gender identity, national origin, status as a protected veteran, disability, or any other classification protected by law.\n\nGresham Smith will not accept unsolicited resumes from recruiters, headhunters, contract recruiters, search firms, or employment agencies. An executed GRESHAM SMITH PLACEMENT SERVICES AGREEMENT (PSA) is required prior to any payment obligation for either a referral or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously executed PSA, Gresham Smith explicitly reserves the right to recruit and hire those candidate(s) at its discretion, and without any financial obligation whatsoever to the recruiter or agency. Any such unsolicited resume or candidate contact information, including those submitted directly to Gresham Smith’s hiring managers or any other employee, shall become the property of Gresham Smith upon receipt.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Sr. Architectural Project Manager","company_name":"RogueSearch","company_location":"Hybrid remote in Jacksonville, FL 32211","salary_range":"$80,000 - $90,000 a year","days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Job details\nSalary\n$80,000 - $90,000 a year\nJob Type\nFull-time\nQualifications\n\nRevit: 1 year (Preferred)\n\nSketchup: 1 year (Preferred)\n\nWork authorization (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nFull Job Description\n\nArchitectural Senior Project Manager (Residential)\n\nJacksonville, FL\n\nThe Senior Architectural Project Manager is directly responsible for managing assigned builder accounts, projects, and teams. Participation in strategy and planning for resource allocation and product development are key responsibilities.\n\nHighlights:\n\nCollaborative Design Approach - The appreciation for cost effective design and lean processes is embedded in the corporate culture.\nEstablished Client Relationships - Opportunity to step in and lead projects for existing clientele\nQuality Focused - Formed in 2008, with a mission from the beginning to create high quality home designs without the high-quality price.\nHybrid Role - This position offers the ability to work a hybrid in-office (Jacksonville) 3 days/2 days from home schedule\n\nWhat You’ll Do:\n\nInitial point of contact for Central Processing, customer service, production Department, and the client for all new and existing product development.\nBuilder/Trade partner meetings and resolution of field issues and project status\nResponsible for managing their team to meet deadlines, answer questions, solve problems, and improve the profitability of accounts.\nManage project workflow and communication across all applicable departments.\nAssist with development of Scope of Work & pricing instruction for new & existing projects.\nAssist with onboarding of new clients and projects to help define workflows and scheduling.\nEnsure pricing standards for clients and accounts are properly applied to projects.\nTrack projects for completion and report status to accounting for invoicing.\nRegularly review account performance and communicate with manager on status.\nResponsible for the technical accuracy of construction documents for clients\nAssist with the preparation of construction documents and details as needed.\nProject Tracking- maintain log of work performed\nEffectively track time and job status to maintain efficient workflow\nDemonstrate efficient and competent use of project tracking software\nTeam management- review and approve timesheets, mentor and train designers, and annually review Junior PM performance.\nProvide feedback for the improvement of design tools and workflows to increase efficiency.\nParticipate on committees and work on special projects as assigned\n\nWhat You’ll Need:\n\nMinimum Bachelors’ Degree Required or equivalent combination of education and experience.\nArchitecture license preferred but NOT required\nMinimum 5-7 years of related experience including some management\nExperience and Leadership skills to focus on transfer of knowledge, development of subject matter, and solving issues surrounding building code compliance and design\nAdvanced knowledge of AutoCAD/Revit/applicable discipline specific software\nAdvanced knowledge of ability to prepare Construction Documents\nAdvanced knowledge of various construction techniques and building code.\nIntermediate knowledge of best industry packages\nIntermediate knowledge of Microsoft Office Suite\nDeltek Experience Preferred\n\nJob Type: Full-time\n\nPay: $80,000.00 - $90,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\n\nSchedule:\n\nDay shift\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nJacksonville, FL 32211: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nRevit: 1 year (Preferred)\nSketchup: 1 year (Preferred)\n\nWork Location: Hybrid remote in Jacksonville, FL 32211\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 7 days ago"},{"job_title":"Commercial Architect","company_name":"GENPLANT ON-SITE ENERGY LLC","company_location":"Green Cove Springs, FL 32043","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$69.7K - $88.2K a year is Indeed's estimated salary for this role in Green Cove Springs, FL.\nReport inaccurate salary\nFull Job Description\nCompany Overview Summary\nGenplant LLC is an innovative energy solutions provider focused on delivering energy solutions including optimization services, energy plants and operations and maintenance of energy systems. Our unique modular energy plant design reduces cost, improves efficiency, increases reliability, and optimizes energy production for businesses. Genplant delivers energy system solutions that generate electricity, steam, hot water and/or chilled water that can be designed, built and installed quickly, at lower cost and in higher volume than custom engineered solutions. We are looking for candidates who are self-starters and who want to join a dynamic growing organization.\n\nJob Summary\nThe Commercial Architect is an integral part of the Design Department Team with responsibilities including design, engineering, and creating manufacturing and field installation drawings for projects.\nDuties/Responsibilities\nThe Commercial Architect will successfully perform the following tasks, duties, and responsibilities:\nArchitectural design of modular buildings\nProduces conceptual plans, renderings, and documents\nPlans and programs layout of projects; coordinates and integrates engineering elements into unified designs for client review and approval\nGenerates design documents for permitting and construction\nGenerates calculations, specifications, drawings, and models in 3D or CAD software\nEnsures all design work conforms to all industry standards and guidelines, including, but not limited to: IBC, ASCE, ACI, ASHRAE, ASME, OSHA, NFPA, ADA\nCoordinates work with other disciplines such as architectural, mechanical, electrical, etc.\nPrepares and maintains commission records of site observations, testing processes, and checklists\nAssists in research and coordination of materials and products for project specifications\nContributes to the continued growth of the design checklist, leading to improvement of design standards\nInterfaces with vendors, customers, and contractors. Reviews vendor quotes and specifications.\nWorks with departmental managers to meet Company and departmental goals and objectives\nAssists Sales and Project Development teams in new project proposals and new project costs estimates\nResearches new products and design methods to innovate current designs\n*Other duties as required in support of the department and the Company*\nQualifications\nThe Commercial Architect should possess the following skills, characteristics, and abilities:\nExperience in designing commercial structures. Experience in modular design a plus.\nAbility to read, interpret, utilize, and train on manuals, schematics, and control circuits related to CHP\nTechnical aptitude with knowledge of codes and an ability to handle multiple tasks and assignments\nCapable and experienced in managing and performing projects in a fast-paced environment\nExcellent customer service skills\nDetail-oriented and highly organized with the ability to handle multiple tasks and assignments\nStrong computer skills; knowledge of and proficiency in common Office applications\nExpert at 2D and 3D CAD\nEducation and Experience\nBachelor’s degree in Architecture or related field\n3+ years of related experience\nKnowledge of building codes, zoning regulations, building construction, building systems, and site requirements\nProficiency in Revit, AutoCAD, Photoshop, and Microsoft Office suite is required\nArchitectural license a plus\n\nAdditional Requirements\nMinimal travel expected for this position\nBilingual English/Spanish a plus\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"ARCHITECTURAL PROFESSIONAL","company_name":"PQH Group Design","company_location":"Jacksonville, FL 32216 \n(Southpoint area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$73.8K - $93.5K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nARCHITECTURAL PROFESSIONAL | We're looking for a dedicated, self motivated, design professional with REVIT experience to join our team. Ideal candidates should have at least 5-6 years experience and either be licensed or on the path to being licensed. A college degree in Architecture in preferred. Individuals must possess the ability to interact with clients, consultants and collaborate with other in-house staff. Qualified candidates should send a Resume, Project History and Portfolio to: CONTACT\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect / Project Manager","company_name":"OMI Consulting, LLC","company_location":"Jacksonville, FL 32207 \n(San Marco area)","salary_range":"$80,000 - $120,000 a year","days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Job details\nSalary\n$80,000 - $120,000 a year\nJob Type\nFull-time\nQualifications\n\nBachelor's (Required)\n\nArchitecture License (Required)\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nShow 4 more benefits\nFull Job Description\n\nIf you are a passionate Project Architect/ Project Manager looking to join a growing firm, there is an incredible opportunity that awaits. This reputable award winning Architecture and Design firm is looking for an experienced Project Architect/ Project Manager that wants to be a part of a growing and successful culture. Looking for great mentorship, leadership, and growth within your career look no more!\n\nRequirements:\n\nMinimum 10+ years of architectural and project architect experience\nLicensed preferred if not at least 10 year of experience\nMust have Revit experienced\nProject type: Commercial, Mixed USE, Multifamily, High End Residential, Education, Government\nMust be well organized, detailed oriented, have a strong work ethic, self-motivated, and work well as a team member.\nMust be able to manage projects from schematic design through construction to ensure high quality, innovative and functional project design.\nAbility to follow directions and client relations a must\nAssist in developing building design concepts and solutions, generating design drawings\nParticipating in collaborative team design meetings, and occasionally working with outside consultants\nYou will exercise your technical skills in preparing communication graphics, design visualizations, and preparing technical construction documents.\n\nResponsibilities:\n\nSite visits, client and contractor interface\nWill be working with design and drawing production teams through all phases of client projects. Use experience to bring new approaches to the design process. Help our clients imagine and create what is possible\nWork collaboratively with project team member\n\nBenefits:\n\nMedical, paid holidays and paid time off\nHybrid flexible schedule\nMultiple office locations\n$80-120k (negotiable depending on years of experience)\nExcellent Benefit Package (401k matching, Health, Dental, Bonus, Profit sharing)\n\nQualifications:\n\n10+ years of experience\nStrong leadership skills\nConceptual understanding of building codes, standards and building structures\nStrong organizational, communication and interpersonal skills\nBachelor’s or Master's degree in Architecture or related field\n\nJob Type: Full-time\n\nPay: $80,000.00 - $120,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible schedule\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nSaint Petersburg, FL 33701: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Required)\n\nLicense/Certification:\n\nArchitecture License (Required)\n\nWork Location: One location\n\nHiring Insights\n\nApplication response rate: 51%\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 7 days ago"},{"job_title":"Project Architect","company_name":"Novus Architects Inc","company_location":"Jacksonville, FL","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$84.2K - $107K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nDescription:\n\nABOUT NOVUS ARCHITECTS\n\nNovus Architects is a full-service architecture firm with offices in Charleston, SC, Atlanta, GA, Asheville, NC, Charlotte, NC, Jacksonville, FL and Springline Architects in St. Thomas, USVI. Novus is committed to quality in both their work and relationships, and has an innovative approach to solution-based design and project management that sets them apart as a firm.\n\nThe Novus portfolio of work is a reflection of their experience in many building sectors including Healthcare, K-12, Higher Ed, Financial, Municipal, Hospitality, Multi-Family, Recreation, Commercial, and Worship. With a staff that has a diverse set of skills in Architecture, Interior Design, Project Management, FFE Coordination, Environmental Graphics and Construction Administration, Novus has positioned themselves as an established design firm with both regional and national clients.\n\nTEAM NOVUS\n\nAs a set of individuals with diverse talents, we come together to make up a team that challenges itself creatively every day. Thru thoughtful collaboration, respect, and mentorship, we continue to build an engaging work environment and a company culture we can’t help but celebrate. We want you to bring your ideas and passion to the table and always encourage innovation that leads to creative solutions.\n\nIt’s important to us to foster our staff’s growth through leadership training, professional certifications, continuing education, and conference participation. Our staff finds reward in seeing this growth within themselves, their peers, and the company as a whole-a defining aspect of the understanding we have that our greatest asset is our employees.\n\nThe Successful Candidate will:\n\nBe responsible for the coordination of all project efforts, administrative and technical, to ensure the most efficient and cost-effective execution of assigned projects.\nSuccessfully manage a project from concept through completion while simultaneously managing staff and client relationships.\nThis Job has the option of working remotely or in an office.\n\nDuties/Responsibilities:\n\nSupervisory\n\nResponsible for managing 2 or more direct reports. Will manage 2 or more projects concurrently.\nManage a team remotely using Microsoft Teams and Bluebeam sessions.\n\nArchitectural\n\nBe a highly productive architect with demonstrated skills in conceptualizing and adapting design templates that will enable efficient completion of sequential projects.\nComplete a project from beginning to end in Revit, with little direction, by reviewing “go by” drawing sets, including modeling existing conditions from field survey information.\nReview drawings, generate redlines and review to ensure redlines are completed.\nReview building code to ensure compliance to code requirements.\nCoordinate with consultants, jurisdictions, and client to ensure client needs are met.\nCoordinate with team for Permitting, Bidding, and Construction Administration to ensure project success.\nUnderstand and coordinate with existing conditions for renovation projects.\n\nProject Management\n\nManage multiple small/medium projects, coordinates all aspects of assigned projects, and estimates scope of work.\nEnsure project deadlines are met.\nResponsible for the coordination of all project efforts, administrative and technical, to ensure the most efficient and cost-effective execution of assigned projects.\nUnderstand project profitability.\nMake effective use of support staff.\nRequirements:\nClear, effective communication, problem-solving skills, attention to detail, and a strong drive to see results that will ensure you retain highly satisfied clients.\nExceptional communication skills for working directly with consultants, jurisdictions, and general contractors.\nStrong analytical and problem-solving skills space planning.\nAbility to work with minimal supervision.\nAbility to work on tight deadlines with excellent time management skills with a proven ability to meet deadlines.\nHave strong process-management skills.\nExcellent organizational skills and attention to detail.\nAbility to function well in a high-paced environment.\nProficient with Revit, Microsoft Office Suite, and Bluebeam.\nDocumentable experience training and leading junior level staff.\nAbility to work effectively both independently and as part as a team.\n\nEducation and Experience:\n\n10 or more years of experience in Architecture.\nProfessional degree in Architecture.\nLicensure required.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"The Haskell Company","company_location":"Jacksonville, FL 32202","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$80.9K - $102K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nAre you ready to move your career forward, and start the BEST job of your life? Haskell is committed to providing you with the resources to help you grow and discover your potential. We promote an environment that encourages innovative ideas and allows you to develop the best “how” to get the job done.\n\nThe Consumer Packaged Goods (CPG) Group at Haskell supports core markets throughout the U.S., as well as Mexico and the Asia Pacific Region. Providing architecture, engineering, and construction for over 55 years in the food and beverage, consumer products, and beer, wine, and spirits markets, we work closely with many Fortune 500 companies providing our industry knowledge and expertise. Our CPG team is a melting pot of industry-leading experts and diverse, knowledgeable and experienced team members who work together to provide the best solutions to our clients. By joining the CPG team, you will become a part of a close-knit family ready to support each other and our clients. We offer a unique opportunity to build your skills, provide knowledge and create things that matter.\n\nIn this role, you will be responsible for the production of innovative and appropriately cost-effective, designs, drawings, and specifications for assigned projects. Further, you will maintain a professional registration and sign/seal documents prepared under your supervision. You must have experience with REVIT. Experience as an Architect within the Design/Build industry is highly preferred.\n\nJob Responsibilities:\n\nConceptual Design\nUtilizes innovation in design and methods\nDevelops design concepts, recommends systems, produces pricing and proposal documents, and outlines specifications\nResearches and is responsible for discipline design compliance with proposal/client criteria\nEstablish a Discipline basis for design\nDetailed Design\nAnalysis Ability\nResearches, and documents and is responsible for discipline design compliance with all applicable codes, ordinances, standards, and regulations\nDesigning for Safety incorporated into drawings\nDetailing\nComply with the QIP\nUses Haskell standards and procedures\nCoordinates work with other disciplines, including outside consultants as applicable. Performs interdisciplinary coordination checks to minimize deficiencies, errors, and omissions in drawings and specifications\nLeads the production of well-organized, finished drawings of good appearance, accuracy, clarity, and correctness\nConstruction Documents\nSigns and seals design documents when assigned as Professional of Record\nConstruction Support\nReviews applicable shop drawings and submittal data for compliance with construction documents\nAdvises and assists Construction Project Managers, Superintendents, and Subcontractors in the interpretation and clarification of construction documents\nParticipates in construction observation to monitor compliance with design intent, construction drawings, and specifications. Prepares inspection reports and punch lists\nProvides solutions to field problems, responds to RFI, and prepares field orders and addenda\nLeads production and archiving of record drawings and specifications\nPlanning/Scheduling\nProjects, monitors, and informs design manager of workload status of project discipline staff\nParticipates in project strategy meetings\nParticipates in the creation of overall key date schedule, including permitting schedule\nCreates discipline work plan for assigned projects\nProfitability\nPrepares man-hour estimate for discipline work\nAssists the Design Manager in monitoring costs of discipline-related outside consultants\nParticipates in team review to assure discipline scope is covered in project budgets, estimates, and subcontractor bids\nProject Management\nDirects technical efforts of discipline staff assigned to the project\nMonitors discipline adherence to strategy, key date schedule, and work plan\nAssists in coordinating information with and monitoring discipline-related outside consultants\nMonitors workload status; advises design manager\nPrepares meeting minutes and other communications in coordination with the design manager\nMentoring assigned staff\n\nEducation/Experience:\n\nBachelor’s degree in Architecture from an accredited college or university\nProject Architect I: 3-5 years of typical minimum discipline experience\nProject Architect II: 5-8 years of typical minimum discipline experience\n\nSpecific Knowledge, Skills, License, Certifications:\n\nLicensed Professional Architect, preferred\nKnowledgeable in A/E technology and software. (ACAD, Revit, BIM)\nDiscipline production software proficiency\nIntermediate skills in Microsoft Office\n\nEnvironmental Factors and/or Physical Requirements:\n\nWhile performing the duties of this job, this position is required to have ordinary ambulatory skills sufficient to visit other locations; and the ability to stand, walk, stoop, kneel, crouch, and manipulate (lift, carry, move) light to medium weights of 10-50 pounds. Requires good hand-eye coordination, and arm, hand and finger dexterity, including the ability to grasp, and visual acuity to use a keyboard, operate equipment and read application/form information. The associate frequently is required to sit, reach with hands and arms, talk, and hear.\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities:\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, citizenship, disability, or protected veteran status.\n\nHaskell will make reasonable accommodations in compliance with the Americans with Disabilities Act of 1990 and the Americans with Disabilities Act Amendments Act of 2008. The job description will be reviewed periodically as duties and responsibilities change with business necessities. Essential and marginal job functions are subject to modification.\n\nHaskell is a Drug-Free Workplace.\n\n#LI-RT1\n\nEducation\nRequired\nBachelors or better in Architecture\nPreferred\nMasters or better in Architecture\nLicenses & Certifications\nRequired\nRegistered Architect\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"HNTB Corporation","company_location":"Jacksonville, FL 32232 \n(Spring Park area)","salary_range":null,"days_ago_posted":"Posted\nPosted 28 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$78.5K - $99.5K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nWhat We're Looking For\n\nWe are seeking a talented Architects to join our National Award Winning Architectural Practice! Those interested in joining our team should be proactive and approach design challenges with a willingness to explore lots of ideas.\n\nWe are a group of design professionals that are passionate about Aviation design. Our practice believes great design comes from a spirit of curiosity, imagination and collaboration. We value diverse perspectives during the design process and take pride in delivering solutions that are specifically tailored to each client. We view each project as an opportunity to\n\ncreate something truly unique that connects us as a community.\n\nCheck out our cool projects: https://hntbarch.wixsite.com/join\n\nThis postion participates in all phases of project development including full technical support of the architecture as well as incorporation of all disciplines involved with the design. Serves as a resource to the project designer and project manager as the design is developed. The role includes serving as the lead technical architect on small to medium sized projects and assisting the Sr. Project Architect on large projects.\n\nPrimary Focus Will Include:\n\nCoordinates, and manages the project design and delivery process\nCollaborates with other lead professionals to ensure design and documentation are in accordance with project expectations\nLeads an architectural project delivery team\nManages drawing development, including detailing, quality control, and overseeing drawing support staff\nProduces construction documents\nEvaluates AHJ code compliance\nFacilitates project scheduling and staﬃng\nAttends coordination and construction meetings and prepares ﬁeld reports\nConstruction Administration Experience: Site observation, answers RFI's, and prepares change bulletins\nDirects issue resolution and enhances project quality in reporting to internal and external stakeholders\nContributes to business development by establishing conﬁdence with clients\n\nPreferred Qualifications and Skills:\n\nBachelor's degree in Architecture at an accredited university\n9+ years of architecture experience\nProfessional registration\nAbility to prioritize and concurrently service multiple projects\nStrong verbal and written communication skills\nEffective problem solving and interpersonal skills and the ability to interface with all clients and employees\nInteracts well with other disciplines and clients in a manner that builds productive relationships\nProﬁcient with Revit\nDesire to grow team professionals through education and mentoring\nAbility to balance the needs of projects with corporate goals\nIND\n\nWhat You'll Need\n\nEssential Responsibilities:\n\nDevelops and presents lead technical viewpoint on projects and ensures HNTB systems are used to deliver the design in a standardized manner.\nEnsures that a technical solution consistent with the program and design is properly developed and produced. Integrates quality control measures during all phases of design.\nServes as a subject matter expert on architectural projects of small to medium size and assists on larger projects.\nWorks closely with the project designer and manager in planning and implementing all work processes in consideration of budgets and schedules. Work includes preparing work plans, estimating hours to complete tasks, developing project reports, managing consultant team members (including coordination and incorporation of all work products) and reviewing invoices.\nPerforms other duties as assigned.\n\nMinimum Qualifications:\n\nBachelor's degree in Architecture\n5 years related experience\nRevit skills\n\nAdditional Information\n\nClick here for benefits information: HNTB Total Rewards\n\nClick here to learn more about EOE including disability and vet\n\nVisa sponsorship is not available for this position.\n\n\\#KJ #Architecture\n\n.\n\nPay Range for New York, NY: $93,500.90 - $146,244.99\n\nActual Compensation will be dependent upon the individual's qualifications, skills and experience as well as physical work location within the state.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nNOTICE TO THIRD-PARTY AGENCIES:\n\nHNTB does not accept unsolicited resumes from recruiters or agencies. Any staffing/employment agency, person or entity that submits an unsolicited resume to this site does so with the understanding that the applicant's resume will become the property of HNTB. HNTB will have the right to hire that applicant at its discretion and without any fee owed to the submitting staffing/employment agency, person or entity. Staffing/employment agencies who have fee agreements with HNTB must submit applicants to the designated HNTB recruiter to be eligible for placement fees.\n\nJob Type: Regular\n\nFull/Part Time: Full time\n\nJob Category: Architecture Group\n\nReqID: R-11981\n\nHiring Insights\nJob activity\nPosted 28 days ago"},{"job_title":"Architect Project Coordinator","company_name":"Novus Architects Inc","company_location":"Jacksonville, FL","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nContinuing education credits\nIndeed's salary guide\nNot provided by employer\n$58.8K - $74.5K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nDescription:\n\nAbout Novus Architects\n\nNovus Architects is a full-service architecture firm with offices in Charleston, SC, Atlanta, GA, Asheville, NC, Charlotte, NC, Jacksonville, FL, and Springline Architects, St. Thomas, US Virgin Islands. We are committed to quality in both our work and relationships, and have an innovative approach to solution-based design and project management that sets us apart as a firm.\n\nThe Novus portfolio is a reflection of our experience in many building sectors including Healthcare, K-12 Education, Higher Education, Financial, Municipal, Hospitality, Multi-Family, Recreation, Commercial, Worship, Residential and Industrial. With a staff equipped with a diverse skillset in Architecture, Interior Design, Project Management, FFE Coordination, Building Information Modeling (BIM), Environmental Graphics, and Construction Administration, we have positioned ourselves as an established design firm with national reach.\n\nTeam Novus\n\nAs a set of individuals with diverse talents, we come together to form a team that challenges itself creatively every day. Through thoughtful collaboration, respect, and mentorship we continue to build an engaging work environment and a company culture reflective of our values. We want you to bring your ideas and passion to the table and always encourage innovation that leads to creative solutions.\n\nIt is important to us as a firm to foster our team members’ growth through leadership training, professional certifications, continuing education, conference participation, and personalized mentorship to help along the way. Our staff celebrates seeing this growth within themselves, their peers, and the firm as a whole. This collaboration and encouragement of growth is a defining aspect of the understanding we have that our greatest asset is our employees.\n\nWe are seeking a tech-savvy individual who wants to begin a career in architecture. The ideal candidate will be capable of working towards licensing within a few years and will be motivated to work effectively as a member of a team.\n\nThe Successful Candidate will:\n\nBe fully knowledgeable in all conventional aspects of architecture. Performing basic level architectural assignments to independently performing a variety of assignments requiring skills in all conventional aspects of architectural designs for projects of moderate size and complexity.\n\nDuties/Responsibilities:\n\nPerforms design layouts and features, analyses of design, planning and occupancy studies, and limited design layouts.\nResponsible for producing Permit Drawing sets (Schematic Design thru Construction Documentation) using Revit.\nResponsible for researching, compiling, and recording information for assigned project work.\nPrepares project specifications, compiling and analyzing relevant data.\nReviews completed reports, plans estimate, and calculations.\nEnsuring project deadlines are met.\nUndertaking project tasks as required.\nResponsible for communicating and coordinating projects with consultants.\nRequirements:\nExceptional verbal, written and presentation skills.\nAbility to work effectively both independently and as part as a team.\nAbility to work on tight deadlines.\nExcellent organizational skills and attention to detail.\nExcellent time management skills with a proven ability to meet deadlines.\nStrong analytical and problem-solving skills.\nAbility to function well in a high-paced and at times stressful environment.\nProficient with Microsoft Office Suite, Revit, AutoCAD and other software.\n\nEducation and Experience:\n\n1 to 5 years of experience in Architecture.\nProfessional degree in Architecture.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager","company_name":"Group 4 Design","company_location":"Jacksonville, FL 32207 \n(Spring Park area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$69.7K - $88.3K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nWe're seeking candidates for a Project Manager\n\nPROJECT MANAGER JOB DESCRIPTION\n\nPlaces that Rock! Group 4 Design was recently named one of the best places to work in Jacksonville. We are a multi-discipline design firm with an emphasis on amenity, assisted living and multi-family architecture. We strive to bring new ideas and philosophies to these established markets with creative and innovative solutions. We pride ourselves on having energetic and passionate project architects and designers and are looking to add new team members.\n\nWe are now looking to add a motivated unlicensed/licensed architect or experienced project manager to join our creative and social work environment. Experience of 5-10+ years is required with a solid understanding of project and client management, consultant coordination, constructibility of wood, steel, masonry detailing, and team leadership. All candidates must have the knowledge of AutoCAD and Revit, the ability to establish and maintain schedules and self-perform project construction administration/site observations.\n\nREADY TO APPLY? HERE'S HOW:\n\nEmail your resume to kkovacocy@g4designinc.com.\n\nHave questions about the position? Call our office at 904-353-5900.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architecture Project Manager","company_name":"WGI","company_location":"Jacksonville, FL","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$69.7K - $88.3K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nWe're seeking candidates for a Project Manager\n\nPROJECT MANAGER JOB DESCRIPTION\n\nPlaces that Rock! Group 4 Design was recently named one of the best places to work in Jacksonville. We are a multi-discipline design firm with an emphasis on amenity, assisted living and multi-family architecture. We strive to bring new ideas and philosophies to these established markets with creative and innovative solutions. We pride ourselves on having energetic and passionate project architects and designers and are looking to add new team members.\n\nWe are now looking to add a motivated unlicensed/licensed architect or experienced project manager to join our creative and social work environment. Experience of 5-10+ years is required with a solid understanding of project and client management, consultant coordination, constructibility of wood, steel, masonry detailing, and team leadership. All candidates must have the knowledge of AutoCAD and Revit, the ability to establish and maintain schedules and self-perform project construction administration/site observations.\n\nREADY TO APPLY? HERE'S HOW:\n\nEmail your resume to kkovacocy@g4designinc.com.\n\nHave questions about the position? Call our office at 904-353-5900.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager/Project Architect","company_name":"Prime AE Group Inc","company_location":"Jacksonville, FL 32224 \n(Beach Haven area)","salary_range":null,"days_ago_posted":"Posted\nPosted 17 days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$75.6K - $95.7K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\n\nProsser (www.prosser.com), a PRIME AE Group company, an integrated planning and engineering firm supporting clients in several diverse markets including the Department of Defense, Transportation, Healthcare, Higher Education, Commercial, Retail, and Residential, is seeking a Senior Architect | Project Manager for our Jacksonville, FL.\n\n\nIn joining with PRIME AE Group, Inc. (www.primeeng.com), Prosser has become part of a multi-faceted and rapidly growing architectural and engineering firm with 19 office locations and over 475+ employees throughout the Midwest, Mid-Atlantic, and Southeast and Northeast areas.\n\n\nOur Architecture Group focuses on projects in the fields of:\n\nLarge Commercial / Public Sector\nFederal | Department of Defense | Military\nCommunity | Municipal projects (civic centers, libraries, government buildings, recreation)\nEducation (higher education and K-12)\nIndustrial\nJustice\nResidential\nWorkplace\nHospitality\nHealthcare\nHistoric Restoration\nChurches\n\n\nPRIMARY JOB RESPONSIBILITIES\n\nDevelops design and construction documents, facilitates charrettes, develops studies and reports, field assessments, and specification development.\nCollaboration with PRIME AE’s inter-office divisions – MEP, Structural Engineering, Civil/Landscape – as well as external subconsultants.\nPlans and supervises the preparation of construction documents and other deliverables for projects according to client goals, needs, and budgets.\nResponsible for coordination of design disciplines, both in-house and outside consultants.\nConducts periodic on-site observation of work during construction to monitor compliance with Detailed Design Documents.\nMay prepare client project presentations, studies, and reports.\nUtilizes computer-assisted design software and equipment to prepare project designs and plans – specifically Revit.\nMay direct activities of workers engaged in preparing drawings and specification documents for the Conceptual Design Phase, Schematic Design Phase, and/or the Detailed Design Phase of a project.\n\n\nTRAINING AND EXPERIENCE\n\nProfessional Architecture Degree from an accredited school\nRegistered Architect preferred.\nLEED Accredited Professional preferred\n5 years' experience as a Project Manager preferred.\nExperienced in all phases of project design, construction documentation and construction materials.\nStrong interpersonal skills, verbal, listening and written communication, including client presentations.\nExperience with coordination of multiple design disciplines required for developing complete documents.\nProficient in Revit and experience with AutoCAD.\nStrong knowledge base of building codes, standards, building structures, and engineering systems.\nExcellent analytic and problem-solving skills.\n\n\nPRIME AE Group is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nHiring Insights\nJob activity\nPosted 17 days ago"},{"job_title":"Sr. Architect / Project Manager","company_name":"Pond & Company","company_location":"Jacksonville, FL","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$75.6K - $95.7K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\n\nProsser (www.prosser.com), a PRIME AE Group company, an integrated planning and engineering firm supporting clients in several diverse markets including the Department of Defense, Transportation, Healthcare, Higher Education, Commercial, Retail, and Residential, is seeking a Senior Architect | Project Manager for our Jacksonville, FL.\n\n\nIn joining with PRIME AE Group, Inc. (www.primeeng.com), Prosser has become part of a multi-faceted and rapidly growing architectural and engineering firm with 19 office locations and over 475+ employees throughout the Midwest, Mid-Atlantic, and Southeast and Northeast areas.\n\n\nOur Architecture Group focuses on projects in the fields of:\n\nLarge Commercial / Public Sector\nFederal | Department of Defense | Military\nCommunity | Municipal projects (civic centers, libraries, government buildings, recreation)\nEducation (higher education and K-12)\nIndustrial\nJustice\nResidential\nWorkplace\nHospitality\nHealthcare\nHistoric Restoration\nChurches\n\n\nPRIMARY JOB RESPONSIBILITIES\n\nDevelops design and construction documents, facilitates charrettes, develops studies and reports, field assessments, and specification development.\nCollaboration with PRIME AE’s inter-office divisions – MEP, Structural Engineering, Civil/Landscape – as well as external subconsultants.\nPlans and supervises the preparation of construction documents and other deliverables for projects according to client goals, needs, and budgets.\nResponsible for coordination of design disciplines, both in-house and outside consultants.\nConducts periodic on-site observation of work during construction to monitor compliance with Detailed Design Documents.\nMay prepare client project presentations, studies, and reports.\nUtilizes computer-assisted design software and equipment to prepare project designs and plans – specifically Revit.\nMay direct activities of workers engaged in preparing drawings and specification documents for the Conceptual Design Phase, Schematic Design Phase, and/or the Detailed Design Phase of a project.\n\n\nTRAINING AND EXPERIENCE\n\nProfessional Architecture Degree from an accredited school\nRegistered Architect preferred.\nLEED Accredited Professional preferred\n5 years' experience as a Project Manager preferred.\nExperienced in all phases of project design, construction documentation and construction materials.\nStrong interpersonal skills, verbal, listening and written communication, including client presentations.\nExperience with coordination of multiple design disciplines required for developing complete documents.\nProficient in Revit and experience with AutoCAD.\nStrong knowledge base of building codes, standards, building structures, and engineering systems.\nExcellent analytic and problem-solving skills.\n\n\nPRIME AE Group is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nHiring Insights\nJob activity\nPosted 17 days ago"},{"job_title":"Building Envelope Project Manager - Architect or Engineer","company_name":"Prime AE Group Inc","company_location":"Jacksonville, FL 32224 \n(Beach Haven area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$82.4K - $104K a year is Indeed's estimated salary for this role in Jacksonville, FL.\nReport inaccurate salary\nFull Job Description\n\nPRIME AE Group, Inc. (www.primeeng.com), a multi-faceted and rapidly growing architectural and engineering firm with 19 office locations and over 475+ employees throughout the Midwest, Mid-Atlantic, and Southeast and Northeast areas, is seeking a Team Leader and Project Manager for our Building Envelope Team. Preferably this role will be housed in one of our Florida offices (Pensacola or Jacksonville); however, it can also be housed in our Baltimore, Columbus or Akron offices as well.\n\nThis licensed Architect or Structural Engineer will have overall project management responsibility for both routine and complex projects. The Project Manager (Architect or Engineer) is the primary point of contact for the client and is responsible for scheduling, budgeting, and design of the project. The Project Manager supervises and coordinates the activities of all internal and external team members. The Project Manager works collaboratively with business development, marketing, and administration to achieve the goals of the firm.\n\n\nPrimary Responsibilities\n\nCoordinate and supervise the project team:\n\nCommunicate task assignments and expectations to each team member.\nMonitor team members' efficiency and respond to changes in team staffing requirements.\nDirect and coordinate consultants.\nMentor and provide guidance to less experienced staff.\nProvide performance review input to the office director for project team members.\n\n\nWork to achieve client’s and firm's goals within the constraints of the budget and schedule:\n\nEstablish and adhere to project budget, schedule, and milestones.\nConduct meetings and communicate regularly with clients to provide design guidance and report on project progress.\nResearch building materials and systems and review selections with the project team.\nImplement code review and incorporate code requirements.\nEstablish appropriate level of detailing based on project parameters.\nPrepare, review, and coordinate drawings, specifications, and other project deliverables.\nWork closely with the project team to obtain project information and see that drawings are accurate and complete.\nAssist clients in review of construction budget and construction contract.\nReview shop drawings, submittals, RFIs, and change orders.\nPerform or assign staff to perform site visits and conduct project meetings during construction.\nDocument meetings, correspondence, and other key project information.\n\n\nWork collaboratively with other departments for the benefit of the firm:\n\nInform office director or supervisor of opportunities or pitfalls that may affect project budgets, schedules, or profitability.\nWork with business development and marketing to prepare fee estimates and establish the scope of services for proposals.\nReport project progress for invoicing.\nWork with the accounting department to assist in collection of outstanding invoices.\nFile and organize documents in conformance with company standards.\n\n\nOther Duties and Expectations\n\nActively seek experience and continuing education to fulfill requirements for licensure.\nParticipate in marketing and project-related activities and presentations.\nParticipate and seek leadership roles in professional/community organizations and activities.\nWrite and publish white papers and articles on technical topics.\nAttend and speak at conferences and participate in other networking and professional development opportunities.\nDemonstrate organizational skills.\nBe self-motivated regarding office projects and the office environment.\n\n\nRequired Education and Experience\n\nA Registered Architect or Engineer (PE) is strongly preferred.\nFirst professional degree from an accredited architectural or engineering program AND\n6+ years' of architectural or engineering experience AND\n2+ years' of building envelope, consultation experience OR\nEquivalent combination of academic and professional experience.\nDesire to be trained and pass certifications to become a Registered Roof Consultant (RRC) or Registered Exterior Wall Consultant (REWC), or someone seeking or currently in possession of these certifications.\n\n\nRequired Qualifications\n\nProject Manager: architectural graduates should be enrolled in the IDP (Intern Development Program); engineering graduates should have passed the FE (Fundamentals in Engineering) exam.\nProject Architect/Engineer: license to practice architecture or engineering.\nExcellent communication and writing skills.\nProficiency in computer software applications (AutoCAD, Word, Excel, Outlook, PowerPoint, Project).\nWillingness to work on roofs and facades utilizing contractor's staging, scaffolding, and aerial lifts.\n\n\nDemonstrated ability to:\n\nSkillfully perform all project management responsibilities.\nManage multiple tasks simultaneously and meet strict deadlines.\nWork independently with a minimum level of supervision.\n\n\nPRIME AE Group is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"}]