[{"job_title":"Architect Project Manager and Assistant Project Manager","company_name":"Express Employment Professionals","company_location":"Austin, TX 78735 \n(East Oak Hill area)","salary_range":"$70,000 - $110,000 a year","days_ago_posted":"Posted\nPosted 12 days ago","job_description":"Job details\nSalary\n$70,000 - $110,000 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nHealth insurance\nPaid time off\nFull Job Description\n\nOur client in is a fast growing architect firm seeking to add a Project Manager and Assistant Project Manager to join their growing team in either Austin or Houston. This client specializes in municipal / educational buildings and they have projects throughout Texas. These are full time, direct hire positions with competitive pay, excellent benefits, a great work environment and lots of room to grow. More details about the positions are below. If you are interested and meet the qualifications, please reply back to this post with a copy of your resume.\n\nJOB DESCRIPTION:\n\nManage architectural projects from ~$10 - 50M from conception, through design, construction and final walk through; usually managing multiple projects simultaneously\nEstablish and follow project budget and schedules\nSet up and attend meetings with internal and external stakeholders\nManage paperwork and documentation\nGenerate submittals, permit documents, work status summaries, etc.\nCommunicate project status to various audiences as needed\nHours are Monday – Friday ~8 am – 5 pm with some flexibility; mostly office based but with occasional site visits required\n\nJOB REQUIREMENTS:\n\nBachelors or Master’s degree in Architecture; Minimum 2-10+ years experience working in an architecture firm\nArchitect license is required for Project Manager position; for the Assistant PM position, candidates that are planning to get their license are strongly preferred\nMust have proficiency in AutoCAD and/or Revit, Sketch Up, and Microsoft Office; project management software proficiency is strongly preferred\nWilling to make occasional day trips within ~100 miles of the office\nThe selected candidate will be ambitious, hard-working and able to hit the ground running without a significant ramp time\n\nJob Type: Full-time\n\nPay: $70,000.00 - $110,000.00 per year\n\nBenefits:\n\nHealth insurance\nPaid time off\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nWork Location: One location\n\nHiring Insights\n\nHiring 2 candidates for this role\n\nJob activity\nPosted 12 days ago"},{"job_title":"Architect","company_name":"Tesla","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 10 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$90.7K - $115K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nWhat to Expect\nTesla is seeking a mid-level architect to join our Factory Architecture Team. We are looking for thoughtful individuals with excellent communication, design skills, and technical expertise.The Factory Architects roles are to help design, coordinate, and execute some of the most technically complicated factory spaces in the world. The ideal candidate will have between 5-15 years of professional experience.\n\n\nWhat You’ll Do\nPerform architectural assignments with general direction, no immediate supervision, and work independently as well as collaboratively with others toward design and technical solutions.\nAssist in developing solutions for projects in all phases\nProvide production of design drawings, presentation drawings, and digital models in support of design teams.\nResearch products and materials, review existing projects, and those under construction to inform the production of design documentation\nContribute to the effective performance of the project ream regarding quality, schedule, and budget\nAssist in the execution of construction administration responsibilities\nAssist in the review and execution of design documents that meet building code and accessibility code\nWhat You’ll Bring\nHighly motivated and proactive\nWell-organized and detailed oriented\nExcellent team communication skills\nExperience in detailing and execution of construction documents with minimal supervision\nExperience with complex multi-phased projects\nExperience with complex MEPFP coordination and BIM coordination\nProficient in Revit, Enscape, Adobe Suite, and Microsoft Office\nProfessional architectural degree and a minimum of 5 to 15 years of experience\nLicensed Architects are strongly preferred\nHiring Insights\nJob activity\nPosted 10 days ago"},{"job_title":"Project Architect","company_name":"Jacobs","company_location":"Austin, TX 73344","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$77.4K - $98K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\nAt Jacobs, we’re transforming intangible ideas into innovative solutions designing the future – today.\n\nWe’re seeking a Project Architect to join our team in Central Texas. Someone who can build their experience in the industry and apply it to today’s challenges.\n\nYou’ll research, program, plan, design, and detail, building projects for clients, applying knowledge of architectural design, zoning and building codes, building systems and materials for our clients.\n\nWorking together, we’ll help you grow and pursue what fulfills you so that we can make impacts on the future – big and small, global and local. Your role will include participating in large teams and leading smaller teams of architecture staff on projects to produce project documentation, performing and/or assisting in the construction administration phase of projects, maintaining firm-wide documentation procedures and standards, working closely with technical leadership and engineering discipline leads to understand design intent and goals for successful implementation for various facility design projects.\n\nYour most impactful mission in this role is to embrace living inclusion every day and enabling diversity and equality globally. For us, this means creating a culture of belonging where we all thrive by embracing all perspectives. An inclusive culture with many perspectives through diverse backgrounds allows us to leverage knowledge, leadership and connection to bring forth opportunity, creativity and growth.\n\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other. Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow, and succeed.\n\n#bia\n\nHere’s What You’ll Need:\n\nBachelor’s Degree in Architecture from an accredited program\nProfessional Registered Architect (RA)\nDemonstrated professional relevant experience for buildings related design projects\nStrong organizational skills to help facilitate multiple tasks at one time, communication (both verbal and written) skills, creative problem-solving abilities, client relationship building skills, and desire to develop leadership abilities\nEffectively communicate and collaborate with design team and consultants\nAbility to support project manager in forecasting project schedules, hours and budget.\nDemonstrated program experience in the usage of Revit, SketchUp, basic rendering and publishing program\nFamiliarity with building code requirements\n\nIdeally, You'll Also Have:\n\nMaster’s in Architecture\nRenovation and new construction experience\nExperience in large scale semi-conductor facilities, electronics vehicle manufacturing facilities, higher education,\nand government work\nExperience on fast-track, accelerated project delivery\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Junior Designer","company_name":"IA Interior Architects","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$48.1K - $61K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nIA Interior Architects translates client goals, brand and culture into powerful environments built around people, processes, technologies and business drivers. Our clients in diverse markets worldwide require high-performance, visually compelling and sustainable environments to move their enterprise forward, support their culture, engage their staff, integrate technology and drive efficiencies. As architects, designers, workplace strategists and environmental specialists in the largest global architecture firm concentrating exclusively on interiors, we help clients articulate and align their business strategies and core values with the dynamic use of space.\n\nOur team members are collaborative, creative, professional, expert and entrepreneurial. Joining our team requires skill, daring, leadership, teaming, humor and a love of interiors. We are presently searching for a Junior Designer for our Austin studio. The Junior Designer, while working under the direct supervision of a more senior Designer or Project Manager, performs a broad variety of drafting and/or design tasks.\n\nSpecific responsibilities will include:\n\nUnder supervision, may make updates and changes to existing drawings or designs\nWork with design team to develop design ideas\nMay assist senior designers in selecting fixtures and finishes\nUnder supervision, develops preliminary space plans\nAssist and learn detailing\nAssist and learn the production of furniture & finish packages, along with cost estimating\nAssists senior staff with verification of site details to support design\nAssists in field surveying of client spaces\nCorrects drawings red lined by others\nSupports the team in collecting information for client assessment; may attend interviews, provide documentation support; developing skills working with Affinity program tool\nQualifications:\n\nGraduate of architecture or design school: equivalent experience may be substituted\n1+ year experience or equivalent educational experience: strongly prefer experience working in corporate interior design projects\nKnowledge, Skills, and Abilities:\n\nWorking knowledge of the application of color, materials and aesthetic form\nFamiliarity with space planning methodology\nFamiliarity with furnishings and equipment\nBasic sketching and rendering skills\nBasic interior architecture detailing skills\nWorking knowledge of CDs and procedures\nCommitment to support projects through peaks and valleys\nIntermediate MS Office Suite skills\nIntermediate Revit skills\nBasic Adobe Creative Suite skills\nBasic verbal and written communication skills\n\nPlease submit a portfolio or work examples with your application\n\nWorking Conditions:\nFor the majority of the time the Junior Designer will be sitting in a studio with limited physical requirements. This may require individuals to bend, stretch, twist and reach. On occasion individuals will be required to visit a client site to perform site verifications and field surveys. The position is not subject to occupational and safety risks.\n\n\n\n\nIA Interior Architects is an Equal Opportunity Employer M/F/Disability/Veteran\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Designer","company_name":"Hollon+Cannon Group, LLC","company_location":"Austin, TX","salary_range":"$55,000 - $65,000 a year","days_ago_posted":"Employer\nActive 4 days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$48.1K - $61K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nIA Interior Architects translates client goals, brand and culture into powerful environments built around people, processes, technologies and business drivers. Our clients in diverse markets worldwide require high-performance, visually compelling and sustainable environments to move their enterprise forward, support their culture, engage their staff, integrate technology and drive efficiencies. As architects, designers, workplace strategists and environmental specialists in the largest global architecture firm concentrating exclusively on interiors, we help clients articulate and align their business strategies and core values with the dynamic use of space.\n\nOur team members are collaborative, creative, professional, expert and entrepreneurial. Joining our team requires skill, daring, leadership, teaming, humor and a love of interiors. We are presently searching for a Junior Designer for our Austin studio. The Junior Designer, while working under the direct supervision of a more senior Designer or Project Manager, performs a broad variety of drafting and/or design tasks.\n\nSpecific responsibilities will include:\n\nUnder supervision, may make updates and changes to existing drawings or designs\nWork with design team to develop design ideas\nMay assist senior designers in selecting fixtures and finishes\nUnder supervision, develops preliminary space plans\nAssist and learn detailing\nAssist and learn the production of furniture & finish packages, along with cost estimating\nAssists senior staff with verification of site details to support design\nAssists in field surveying of client spaces\nCorrects drawings red lined by others\nSupports the team in collecting information for client assessment; may attend interviews, provide documentation support; developing skills working with Affinity program tool\nQualifications:\n\nGraduate of architecture or design school: equivalent experience may be substituted\n1+ year experience or equivalent educational experience: strongly prefer experience working in corporate interior design projects\nKnowledge, Skills, and Abilities:\n\nWorking knowledge of the application of color, materials and aesthetic form\nFamiliarity with space planning methodology\nFamiliarity with furnishings and equipment\nBasic sketching and rendering skills\nBasic interior architecture detailing skills\nWorking knowledge of CDs and procedures\nCommitment to support projects through peaks and valleys\nIntermediate MS Office Suite skills\nIntermediate Revit skills\nBasic Adobe Creative Suite skills\nBasic verbal and written communication skills\n\nPlease submit a portfolio or work examples with your application\n\nWorking Conditions:\nFor the majority of the time the Junior Designer will be sitting in a studio with limited physical requirements. This may require individuals to bend, stretch, twist and reach. On occasion individuals will be required to visit a client site to perform site verifications and field surveys. The position is not subject to occupational and safety risks.\n\n\n\n\nIA Interior Architects is an Equal Opportunity Employer M/F/Disability/Veteran\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect II","company_name":"Health & Human Services Comm","company_location":"Austin, TX 78751 \n(Hyde Park area)","salary_range":"$5,833 - $7,533 a month","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$5,833 - $7,533 a month\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nHealth insurance\nFull Job Description\n\nIf you are looking for a place to work where you can take your architectural skills to the next level and be part of collaborative team that makes a difference, this is the job for you!\n\nState Office Life Safety Code Architect II\n\nAs part of a collaborative team of public servants, a state office LSC Architect II protects our most venerable by determining compliance with state and federal life safety code requirements. This position offers a competitive starting salary; excellent state benefits, including health insurance and retirement. The Life Safety Code (LSC) Architect (Architect II) reviews plans for new construction of long term care facilities and remodeling/renovating existing licensed facilities, including: Nursing Facilities; Assisted Living Facilities; Intermediate Care Facilities Serving Persons with Intellectual Disabilities (ICF/ID); Day Activity Health Services (DAHS) facilities, and Prescribed Pediatric Extended Care Centers (PPECC), to determine compliance with NFPA 101 (Life Safety Code) and with Texas Licensing Standards. The LSC Architect conducts initial surveys and final construction inspections to recommend these facilities for state licensure and federal certification for participation in Medicare and Medicaid. Identifies and writes deficiencies in accordance with program requirements. The LSC Architect communicates with providers, contractors, stakeholders, HHSC's staff, architects and engineers regarding licensing standards, current codes, and regulations.\n\n\n\n\n\n\nEssential Job Functions:\nReviews architectural and construction plans for facilities based on current federal and state codes, laws, and rules. Communicates with architects and engineers preparing architectural and construction plans to provide information and advice on applicable rules. Provides complex technical assistance to others (for example, staff, volunteers, contractors, other organizations) on policies, procedures, rules, regulations, standards, or requirements. Inspects final construction projects. Completes inspection/survey reports listing deficiencies and prepares written reports supporting the actions and recommendations. Conducts exit conferences with facility staff regarding findings and may assist in developing and/or directing a plan of correction. Tracks, monitors, plans, coordinates, or schedules activities on a complex level to ensure deadlines or requirements are met. May serve as lead surveyor over LSC staff. Interacts with staff or customers to discuss or develop action plans, schedules, or problem resolutions and reports to management on status and issues. Maintains a regular and predictable work schedule.\n\n\n\nKnowledge Skills Abilities:\nAbility to learn, remember and integrate complex concepts, difficult procedures or complicated processes involving healthcare Life Safety Code regulations and state and federal licensing and certification standards. Ability to routinely climb ladders and inspect attics. Ability to communicate verbally and in writing with applicants, providers, design consultants concerning physical requirements of facilities.\n\n\nRegistration or Licensure Requirements:\nRegistered as an architect by the Texas State Board of Architectural Examiners. LSC CMS Surveyor Qualification preferred or must successfully obtain within the first year of employment.\n\n\n\nInitial Selection Criteria:\nEducational and professional registration and experience that indicates a mastery of architectural knowledge, skills, and abilities to perform the job functions. Professional experience in design, review, inspection or building long term care or health care facilities or closely related experience in applying local, state, or federal laws relating to the Life Safety Code, safety from fire, or other building codes.\n\n\n\nAdditional Information:\nThis position’s headquarters can be located in any available HHSC LTCR office in the state of Texas.\n\nFlexibility in work hours required for this position. Must be willing to work hours other than 8-5, M-F. Must be able to travel as needed to the full regional service area for job responsibilities. Must have reliable transportation. Note: This position is able to work a compressed workweek with options Monday-Thursday, Tuesday-Friday, and Friday-Monday, 10-hour days.\n\nIn compliance with the Americans with Disabilities Act (ADA), HHS agencies will provide reasonable accommodation during the hiring and selection process for qualified individuals with a disability. If you need assistance completing the on-line application, contact the HHS Employee Service Center at 1-888-894-4747. If you are contacted for an interview and need accommodation to participate in the interview process, please notify the person scheduling the interview. Applicant must pass fingerprint background check.\n\n\n\n\nMOS Code:\nMilitary occupation(s) that relate to the initial selection criteria and registration or licensure requirements for this position may include: 51S, 32EX, 510X, 653X. For more information see the Texas State Auditor’s Military Crosswalk at http://www.hr.sao.state.tx.us/Compensation/JobDescriptions.aspx.\n\nTop 10 Tips for Success when Applying to Jobs at HHSC and DSHS\n\n\n\n\nTop 10 Tips for Success when Applying to Jobs at HHSC and DSHS\n\n\n\n\n\n\nHHS agencies use E-Verify. You must bring your I-9 documentation with you on your first day of work.\n\n\n\n\nIn compliance with the Americans with Disabilities Act (ADA), HHS agencies will provide reasonable accommodation during the hiring and selection process for qualified individuals with a disability. If you need assistance completing the on-line application, contact the HHS Employee Service Center at 1-888-894-4747. If you are contacted for an interview and need accommodation to participate in the interview process, please notify the person scheduling the interview.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Sr. Architect Job","company_name":"2H Talent LLC","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":"$90,000 - $160,000 a year","days_ago_posted":"Posted\nPosted 11 days ago","job_description":"Job details\nSalary\n$90,000 - $160,000 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nFull Job Description\n\nWe're Hiring\n\nWe are seeking a detail oriented, self-starter, who takes initiative, prioritize, and multi-task in busy environment Sr. Architect with commercial, retail and/or multifamily project experience.\n\nWhat's in it for you:\n\nCompetitive salary DOE\nHealth, Vision & Dental Insurance\nPTO\nHolidays\n\nResponsibilities:\n\nStrong interpersonal skills and working relationship with colleagues\nAbility to independently prepare for client meetings w guidance\nAbility to manage client contact\nResearches, programs, plans, designs, and administers building projects for clients, applying knowledge of architectural design, construction detailing, construction procedures, zoning and building codes, and building materials and systems.\nProduces conceptual plans, renderings, and documents.\n\nRequirements:\n\nEight plus (8+) years architectural design experience.\nLicensure required\nBachelor’s or master’s degree in architecture\nRevit and AutoCAD preferred\nCompetency in various computer software programs such as Bluebeam\nCompetency with Excel, Word, and PowerPoint\nCompetency with 3D modeling programs, Rhino, Adobe Photoshop, Illustrator and InDesign a plus.\n\nNO C2C\n\nIf you are a Sr Architect with the experience above, apply now!\n\n\"At 2H Talent diversity is simple—it’s about embracing everyone. We are committed to a diverse and inclusive workplace. We provide equal employment opportunities to all qualified employees and applicants for employment without regard to race, religion, sex, age, marital status, national origin, sexual orientation, citizenship status, veteran status, disability, or any other legally protected status. We prohibit discrimination in decisions concerning recruitment, hiring, compensation, benefits, training, termination, promotions, or any other condition of employment or career development.\"\n\nJob Type: Full-time\n\nPay: $90,000.00 - $160,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 11 days ago"},{"job_title":"STAFF ARCHITECT","company_name":"NEURALINK","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\nCommuter assistance\nDental insurance\nHealth insurance\nParental leave\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$87K - $110K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nCompany info:\n\nNeuralink Corporation is a neurotechnology company that develops implantable brain–machine interfaces to connect humans to technology. Co-founded by Elon Musk, Max Hodak and Paul Merolla. Our mission is building devices that have the potential to help people with paralysis and inventing new technologies that could expand our abilities, our community, and our world.\n\nTeam info:\n\nThe position is a part of our facilities team.\n\nRequirements:\n\nPresent concepts, designs, and project schedules and budgets to company leadership\nLead architectural designs\nPrepare project budgets and schedules\nPrepare presentation quality building renders suitable for executive presentations\nPerform design, drafting and 3D modeling using AutoCAD and/or Revit for architectural elements of project designs for a variety of project types including office, laboratory, clean room, manufacturing, warehouse, data center, vivarium, health care, and animal care facilities\nCoordinate with in-house Neuralink MEP engineering staff to provide fully coordinated and code compliant designs suitable for permitting\nCoordinate with 3rd Party Structural and Civil Engineers to provide fully coordinated and code compliant designs suitable for permitting\nProvide code analysis and reviews\nEgress/life safety and ADA accessibility reviews\nOccupancy Classification\nReview processes and equipment proposed for spaces\nReview hazardous materials storage/usage requirements\nReview and propose occupancy types\nDetermine required fire separation\nLead permitting for Neuralink projects\nCompile Permit sets and submit to AHJ\nWork with local AHJs to move the permitting process forward\nLead permit review responses\nPartner with Construction Operations to\nCompile Issue For Construction sets\nReview submittals in a timely manner\nReview and respond to RFIs in a timely manner\nInterface with the Neuralink construction team for constructability reviews\nInterface with construction trades and perform regular field walks to review installation progress and adherence to designs\nLead production of accurate as-built record drawings\nPrepare RFPs for major architectural items for procurement and assist in procurement\n\nKey qualifications:\n\nDesigning & building facilities and infrastructure is key to enabling us to scale. We are looking for an experienced Architect to join our facilities construction team in Austin, TX. You will play a pivotal role in the design and planning of our facilities and infrastructure. This position requires an outgoing and highly organized mindset, an ability to perform at a high level on a consistent basis, a desire to work on multi-disciplinary projects, and an excitement to work at Neuralink!.\n\nPreferred qualifications:\n\nEvidence of exceptional ability\nRegistered Architect in Texas and California, or a current active registration in another jurisdiction with the ability to obtain a Texas and California registration by reciprocity within six months of the start of employment\nAdvanced knowledge of AutoCAD and REVIT\nWorking knowledge of Industry software for production of architectural designs and renders\nExperience is all phases of schematic design, design development, construction documents, and construction administration\nStrong desire to be a part of a world class team focused on achieving amazing results\nExperience designing office, laboratory, manufacturing, clean room, health care, vivarium, and other facilities and site infrastructure development\n\nWhat we offer:\n\nAn opportunity to change the world and work with some of the smartest and the most talented experts from unique fields\nGrowth potential. We rapidly advance team members who have an outsized impact\nExcellent medical, dental, and vision insurance through a PPO plan; parental leave\nFlexible time off + paid holidays\nEquity + 401(k) plan\nCommuter Benefits\nMeals provided\nMultiple studies have found that a higher percentage of women and BIPOC candidates won't apply if they don't meet every listed qualification. Neuralink values candidates of all backgrounds. If you find yourself excited by our mission but you don't check every box in the description, we encourage you to apply anyway!\n\nNeuralink provides equal opportunity in all of our employment practices to all qualified employees and applicants without regard to race, color, religion, gender, national origin, age, disability, marital status, military status, genetic information or any other category protected by federal, state and local laws. This policy applies to all aspects of the employment relationship, including recruitment, hiring, compensation, promotion, transfer, disciplinary action, layoff, return from layoff, training and social, and recreational programs. All such employment decisions will be made without unlawfully discriminating on any prohibited basis.\n\nWhat we offer:\n\nAn opportunity to change the world and work with some of the smartest and the most talented experts from different fields.\nGrowth potential. We rapidly advance team members who have an outsized impact.\nExcellent medical, dental, and vision insurance through a PPO plan; parental leave.\nFlexible time off + paid holidays.\nEquity + 401(k) plan.\nCommuter Benefits.\nMeals provided.\nMultiple studies have found that a higher percentage of women and BIPOC candidates won't apply if they don't meet every listed qualification. Neuralink values candidates of all backgrounds. If you find yourself excited by our mission but you don't check every box in the description, we encourage you to apply anyway!\n\nNeuralink provides equal opportunity in all of our employment practices to all qualified employees and applicants without regard to race, color, religion, gender, national origin, age, disability, marital status, military status, genetic information or any other category protected by federal, state and local laws. This policy applies to all aspects of the employment relationship, including recruitment, hiring, compensation, promotion, transfer, disciplinary action, layoff, return from layoff, training and social, and recreational programs. All such employment decisions will be made without unlawfully discriminating on any prohibited basis.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Lead Architect","company_name":"Memorial Recruiting on behalf of Home Builder","company_location":"Austin, TX","salary_range":"$100,000 - $200,000 a year","days_ago_posted":"Posted\nJust posted","job_description":"Job details\nSalary\n$100,000 - $200,000 a year\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nAutoCAD: 10 years (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nShow 2 more benefits\nFull Job Description\n\nWe are currently seeking a talented individual to join our team in the position of Lead Architect. This person could sit in our Houston area or Austin area office.\n\nThe ideal candidate will be a licensed architect with have 5+ years of experience and be proficient in AutoCAD Architecture 2016 or later. The Lead Architect will work on master and lot-specific plans for new home construction along with designing new floor plan concepts. Three key attributes the candidate must obtain are: attention to detail, speed and accuracy. Candidate must be familiar with current Texas Building Codes, structural requirements and have a strong working knowledge of wood frame construction. Knowledge of the associated costs of such would be an extra bonus!\n\nWe offer an excellent compensation and benefits package, including comprehensive medical/dental/vision/prescription, 401(k), professional development, and much more!\n\nAs a member of the Architectural team, this position works on single family architecture projects across market segments and with varying degrees of complexity – producing the project deliverables to represent company's & Developer’s objectives in order to set ourselves apart in the marketplace.\n\nRequired Knowledge, Skills and Abilities:\n\nCreative ability to come up with new plan concepts from a list of needs within certain requirements\nExcellent organizational, multi-tasking, follow-up and time management skills.\nSelf-starter with the ability to work independently and as team\nAbility to prioritize and multitask with great attention to detail- proactive and deadline oriented.\n10 year minimum AutoCAD experience,\nUnderstanding and ability to write/update lisp routines and other programing knowledge is preferred\nUnderstand building systems and ability to co-ordinate drawings\nFirm understanding of residential construction including code and production building\nKeeping Standard House Plans & Construction Details Up to Date\nDrafting Custom Home Plans & Drawing Site Plans\nWorking with Mechanical & Truss Company to Assure Home Built Correctly\n\nEmployee Benefits\n\nCompetitive pay: based on experience\nHealth Care: no cost medical and affordable dental/vision\nFinancial Security: 401K plan, Health Savings Account, & Flexible Spending Accounts\nTime Off: 2 weeks of paid holidays, 2 weeks of paid vacation, 1 week of paid personal/medical leave per year\n\nEducation & Experience Requirements:\n5+ Years Experience Drafting House Plans\n10+ Years AutoCAD Architecture\n2+ Years in REVIT Preferred\n4 Year Degree Required\n\nJob Type: Full-time\n\nPay: $100,000.00 - $200,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nAustin, TX: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nAutoCAD: 10 years (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nApplication response rate: 70%\n\nHiring 1 candidate for this role\n\nJob activity\nPosted today"},{"job_title":"Architect, Healthcare","company_name":"BSA LifeStructures","company_location":"Austin, TX 78746","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$73K - $92.5K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nJob Details\n\nDescription\n\nBSA Lifestructures is searching for a Registered Architect who is passionate about and has significant experience working in healthcare design. This role will lead and/or oversee the preparation of design ideas, architectural documentation, and the executable delivery of projects.\n\nDuties and Responsibilities\n\nArchitectural design and planning process on projects. Assist in client engagement through all processes and tools.\nWork with Project Manager or Senior Project Manager to develop and maintain a successful, executable workplan throughout the life of the project.\nDevelop and present design ideas, planning concepts, architectural development and detailing to clients during development of design.\nResponsible for final detailing, materials selections & specifications and overall guidance on architectural objectives and concepts.\nResponsible for primary oversight on all construction administration activities.\nComplete and accurate coordinate across all Disciplines, Design & Execution components\nSupport, oversee, and evaluate work of architectural team and BIM technicians.\nCoordination of design document preparation across all disciplines.\nMentor other team members\nMentoring and/or sharing architectural knowledge with others in the firm across all aspects of the design, documentation, and delivery of projects.\nMinimize rework\nRecommend timely alterations to design to improve quality and maintain clients goals and objectives.\nSuggest process improvements to the department as a whole.\n\nSecondary Duties and Responsibilities\n\nPromote company’s reputation through good client relations.\nContinue education through seminars and participation in professional organizations.\nMay be required to perform other duties as assigned.\n\nCritical Skills and Abilities\n\nDesign: Generates creative solutions; translates concepts and information into images; collaborate with others to modify design; applies design principles\nEffective communication skills: Strong communication skills via verbal communication, written communication, and through active listening. Ability to read and interpret information necessary to translate to others.\nLeadership Skills: Able to assume a role of responsibility, as necessary; sets an example for coworkers; delegates and empowers associates to make decisions and take personal accountability for decisions.\nHigh Accuracy and attention to detail: Able to perform work and job function with precision and accuracy; carefully monitors processes; concentrates on details, organizes and maintains a system of records.\nOwnership Mentality: Possesses a sense of ownership in all deliverables. Utilizes knowledge and opportunity to continually strive for excellence within an empowering culture. Collaborates and supports fellow employee owners in ongoing improvements. Understands personal accountability within their role in the company.\nComputer skills required: Microsoft Windows environment, Microsoft Office: Word, PowerPoint, Excel; Google: Mail, Calendar, Drive, Apps; familiarity with Deltek Vision preferred.\nArchitecture: Revit, Sketchup, Bluebeam; Graphic Software: InDesign, Adobe Illustrator, Adobe Photoshop\n\n\n\nBSA is a Equal Opportunity/Affirmative Action Employer\n\n\n\n\nQualifications\n\nEducation\n\nRequired\n\nBachelors or better in Architecture or related field.\n\nPreferred\n\nMasters or better in Architecture or related field.\n\nExperience\n\nRequired\n\n4 years: Experience working with projects focused on Healthcare.\n\nPreferred\n\n8 years: related experience\n\nLicenses & Certifications\n\nRequired\n\nRegistered Architect\n\nPreferred\n\nNCARB Certified\nAm. Institute Architects\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"ARCHITECT/DESIGNER","company_name":"FORGE CRAFT ARCHITECTURE + DESIGN","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$63.4K - $80.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nPlease submit resumes and portfolios to: resume@forgecraftarchitecture.com\n\n\n\n\nARCHITECT/DESIGNER: The ideal candidate has 2-5 years work experience in an architecture firm; strong design skills, experience with construction administration, experience with construction drawings, a strong professional work ethic with a commitment to timeliness and “being present”; autonomous but willing to follow direction and absorb training from more experienced designers; able to ask the right questions in the right context; a propensity for working in teams and interest in contributing to the firm culture; willingness to adapt to and master Forge Craft’s design and work methodology. Facility in 3D BIM systems as well as 2D computer- and manual graphic media is preferred, though not required. Experience with ArchiCAD (our BIM platform), Sketchup and similar applications are pluses. Active participation in the community-at-large is also a big plus.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Lab Planner/Architect Austin","company_name":"Lord Aeck Sargent Planning & Design, Inc.","company_location":"Hybrid remote in Austin, TX 78701","salary_range":null,"days_ago_posted":"Posted\nPosted 5 days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nContinuing education credits\nDental insurance\nDisability insurance\nHealth insurance\nShow 3 more benefits\nIndeed's salary guide\nNot provided by employer\n$93.9K - $119K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nLab Planner/Architect – Austin, Texas\nOur Austin office is looking for a highly motivated, Science and Technology Lab Planner/Architect, with excellent laboratory design and communication skills. The ideal candidate will be someone who can work well with people at all levels of the firm and will take the initiative to research, program, design and implement complex institutional & mixed-use science and technology projects.\nMINIMUM QUALIFICATIONS REQUIRED:\nBackground/Education\nProfessional (NAAB Accredited) Degree in Architecture\nIdeally 8 - 10+ years of experience working in the lab planning role in an architectural design firm\nStrong Lab Planning, Revit and production skills\nScience & Technology experience essential\nKnowledge and Skillset Required\nDemonstrated leadership and lab planning skills.\nInterest in building and nurturing client relationships.\nGraphic communication skills to support a variety of presentation media: presentation drawings, marketing materials, feasibility studies, etc. ideally proficiency in Sketchup, Enscape, Photoshop, Illustrator and/or InDesign\nSkilled in analytical thinking to support the lab design process\nSelf-motivated individual able to work well in a collaborative office environment\nGood computer skills and basic knowledge of Microsoft Office suite and Adobe Creative suite.\nAbility to handle multiple tasks, deadlines and interact effectively with others in the workplace.\nDesired Personality Traits\nDetail-oriented, methodical, meticulous, process-oriented, yet open to change and motivated by innovation\nGreat collaborator and communicator – excellent verbal and written skills are important\nAmbitious self-starter with get-it-done attitude who strives for results\nCareer and Leadership Oriented\nGood sense of humor\nAt Lord Aeck Sargent, we strive to make a positive difference in the built environment. Our mission is to provide innovative, responsive design - coupled with cutting-edge technological expertise and exceptional service - to our clients. As an award-winning architectural firm, we strive to maintain the high standard of excellence our clients have come to expect of us. To do this we rely heavily upon, and invest significantly in, the success of our employees. Across our seven market sectors and six offices, we promote a collaborative, diverse environment that is at once challenging, stimulating, supportive, and fun.\n\n\nLord Aeck Sargent provides our employees with ongoing learning opportunities, great benefits and a team-centered environment. We encourage our employees to discover and develop their own particular talents, skills, and interests in order to reach their own full potential. We believe that the key to our success as a firm is the personal and professional growth of the men and women who serve our clients every day.\nLord Aeck Sargent offers competitive salaries and strong personal and professional benefit packages including:\nPersonal Benefits\nMedical, Prescription & Vision Coverage\nDental Insurance\nDependent/Child Care Spending Accounts\nMedical Spending Accounts\n401(k) w/Company Match\nShort Term and Long Term Disability Insurance\nPaid Maternity/Paternity Leave\nLife Insurance (Employee and Family)\nNine (9) Holidays\nPaid Personal Leave\nHybrid Work Schedule\nProfessional Benefits\nInternal and External Continuing Education Opportunities\nProfessional Memberships Reimbursement\nBuilding Product Lunches\nProject Site Tours\nCompany Wide Social Gatherings\nLord, Aeck & Sargent Planning & Design is an Equal Opportunity Employer committed to Affirmative Action. Lord Aeck Sargent is committed to providing equal employment opportunities to all employees and applicants without regard to race, ethnicity, religion, color, sex (including childbirth, breast feeding and related medical conditions), gender, gender identity or expression, sexual orientation, national origin, ancestry, citizenship status, uniform service member and veteran status (VEVRAA), marital status, pregnancy, age, protected medical condition, genetic information, disability or any other protected status in accordance with all applicable federal, state and local laws.\nAttention Applicants: If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, please let us know. Likewise, if you are limited in the ability to access or use this online application process and need an alternative method for applying, we will determine an alternate way for you to apply. Please contact Victoria Cunningham at victoria.cunningham@lordaecksargent.com for assistance with an accommodation.\nHiring Insights\nJob activity\nPosted 5 days ago"},{"job_title":"Project Architect","company_name":"Stantec","company_location":"Austin, TX 78723 \n(Mueller area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$67.3K - $85.2K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nProject Architect - ( 2200016Y )\n\nDescription\n\nRanked the #1 architecture and engineering firm by Building Design Construction for the last decade, Stantec is recognized as an industry leader by Architecture Record, ENR, Interior Design magazine, and more. We offer employee groups that provide support and opportunity for our diverse workforce to grow and develop. Our efforts were recognized when Forbes magazine named us one of America's Best Employers for Women.\n\nOur Buildings practice keeps people at its heart, recognizing that our shared journey forward is shaped by the meaningful and responsive places we design. From iconic designs to monumental groundbreakings, join us to bring transformational building solutions to life. Every day we apply our expertise, creativity, and passion to propel communities into the future—join us!\n\nYour Opportunity\n\nJoin a Top 10 global integrated design firm in our Texas Buildings practice that provides Architecture, Buildings Engineering, and Interior Design services with a long history and deep commitment to the education sector. Our Austin office is seeking a Project Architect to join our Buildings practice. The successful candidate will be developing elevations, sections, 3D renderings and architectural details for projects. You will be assisting on innovative and creative new prototypes designed with sustainable products with green architecture sensibility as your goals.\n\nYour Key Responsibilities\n\nAssists in the planning, organization, and directing of the work throughout the life cycle of the project.\nEngages in the development of a design through sketches, physical models, electronic models, diagrams, massing studies, and other visual formats.\nUtilizes BIM technologies in development of three dimensional models of buildings and their components.\nParticipates in design critiques and pin-ups.\nInterprets and applies building codes and requirements of other regulatory agencies.\nPrepares and revises documentation in various architectural phases including site plans, floor plans, building elevations, building sections and details.\nParticipates in bidding and negotiation phase and prepare addenda.\nReviews shop drawings and submittals, responds to RFIs, prepares site observation reports and other contract administration tasks.\nLeads project coordination and meetings with internal team members and/or external consultants, owner, contractor and sub-contractors.\nParticipates in client project requirement meetings and value analysis and basic cost estimating.\nAssists in the preparation of the project specifications. Coordination of specs with construction documents.\nParticipates in constructability review.\nConducts quality assurance and quality control on own projects.\nPrepares and ensures that work conforms to project budget, schedule, and overall work planning.\n\nQualifications\n\nYour Capabilities and Credentials\n\nPassionate about designing K-12 education environments\nRequisite knowledge and application of accessibility codes, applicable building codes.\nDetailed understanding of all phases of architectural document production and the relationship between drawings and specifications.\nGeneral knowledge of building construction systems, means and methods, materials, and industry standards.\nAbility to conduct space planning, block planning and adjacencies in coordination with building program.\nTo develop floor plans, wall sections, and details.\nTo check own work for accuracy and completeness and manage time to meet project budget and schedule.\nTo participate and collaborate in a project team setting through all phases of architectural document production.\nTo engage in creative and critical thought.\nTo hand sketch and communicate concepts and ideas to others effectively.\nTo interpret sketches, drawings, building program and other similar material.\nTo communicate abstract ideas (verbal/written).\nRequires understanding of Microsoft Office Suite, Revit, AutoCAD, Abobe Creative Suite, SketchUP, Newforma, Sefaira and Bluebeam.\n\nEducation and Experience\n\nMaster’s degree in Architecture or bachelor’s degree in support of licensure criteria\nRegistered Architect in Texas or actively pursuing licensure\nMinimum of 5 years of experience\nArchitectural experience in education a plus\nLEED Green Associate or LEED AP preferred.\n\nPlease include a copy of your portfolio along with your resume for consideration.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n\nPrimary Location : United States-Texas-Austin\n\nOrganization : BC-2140 Buildings-US Texas\n\nEmployee Status : Regular\n\nJob Level : Individual Contributor\n\nTravel : No\n\nSchedule : Full-time\n\nJob Posting : Apr 5, 2022, 8:29:12 AM\n\nReq ID: 2200016Y\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"Actalent","company_location":"Austin, TX 73301 \n(St Edwards area)","salary_range":"$30 - $36 an hour","days_ago_posted":"Posted\nPosted 9 days ago","job_description":"Job details\nSalary\n$30 - $36 an hour\nJob Type\nContract\nFull Job Description\nEquivalent Experience\n\n\nDescription:\n\nUtilize REVIT to help produce technical drawings and schematic designs for educational projects Will help in all stages of design implementation beside licensed architects Assist in full project life cycle, core and shell Client communication and engagement to help deliver expectations accurately\n\nSkills:\n\nRevit, Architecture, Architectural design, Construction drawings, commercial architecture, Autocad, construction administration\n\nTop Skills Details:\n\nRevit,Architecture,Architectural design\n\nAdditional Skills & Qualifications:\n\nEducational Project experience K-12 Project experience Construction Documentation and Administration experience SketchUp\n\nExperience Level:\n\nIntermediate Level\n\nAbout Actalent:\n\nActalent connects passion with purpose. Our scalable talent solutions and services capabilities drive value and results and provide the expertise to help our customers achieve more. Every day, our experts around the globe are making an impact. We’re supporting critical initiatives in engineering and sciences that advance how companies serve the world. Actalent promotes consultant care and engagement through experiences that enable continuous development. Our people are the difference. Actalent is an operating company of Allegis Group, the global leader in talent solutions.\n\nThe company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.\n\nHiring Insights\nJob activity\nPosted 9 days ago"},{"job_title":"Lead Architect (Austin, TX)","company_name":"Jacobs","company_location":"Austin, TX 73344","salary_range":null,"days_ago_posted":"Posted\nPosted 20 days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nDisability insurance\nEmployee stock purchase plan\nHealth insurance\nPaid time off\nParental leave\nRetirement plan\nShow 1 more benefit\nIndeed's salary guide\nNot provided by employer\n$116K - $147K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\nAt Jacobs, advanced facilities simplify our everyday lives, enabling technology to connect us. We push the limits of what’s possible to make the world smarter, more connected and more sustainable.\n\n\n\n\nAs a Lead/Senior Project Architect in Austin, TX, you will have the chance to work with a highly creative, in-house multi-disciplinary team dedicated to innovative problem-solving and design excellence. You will support the design of complex advanced facilities and structures for our clients requiring advanced planning and building techniques. Collaborating in our fast-paced environment with other members of the team, you will work in all phases of design, performing conceptual, layout, and detailed design tasks. You will oversee design and construction activities, studies, and various analyses, leading design coordination across architecture and engineering disciplines. With our team you will also have the opportunity to provide technical guidance and mentorship to junior team members, helping your team discover what drives them, nurturing their purpose, and guiding them forward.\n\n\n\n\nWe are looking for individuals with leadership and expertise. You will be leading a team of architects and designers in the design of complex and technical facilities. Project types include state-of-the-art electronics manufacturing facilities, data centers, and cleanroom environments. In this position you will be supporting project management in securing new projects, and providing effective project oversight.\n\n\n\n\nIf you’re up for the challenge, we’ve been looking for someone just like you. Join our team and help us lay the foundation for human progress. Bring your creativity, ambitious spirit, and desire to bring value to your team, and we’ll help you grow, pursue, and fulfill what drives you – so we can deliver extraordinary solutions for a better tomorrow, together.\n\nHere’s What You’ll Need:\n\nProfessional Architecture license\nAt least 15 years of architecture experience\nLeadership experience motivating, coordinating, and guiding small to medium architecture teams\nSelf-starter personality with the ability to work collaboratively and independently\nExperience delivering projects from concept through detailed design\nWorking knowledge of building codes and specifications\nExperience with Building and Site Planning, including interface with the client to ensure expectations are identified and met\nAbility to perform sales activities including client development, proposal and qualifications development, and interviews\nHistory of developing and monitoring financial and project delivery schedules\nEstablished practice of managing and ensuring project quality, as well as providing ideas and suggestions aimed at improving the effectiveness of project activities.\nExcellent client focus\nGood social, networking, organization, communication, people, and presentation skills\nProficiency in Microsoft Word, Excel, and Power Point programs\n\n\n\nIdeally, you’ll also have:\n\nAdvanced facilities building design experience\nExperience providing personnel management and directing the daily activities of small teams\nAware of sustainability and emerging technologies\nFamiliarity with Revit\nLEED accreditation\nDesire to travel\nSketch up, Adobe Suite, InDesign skills\n\n\n\n#afelectronics #architect\n\n\n\n\nAt Jacobs, we help prepare people for new opportunities and challenges. With positions at every level, openings in multiple disciplines, expertise in a range of markets and offices around the globe, we create an environment where you can learn, grow, and thrive. From our competitive benefits program to our Health and Safety initiative of Beyond Zero workplace injuries, we believe that you'll find a flourishing career here at Jacobs.\n\nJacobs health and welfare benefits are designed to invest in you, and in the things you care about. Your health. Your well-being. Your security. Your future. Typical benefits offered include, educational reimbursement, retirement benefits, employee stock purchase plan, health benefits, disability benefits, life and accident insurance, voluntary benefits, paid time off, paid holidays, and parental leave. Salary to be offered is geographic dependent and commensurate with experience relative to the position.\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 20 days ago"},{"job_title":"EXPERIENCED ARCHITECT","company_name":"Herzog & de Meuron","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$68.9K - $87.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHerzog & de Meuron is an international architectural practice based in Basel with studios in Berlin, Munich, London, Paris, Copenhagen, Hong Kong, New York and San Francisco. Our team of over 500 collaborators develops projects of all scales across Europe, the Americas and Asia.\n\n\n\n\nFor our project in Austin (TX), we are looking for an experienced Architect.\n\n\n\n\nRequirements for the position are:\n\n– Professional degree in architecture, registration is not necessary\n– 3-7 years of experience in project planning, detailing and execution on large scale international projects, US experience preferred\n– Experience with communication with executive architects and engineers\n– Experience in development of drawing packages, samples/materials, mock-ups\n– Experience in facade design (DD-level), building detailing, systems coordination\n– Excellent knowledge of AutoCAD/Revit, Rhino, scheduling\n– Excellent ability to communicate orally and in writing English\n– Willingness to temporarily relocate and collaborate on our construction site in Austin (TX), United States\n\n\n\n\nYou enjoy working in an international and creative environment, build relationships and motivate teams of people. Distinct analytical skills enable you to manage the complexity on organizational and coordinative fields and report back to the Project Manager.\n\n\n\n\nYour application should include a cover letter (stating availability and salary expectation), a complete resume, and a portfolio in a PDF format not to exceed 10 MB. You can send your documents either by using our online application form on our website or by posting it to us referring to the reference number P22-19.\n\n\n\n\nHerzog & de Meuron\nHuman Resources / P22-19\nRheinschanze 6\nCH-4056 Basel\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architects at All Levels in Austin","company_name":"Pappageorge Haymes Partners","company_location":"Remote in Austin, TX 78702","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$68.9K - $87.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHerzog & de Meuron is an international architectural practice based in Basel with studios in Berlin, Munich, London, Paris, Copenhagen, Hong Kong, New York and San Francisco. Our team of over 500 collaborators develops projects of all scales across Europe, the Americas and Asia.\n\n\n\n\nFor our project in Austin (TX), we are looking for an experienced Architect.\n\n\n\n\nRequirements for the position are:\n\n– Professional degree in architecture, registration is not necessary\n– 3-7 years of experience in project planning, detailing and execution on large scale international projects, US experience preferred\n– Experience with communication with executive architects and engineers\n– Experience in development of drawing packages, samples/materials, mock-ups\n– Experience in facade design (DD-level), building detailing, systems coordination\n– Excellent knowledge of AutoCAD/Revit, Rhino, scheduling\n– Excellent ability to communicate orally and in writing English\n– Willingness to temporarily relocate and collaborate on our construction site in Austin (TX), United States\n\n\n\n\nYou enjoy working in an international and creative environment, build relationships and motivate teams of people. Distinct analytical skills enable you to manage the complexity on organizational and coordinative fields and report back to the Project Manager.\n\n\n\n\nYour application should include a cover letter (stating availability and salary expectation), a complete resume, and a portfolio in a PDF format not to exceed 10 MB. You can send your documents either by using our online application form on our website or by posting it to us referring to the reference number P22-19.\n\n\n\n\nHerzog & de Meuron\nHuman Resources / P22-19\nRheinschanze 6\nCH-4056 Basel\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"In-House Architect for Home Builder & Remodeler","company_name":"Craftsman Collective","company_location":"Hybrid remote in Austin, TX 78751","salary_range":"$40 - $60 an hour","days_ago_posted":"Posted\nPosted 13 days ago","job_description":"Job details\nSalary\n$40 - $60 an hour\nJob Type\nFull-time\nFull Job Description\n\nRecruiting a Texas registered architect as in-house design lead for a self-perform home builder and remodeler focused on Hyde Park, Austin. Our crew is tight knit and enjoy what we do, so the role requires a positive attitude and sense of community. Pay is commensurate with experience, but expected $40 to $60 per hour working 4 days per week with chef-prepared lunches provided daily. Significant room for growth and bonus opportunities planned for the future. Ideal candidate is an independent architect in the Austin area interested in joining a growing team of construction professionals that share resources and contacts to collective benefit.\n\nEssential skills:\n\nLicensed architect in the state of Texas\nCreate architectural plans, building elevations/sections, and details as required to show compliance with Austin, TX development codes.\nCreate designs and shop drawings for cabinets, doors, and millwork in coordination with clients and crew.\nBasic graphic design capabilities to attractively present proposals and marketing materials.\nOversee aspects of home building and remodels in a deputy project management capacity.\n\nPreferred Experience:\n\nHome building in central Austin, TX.\nBuilding information modeling and virtual reality environments.\nHigher level graphic design capabilities.\nWeb design.\nQuantity takeoffs.\nEstimating.\n\nJob Type: Full-time\n\nPay: $40.00 - $60.00 per hour\n\nSchedule:\n\n4x10\n\nWork Location: Hybrid remote in Austin, TX 78751\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 13 days ago"},{"job_title":"Architectural Designer - Austin","company_name":"FGM Architects","company_location":"Austin, TX 78746","salary_range":null,"days_ago_posted":"Posted\nToday","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$62.4K - $79.1K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nPOSITION: ARCHITECTURAL DESIGNER\n\nAt FGMA, we build communities and are dedicated to our internal community.\n\nJoining the FGM Architects team isn’t just taking a job, it’s joining a community where we learn and grow together.\n\nWe teach, inspire, and serve one another every day.\n\nFGMA is an employee-owned professional service firm with an emphasis on service. Our projects respond to the goals of our clients, the context of their sites, the environment that sustains them and the communities they serve. We practice architecture and interior design. Established in 1945, FGM Architects serves PK-12 Education, Higher Education, Faith-based, Municipal, Public Safety and Recreation, Federal and Corporate clients from our offices in Texas, Illinois, Missouri, Wisconsin, and Virginia.\n\nWe welcome Architectural Designer candidates who are eager to take on the following responsibilities and possess the skills and credentials listed below:\n\nResponsibilities:\n\nWorking with the project’s Design and Technical Leads, assists in developing the design, implementing the building program, and preparing project documentation appropriate to each phase\nExperience in coordinating with other design disciplines (ie: Structural, MEP, Civil)\nHave an intimate knowledge of finish materials for exterior and interior application\nUnderstands the technical implications of design decisions and contributes to the development and documentation of practical, buildable details\nBasic knowledge of codes and regulations relevant to building design and construction\nPrepares presentation materials to communicate design ideas\nClient-oriented personality with ability to communicate clearly and concisely, both verbally and in writing\n\nSkills and Credentials:\n\n3 – 10 years of relevant experience\nResourceful and strategic problem solver\nMotivated and self-starter personality\nCapable of working independently and flexible in transitioning to team setting environment\nProficient in Revit with experience in both preliminary design and construction drawings documentation; knowledge of modeling and rendering in 3-D software (ie: Enscape, Lumion, FormIT)\nProfessional degree in architecture from an accredited program; candidates on the licensure track preferred\nLEED accreditation preferred\n\nFGM is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n\nJob Type: Full-time\n\nHiring Insights\nJob activity\nPosted Today"},{"job_title":"Architect - Workplace - Senior","company_name":"Gensler","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$96.8K - $123K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nAt Gensler, we design for people. We leverage our global perspective and local presence to innovate at every scale. We’re not just designers. We’re tinkerers, craftspeople, visionaries, innovators and thought leaders. Fueled by passion and entrepreneurial spirit, our people bring new ideas to solve challenging problems. Whether you’re into sketching new ideas, hacking a building or growing client relationships in global markets, there’s something here for everyone.\nYour Role\nGensler's Austin office is seeking an Architect to join our Workplace team. As a Gensler Architect, your job is to combine creativity and technical knowledge with business skills and understanding to produce functionally beautiful spaces for clients. As a team member at Gensler you will collaborate to create impactful and sustainably-focused experiences. Your role is critical in the design and delivery of world-class\nMixed Use + Retail Centers\n,\nProfessional Services\n, and\nResidential\nprojects. Your work ethic and dedication to problem solving, combined with our commitment to collaboration and mentoring, makes Gensler the perfect place to further your career.\nWhat You Will Do\nManage communication between project team, client, vendors, contractors, and consultants\nResolve complex technical and design issues with team to produce innovative technical/constructible solutions\nDirect production of drawings, specifications and construction administration tasks\nResponsible for oversight and delivery of documents with design intent and top-notch technical quality\nResolves complex technical/design issues and detailing and provides guidance and mentorship to team\nMaintain and oversee the project manual and specifications\nConduct on-site observations and document site reviews\nInterface with building and permitting officials during the permitting and construction phases of the project\nActively lead and contribute to the financial performance and successful delivery of a project\nReview and contribute to proposals and contracts with Project Manager\nEnsure projects conform to contract\nManaging client expectations, team communication and oversight of consultant coordination\nContribute to office activities, initiatives and learning programs\nEstablish and maintain ongoing, productive client relationships\nYour Qualifications\nRegistered Architect required\nBachelor's degree in Architecture from an accredited school required\n10+ years of related experience\nRevit experience required\nFull knowledge of architectural principles/practices\nWorking knowledge of building codes, standards and building structures\nExperience with the entire project lifecycle and design process through post-occupancy\nFlexibility to focus on concurrent projects in various stages of development\nA quick learner with an ability to thrive in a fast-paced work environment\nExcellent written + verbal communication and management skills to include leadership, organization and client relationship management skills\nWell-rounded, strategic-thinker with an integrated approach to design, management, and technical project resolution who can help shape a vision for the future\nTO BE CONSIDERED, PLEASE SUBMIT A CURRENT PORTFOLIO AND/OR WORK SAMPLES IN PDF FORMAT\n*This is not a remote position. The successful candidate is expected to be in the Austin office.*\nLife at Gensler\nGensler is committed to\nDiversity, Equity and Inclusion\n. Through our Five Strategies to Fight Racism, we continue to create a just and equitable future for our colleagues and our communities with our clients. We are a solid voice for social change as we impact people’s lives and fight racism. At Gensler, we celebrate diversity and are committed to creating an inclusive workplace environment.\nAs a people-first organization, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.\nWe encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Assistant Project Manager/Architect (FR)","company_name":"Technology Service Professionals, Inc","company_location":"Austin, TX 78735 \n(East Oak Hill area)","salary_range":"$65,000 - $75,000 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$65,000 - $75,000 a year\nJob Type\nFull-time\nQualifications\n\nProject management: 1 year (Preferred)\n\nWork authorization (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nFull Job Description\n\n[DUTIES / RESPONSIBILITIES]\nOPPORTUNITY\nThis is a terrific opportunity for an aspiring architect to gain valuable experience while developing your current skills. This opportunity is to assist a project manager who is actively managing multiple projects at the various stages of design and construction (including predesign, design, construction documents and construction administration). Our client offers a culture of caring and respect while offering competitive benefits of personal time off, salaries, 401K savings, healthcare insurance along with registration exam fees.\n\nKEY RESPONSIBILITIES\nPerform project management activities as guided by an experienced project manager.\n\nMaintain a cheerful outlook to best relate to your clients and teammates.\nVisit construction jobsites, client offices and school campuses.\nParticipate in design meetings with your clients and teammates.\nOrchestrate verbal and graphic communication with the client and project team.\nPrepare, distribute, and maintain various forms of documentation (drawings, specification, shop submittals, meeting minutes, schedules, budgets, and project updates).\nObserve and record field conditions and deviations from the contract documents by creating site visit reports and punch lists with photo documentation.\nAssist the project manager at preconstruction meetings for building systems to set expectations.\nAttend Owner/Architect/Contractor meetings with the project manager.\nCoordinate clarifications to contractor questions based on site observations.\n\n[QUALIFICATIONS / EXPERIENCE]\nQUALIFICATIONS\n\nInitiative-taking approach to collaboration and communication with your clients, team, and contractors.\nPrioritize tasks, manage multiple projects including their deadlines.\nRead and understand drawings, specifications, and critical path scheduling.\nWork with industry standard software including REVIT, AutoCAD, SketchUp, and Microsoft Office.\nTechnical knowledge of architectural systems.\nGeneral understanding of accessibility codes, life-safety codes, industry standards, building construction materials/systems and means and methods.\nGeneral understanding of civil, structural, mechanical, plumbing, electrical and low voltage systems.\n\nEDUCATION AND EXPERIENCE\n\nMaster’s degree in Architecture or bachelor’s degree meeting licensure criteria.\nActively pursuing license.\n\nPHYSICAL DEMANDS\n\nJob site visits: Traverse through the interior, top and underneath of buildings being constructed,\n\nclimb ladders, observe from elevated platforms and lifts, and work outdoors.\n\nOffice Work: Sit or stand during regular working hours.\n\nJob Type: Full-time\n\nPay: $65,000.00 - $75,000.00 per year\n\nBenefits:\n\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nAbility to commute/relocate:\n\nAustin, TX 78735: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nProject management: 1 year (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nApplication response rate: 54%\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Designer/Architect","company_name":"Rios Inc","company_location":"Austin, TX 78704 \n(South Lamar-South Congress area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$53.3K - $67.5K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nDescription:\n\nThe Designer role is responsible for being a positive team player and participating in the RIOS design process while focusing on professional development and obtaining technical expertise. A Designer strives to deliver top-notch project task execution and contributes to the overall success of the team.\n\n\nEssential duties include:\n\nLearning, promoting and striving to apply our office Mission and Values of curiosity, inclusion, collaboration, making and perspective through a collaborative design outlook on all assigned project tasks\nActively engaging in the design process and working toward the successful performance of a project\nSuccessful and accurate delivery of assigned project tasks that meet the project goals and concepts set forth by studio leadership\nUsing independent judgement to evaluate, select or modify standard techniques within project criteria\nDemonstrating the ability to show initiative and the ability to think critically and reasonably to anticipate task completion needs\nEffectively communicating with studio leadership and peers; to include asking appropriate questions when necessary\nStriving to ensure a high quality design delivery through continued, self- guided learning of professional practice and discipline\nFostering and encouraging a positive work environment among peers and teams both in attitude and outlook; Engaging in the office culture\nRequirements:\n\nThe ideal candidate must possess the following skills:\n\nStrong design skills and a passion for creativity\nStrong organizational skills\nA high degree of self-motivation, flexibility, and resourcefulness\nConstruction documents and specification experience\nConstruction administration experience, as well as experience coordinating with a range of consultants including civil, electrical, and structural engineers\nAbility to skillfully work alongside internal and external customers\nStrong written and verbal communication and collaboration skills\nResidential project experience and interest preferred\n\nMinimum Qualifications:\n\nA minimum of 1-4 years of professional experience\nBachelor of Architecture degree or a Master’s of Architecture degree from an accredited college or university\nExperience with Autocad, Rhino, Photoshop, Illustrator, InDesign, and REVIT\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Professional","company_name":"FTC Architects","company_location":"Austin, TX 78728 \n(Wells Branch area)","salary_range":"$15 - $30 an hour","days_ago_posted":"Hiring ongoing","job_description":"Job details\nSalary\n$15 - $30 an hour\nJob Type\nFull-time\nFull Job Description\n\nJob Duties\n\nAttend client meetings from earliest stages right through to completion of each project assisting a president of the company/licensed architect for successfully identifying clients' needs and requirements.\nAssisting in developing architectural design planning and technical solutions throughout all design phases.\nPut together feasibility reports satisfying building's usage and environmental impact.\nProduce presentation drawings and 3D models for client review and approval.\nWork in close liaison with clients and a president architect for communicating successfully throughout the course of each project.\nPrepare and submit building permit package.\nFollow up the permitting process by coordinating with the city reviewer's\nProduce construction drawings and specifications.\nAssist in construction administration process to monitor compliance and building/safety regulations in carrying out design concepts.\nResolve complex design and construction issues with innovative solutions.\n\nWork Experience Requirement\n\nAt least 2 year experience in architectural industry.\n\nSpecial Skills Required\n\nAt least 12 months of experience in AutoCAD, Revit, Adobe Photoshop, Adobe Illustrator, Microsoft Office\n\nEducational Requirement\n\nCollege/Bachelor's degree in Architecture\n\nApplicant must have an authorization to work in the US. Visa sponsorship is not available.\n\nJob Type: Full-time\n\nPay: $15.00 - $30.00 per hour\n\nSchedule:\n\n5x8\n\nWork Location: One location\n\nHiring Insights\n\nOn-going need to fill this role\n\nJob activity\nPosted today"},{"job_title":"Architectural Associate","company_name":"Huckabee","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$46K - $58.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHuckabee is one of the fastest growing A/E firms in the nation and one of the top educational design firms. We are a mission-driven company that is dedicated to the success of all students. What we do matters, which is why we look for people who share our passion for changing the world through design and who want to create an impact of excellence on education. If you are ready to join our movement, reach out!\n\nCurrently, we are accepting resumes for a talented Architectural Associate with a minimum of 2 years experience working in the commercial architectural field to join our team. The position will offer the candidate opportunities to grow within the firm and thrive in an innovative, fast-paced, and highly collaborative environment developing well rounded skills. Educational facility experience is a plus. At Huckabee, an Architectural Associate will work under the direction of a Project Architect and is responsible for technical design development for a wide range of project sizes.\n\nRESPONSIBILITIES\n\nWork on project development in design phases\nMaintain project delivery schedule and communicate concerns with project team\nPrepare schematic and design development phase presentation materials\nDevelop construction documentation and specifications\nCreate develop and maintain BIM projects through all phases of project\nCoordinate with consultants utilizing BIM, 2D documentation, and specifications\nAssist the Project Architect in the preparation of request for pricing and review of shop drawings\nSite visits as necessary\n\nREQUIREMENTS\n\nProficient in Revit, Adobe Creative Suite, BIM 360, Bluebeam Revu, and Office 365\nExperience with Navisworks, and AutoDesk FormIt, preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect I / Architect II - Austin","company_name":"FGM Architects","company_location":"Austin, TX 78746","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$46K - $58.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHuckabee is one of the fastest growing A/E firms in the nation and one of the top educational design firms. We are a mission-driven company that is dedicated to the success of all students. What we do matters, which is why we look for people who share our passion for changing the world through design and who want to create an impact of excellence on education. If you are ready to join our movement, reach out!\n\nCurrently, we are accepting resumes for a talented Architectural Associate with a minimum of 2 years experience working in the commercial architectural field to join our team. The position will offer the candidate opportunities to grow within the firm and thrive in an innovative, fast-paced, and highly collaborative environment developing well rounded skills. Educational facility experience is a plus. At Huckabee, an Architectural Associate will work under the direction of a Project Architect and is responsible for technical design development for a wide range of project sizes.\n\nRESPONSIBILITIES\n\nWork on project development in design phases\nMaintain project delivery schedule and communicate concerns with project team\nPrepare schematic and design development phase presentation materials\nDevelop construction documentation and specifications\nCreate develop and maintain BIM projects through all phases of project\nCoordinate with consultants utilizing BIM, 2D documentation, and specifications\nAssist the Project Architect in the preparation of request for pricing and review of shop drawings\nSite visits as necessary\n\nREQUIREMENTS\n\nProficient in Revit, Adobe Creative Suite, BIM 360, Bluebeam Revu, and Office 365\nExperience with Navisworks, and AutoDesk FormIt, preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect | Education","company_name":"Corgan","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nContinuing education credits\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$70.1K - $88.7K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nOverview:\nCorgan supports the continued development of its people. The better you are, the better we are. That’s why the resources we provide are carefully targeted to help you with every aspect of your career - communication, leadership, creativity, and technique. You have access to our reading library, extensive sample library, and a broad, in-house continuing education curriculum that ranges from contract negotiation to the art of hand sketching. Beyond the classroom, Corgan hosts a variety of study sessions, seminars, workshops, crits, lectures, and peer group reviews. Together, these resources promote an entrepreneurial spirit that pushes the boundaries of science and art, technology, and design. Corgan is actively recruiting an experienced, registered architect to join our growing Education practice in our Austin office location. Our firm offers unique opportunities for both personal and professional growth by offering a wide-range of project responsibilities and team leadership roles.\nResponsibilities:\n\nThe ideal candidate will be a team-oriented, highly-motivated individual seeking progressively more responsible assignments on a variety of projects.\n\n\n\nResponsibilities include:\nAssisting on full life cycle projects\nGenerating creative design solutions within the functional parameters of a project\nTranslating concepts and information into images\nParticipating in the process of exploring and completing usable construction document detailing solutions\nAssisting with contract administration responsibilities\nCoordinating with a variety of consultants\n\n\nQualifications:\nQualified candidates should exhibit strong master planning and organizational skills and be able to collaborate in a diverse project team. Strengths in conceptual design, technical excellence, and communication skills are also desired. Candidates should be familiar with coordinating project deliverables and clients.\n\n\nA professional, NAAB accredited degree in Architecture is required, along with 3+ years of experience and Revit proficiency. Experience with other 3D software preferred. Current architectural registration or anticipation of registration and experience preparing all stages of design documentation, performing construction administration, and consultant coordination are required. Education project experience and a willingness to travel is strongly preferred.\n\nCorgan believes in partnering for success, building on our legacy for the future, and providing an excellent product. Corgan’s project sectors include aviation, data centers, commercial, education, interiors, and healthcare. Our 92% repeat client business record is a testament to our ability to serve clients in a competent, ethical, and professional manner. Corgan offers a competitive compensation and benefit package and in addition to our excellent environment, philanthropic culture and numerous awards, we offer the ability to work with the highest level of technical equipment and programs.\n\n\n*Only applications received through our website will be considered.* EOE/M/F/Disability/Vet\n\n\n#LI-POST\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Branded Environments - Designer II","company_name":"Perkins+Will","company_location":"Austin, TX 78702 \n(Rosewood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 1 more benefit\nIndeed's salary guide\nNot provided by employer\n$64.3K - $81.4K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nAs a Branded Environments Designer II on the Perkins&Will team, your skills and passion will come to life through the following responsibilities:\n\nDemonstrate advanced knowledge of project complexity to proactively contribute to the overall success of the team by adhering to firm and project goals and standards of excellence in design, execution, and living design.\nExhibit advanced understanding of branding concepts (including interior architecture, print graphics, environmental graphics, and signage and wayfinding) and their integration in the built environment.\nProvide design support to team members and supports the growth of others.\nExecute design plans, design strategy, storytelling, color plans, and schedules.\nDevelop plan diagrams, sections, and elevations.\nInfluence and manipulate design elements and applies principles of design such as form, scale, color, texture, pattern, balance, and proportion.\nDevelop, prepare, and coordinate presentation materials and models and leads client presentations.\nParticipate in site analysis, including survey of existing conditions and field measurements.\nImplement a creative approach to complete tasks and responsibilities on projects, within the scope of schedule and budget, in an organized, timely, and consistent way.\nReview work for accuracy, omissions, legibility, and for document compliance in accordance with the Project Delivery Manual.\nExpress curiosity about the world of design and the industry at large.\nTake increasing ownership on tasks within project teams and studio activities.\nParticipate in design reviews, charrettes, and pin-ups.\nKeep open communication within team and with designated team leader.\nCommunicate ideas and thoughts in a way that inspires others.\nCoordinate effectively with partners and consultants.\nSupport growth of others.\n\nWhat you've accomplished so far:\n\nA professional degree in Interior Design, Architecture, Graphic Design, Communication Design, or related discipline\n5+ years of experience\nDemonstrated competency and experience in all phases of Branded Environments design\nProficiency in InDesign, Photoshop, PowerPoint, 3D modeling, visualization, and graphic software; Revit strongly preferred\nEffective verbal and written communication skills\nProblem solving skills, attention to detail, and motivation to learn\nCollaborative and professional work ethic\nLEED AP or within 6 months of hire\n\nQualified and interested candidates should submit a resume and work samples. Include your resume and a compact, representative sample of your work (no larger than 4MB).\n\n\n\n\nAt Perkins&Will we believe that inclusion spurs creativity, and that innovation is born from an engaged culture of diverse people + ideas. By moving beyond barriers and stereotypes of gender, race, color, religion, national origin, ancestry, age, medical condition, disability, sexual orientation, gender identity, veteran status; we are committed to building an organization that reflects the diversity of the communities and clients we serve.\n\n\n\n\nPerkins&Will offers a comprehensive benefits package, including medical, dental, vision, wellness, STD, LTD, Life Insurance, 401k, and PTO. Employee perks include a hybrid/flexible work environment supported by cutting-edge technology, professional development time and expense budget, bonuses, studio initiatives and firmwide affinity groups, and a Justice, Equity, Engagement, Diversity, and Inclusion foundation to everything we do.\n\nQualifications\n\nEducation\n\nPreferred\n\nBachelor or better in Architecture or related field.\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Designer (Austin, TX)","company_name":"Jacobs","company_location":"Austin, TX 73344","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$82.4K - $104K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\nAt Jacobs, advanced facilities simplify our everyday lives, enabling technology to connect us. We push the limits of what’s possible to make the world smarter, more connected and more sustainable. Jacobs is recognized globally as one of the leading design firms for advanced technology industrial projects. We design of some of the most complex and specialized facilities being constructed today, including projects for semiconductor manufacturing, data centers, and other state of the art manufacturing facilities. Our services include feasibility studies, long-range planning studies, and the full spectrum of design services from conceptualization through construction support.\n\n\n\n\nAs an Architectural Designer with the architecture team in Jacobs Advanced Facilities – Electronics group in Austin, TX, you will help us design state-of-the-art microelectronics facilities, data centers, and other advanced industrial and commercial facilities powering our virtual world today and into the future. As an integral member of this team, you will be responsible for preparation of drawings and sketches using Revit and related BIM software. You will evaluate and resolve problems by applying appropriate solutions and will actively promote overall quality of the design and project deliverables. As part of the design team, you will effectively communicate and work closely with architects and engineering disciplines and be part of a team performing conceptual, layout, and detailed design tasks, coordinating design and construction activities, studies, and various analyses. You’ll also have the chance to utilize your technical expertise mentoring junior team members.\n\n\n\n\nDuties and responsibilities include:\n\nModeling, preparing drawings and sketches using Revit and applicable software, applying suitable design criteria.\nCreate conceptual models based on verbal direction or rough sketches from architects or other designers.\nManage and incorporate redlines from others.\nMaintaining reliable work practices to meet schedule, budget, and quality requirements.\nHighly proficient in self-checking work and coordinating with related disciplines to resolve design.\nProactively advancing workflows, systems, and tools, including design automation skills.\nFamiliarity with emerging technologies.\nHighly focused on quality, ensuring conformance with established architecture standards, project standards, and project delivery processes.\nAble to provide quality reviews of models and documents prepared by others to assure design and project standards are met.\n\n\n\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other.\n\nHere’s What You’ll Need:\n\nBachelor’s or Masters degree in Architecture from an accredited Architectural program\nAt least 5 years of architecture experience\nProficiency in Revit 3D modeling\nExperience with Sketch up, Adobe Suite, InDesign, and Navisworks\nStrong communication, interpersonal, and collaboration skills\n\n\n\nIdeally, you’ll also have:\n\nExperience with building codes and specifications\nExperience with semiconductor or general industrial facilities\nLEED accredited\nAbility to travel\n\n\n\n#afelectronics\n\n#LI-remote\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"Page Southerland Page Inc","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 11 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$75.5K - $95.6K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nThe Project Architect is responsible for the leadership and technical execution of project design, building code and stamping, technical quality of project documentation. In this role, the Project Architect will:\n\nPlan and conduct work requiring independent judgment in the evaluation, selection, adaptation and modification of standard construction components and systems to execute design intent\nBe responsible for stamping and sealing bid documents\nPlan, schedule, conduct, and coordinate detailed phases of professional work in part of a medium scope project or in a total project of smaller scope\nEnsure compliance with applicable codes and ADA requirements\nAssist the Project Director in developing project staff-hours and planning schedule for his/her aspects of the project\nCoordinate the layout, design, drafting, and specifications produced by other architects and technicians who assist in specific assignments\nMentor junior staff and assist in the development of future project architects\nIn consultation with the Project Director, assist in establishing project design criteria\nThrough research, study, and consultation with outside consultants and professional societies, keep informed of new developments and systems as they influence the individual?s particular field of architectural practice and design\nPromote technologies and methodologies to create innovative approaches and improve technical quality of work product; keep abreast of new technologies, changes in building codes, and advances in the industry\nWork collaboratively in a cross discipline environment to produce integrated project documents, and insure integrated design approaches and solutions\n\nHiring Insights\nJob activity\nPosted 11 days ago"},{"job_title":"Project Designer","company_name":"Leslie Fossler Interiors","company_location":"Austin, TX 78703 \n(Clarksville area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$59.7K - $75.6K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nLFI is a small boutique interior design firm in Austin, Texas.\n\nConsistently ranked in the top 10 Austin Business Journal list of Commercial Interior design firms since 1981, LFI is experiencing amazing growth in the Hospitality sector.\n\nLFI is actively recruiting full-time Project Designers with a minimum of 5-7+ years of experience in commercial interiors. Candidates should have strong people skills, a passion for the creative process and be proficient in drawing in Auto CAD, Excel, and other software programs relevant to project presentation techniques.\n\nApplicants are expected to be registered in the state of Texas and/or hold an Architecture degree from an accredited University. NCIDQ and/or LEED AP certified is desirable.\n\nQualified candidates should submit a Letter of Interest, Resume and strongest representative sampling of their portfolio electronically to be considered.\n\nPlease send electronic resume and portfolio to leslie@lfiaustin.com\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect - Vertical Planning and Design - $150K+","company_name":"Red Oak Development Group, LLC","company_location":"Hybrid remote in Austin, TX 78702","salary_range":"From $150,000 a year","days_ago_posted":"Employer\nActive 5 days ago","job_description":"Job details\nSalary\nFrom $150,000 a year\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\nPaid time off\nFull Job Description\n\nVIEWPOINT ENGINEERING, a subsidiary of RED OAK DEVELOPMENT GROUP, is in search of a Director of Vertical Planning and Design. We are seeking an ambitious architect who will take on the role of building out a Residential Vertical Design team from the bottom up with support and alongside the VP of ViewPoint Engineering. This person will be responsible for building out team structures, hiring staff based on that structure, making decisions on scope of vertical services, and growth planning for the business.\n\nResponsibilities:\n\nResponsible for providing architectural guidance, calculations, analysis, studies and recommendations for a specialized segment of the Architectural Discipline within the schedules and budget of an assigned project.\nMay manage various size groups of architects in training, project managers, designers, and/or specialists.\nSupervise the preparation of architectural drawing for all phases, including proposal presentations, concept, schematics, design documents, construction cost estimates, and construction documents\nManage projects of all sizes (including negotiating project scope and fees, job production & quality, fee management, and collection).\nEstablish and manage project budgets and schedules.\nEstablish and guide the vision of the design on projects.\nDirect team members and others in the application of architectural standards and guidelines.\nLead the design efforts through all stages of a project, including leadership with the client, contractors, and internal team.\nConduct quality control review of others' projects.\nAnticipate and plan ahead for potential roadblocks on agency approvals.\nManage contractor and client relations during construction for larger and more complex projects.\nDetermine content of design presentations to client representatives and/or design review committees, and present them.\nConduct design work sessions and visioning, outreach, and public forms.\nParticipate in marketing efforts including proposal development, interview participation and presentations (this includes proposal writing and scope and fee negotiation).\nMentor junior staff and participate in performance coaching.\nDevelop and maintain relationships with current/new clients.\n\nQualifications:\n\nLicensed Architect\nMinimum of 10-12 years experience in Architecture\nMinimum of 3-4 years of supervisory experience including directing the work of others involved in civil engineering activities\nTBAE Certification\nSelf-Motivated Leader\nExtensive Multi-Family and transitional residential experience (Townhomes, Brownstones, Cottage Housing, Micro-units)\nMust live in the Greater Austin area\n\nJob Type: Full-time\n\nPay: From $150,000.00 per year\n\nBenefits:\n\nPaid time off\n\nSchedule:\n\nMonday to Friday\nSelf-determined schedule\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nAustin, TX 78702: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: Hybrid remote in Austin, TX 78702\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nEmployer reviewed job 5 days ago\nPosted 13 days ago"},{"job_title":"Senior Project Architect, Gigafactory Texas","company_name":"Tesla","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$108K - $137K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nWhat to Expect\nOur Factory Engineering group is seeking a highly motivated Senior Project Architect who will work on multiple projects at our Gigafactory in Austin, TX.\nWhat You’ll Do\nExecute architectural projects end to end across a variety of building applications Lead project quality, standards, specifications, and staffing requests Designing and produce construction documents, obtaining building permits Partner with construction in the field, handling RFIs and submittals Develop process improvements / workflows / templates to increase design productivity Coordinate with interdisciplinary team of Engineers, Architects, and Construction personnel\nWhat You’ll Bring\nBachelors or Master’s degree in Architecture or 10+ years of relevant working experience Advanced proficiency in Revit Must be able to sign off NCARB hours Experience in all phases Schematic Design, Design Development, Construction Documents, and Construction Administration Preferred experience with Grasshopper and Rhino\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Healthcare Architect","company_name":"Marmon Mok","company_location":"Austin, TX 78702 \n(Rosewood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"(Elec) Design BIM Coordinator","company_name":"The HT Group","company_location":"Austin, TX 78731","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$82.4K - $104K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nSalary: $0 per year\nReference: 16436\n\n\nThe HT Group is currently helping to provide talent for a Korean based company with a new plant in Taylor, TX. We are in search of a qualified Construction Manager for an immediate opportunity today! Our client offers 100% paid benefits for you and your family as well as an opportunity to get paid for working overtime for any hours worked beyond 8 hours per day. These are full-time direct hire positions. Don't miss out on a great opportunity to work with one of the premier brands in technology and the semiconductor industry today!\n\nRole & Responsibility\n\nCoordination of Electrical design work with other trades such as structure, architecture and other Electrical work (Electrical, ELV, Vertical transportation work etc. not limited to)\nLiaison with the local authority (where appropriate to the project) to ensure compliance with local codes\nDevelop work schedule with sub-contractors (or NSC) for shop drawings and CSD (combined shop drawing) submission and approval in time basis and keep monitoring sub-contractors' performance good.\nTroubleshooting of crashes between M&E systems and structure and architectural system.\nLead, manage, and mentor sub-contractor's engineers in the technical aspects of projects\nEnsure timeliness and cost-effectiveness on M&E works\nMonitor Sub-Contactors' daily and weekly progress performance (labor status, work area, work done etc.) and make report for reviewing and further planning\nManaging the project documentation which includes shop drawings\nAccountable for the delivery of the projects documentation to the high standards of the Client, within specified timeframes.\nWeekly project progress meeting with contractor to discuss schedule and status of outstanding issues\nHandling Client & Consultants regarding all the activities of project and ensuring timely approval of drawings\nUnderstanding & executing LEED relevant work at the site\nCoordinate each system contractors and managing Shop drawing and CSD(Combined service drawing) schedule\n\nQualifications\n\nDegree in Electrical related subject Engineering with more than 10 years of relevant experience\nCapability of coordination with MEP system\nFamiliar with various construction methods and materials, their characteristics, installation procedures and tolerances.\nStrong computer skills and familiarity with Auto-cad & BIM modeling.\nGood skill for official letter writing.\nSemi-Conductor facility experience preferred\nHaving knowledge of relevant local regulation and Global Standards\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect with Multi-Family Experience - Austin","company_name":"BRR Architecture","company_location":"Austin, TX 78704 \n(South Lamar-South Congress area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nInternship\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nEmployee assistance program\nGym membership\nShow 4 more benefits\nIndeed's salary guide\nNot provided by employer\n$68.5K - $86.8K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nSenior Architect with Multi-Family Experience\n\nPrefer 10 years’ minimum experience\n\nSenior Architect is responsible for a variety of assignments requiring skills in all aspects of architectural designs for projects of large size and high complexity. Responsible for all phases of architecture for multiple projects, while collaborating in a team environment. Coordinates with Project Manager to directly supervise the teams’ design and technical delivery. Mentors, teaches, and leads others.\n\nRESPONSIBILITIES\n\nLead complex projects or series of large projects.\nSet scope and budget; lead cost estimating and feasibility studies; manage bid process\nDeliver presentations to clients and develop design solutions; represent client's interests in public hearings and meetings.\nOversee production of construction documents, initiate and direct coordination with engineering disciplines, perform in-depth Quality Control and lead Construction Contract administration phase.\nAssume final responsibility for the technical quality and success of the project.\nMentor teammates, assist in the development of future architects.\n\nQUALIFICATIONS\n\nProfessional accredited degree in Architecture.\nLicensure required.\nMust have the capacity to understand and communicate complex issues that involve the functional and aesthetic areas of architecture.\nAbility to engage in creative and critical thought and able to graphically communicate concepts and ideas to others effectively.\nDesire to work in a team-oriented, fast paced environment.\nAdvanced skills in research, planning, design, CDs, Construction Contract Administration.\nExceptional problem-solving skills.\nDetail-oriented with a commitment to confidentiality and sensitivity of information.\nStrong communication and presentation skills.\nMust be able to work well with all levels of teammates.\nIntermediate to Advanced computer skills including Microsoft Suite.\nComputer software knowledge, skills in Revit and AutoCAD are preferred. Drive to research and utilize technology in architectural applications.\n\nPROFESSIONAL DEVELOPMENT\n\nReimbursement for NCARB-application fees, initial and annual architectural licensing\nSupport for participation in industry leadership and professional development programs\nInternal training seminars with multiple lunch n’ learn sessions\n\nBENEFITS & PERKS\n\nPaid time off and flexible work scheduling\n401(k) profit sharing plan, matching 50% of your contributions up to 4% of your salary\nMedical, dental and vision insurance, with access to 24/7 telemedicine consultation services\nLife and disability insurance\nEmployee Assistance Program\n8 hours of Community Caring paid time off\nCompany sponsored socials and recreational sports leagues\nFitness facility reimbursement\nSam’s Club membership\nFlexible 'Dress for Your Day' policy\n\nFull-time Exempt\nBRR Architecture is an equal opportunity employer, drug-free workplace, and complies with ADA regulations as applicable.\n\nJob Types: Full-time, Internship\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Designer","company_name":"Rios Inc","company_location":"Austin, TX 78704 \n(South Lamar-South Congress area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$66.3K - $83.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nDescription:\n\nWe are seeking an architectural designer to assist and develop appropriate design solutions on multiple projects. Interested applicants must have a strong design aesthetic, enjoy creating beautiful work and be able to work collaboratively and independently.\n\n\nThe ideal candidate must possess the following skills:\n\nStrong design skills and a passion for creativity\nStrong organizational skills\nA high degree of self-motivation, flexibility, and resourcefulness\nConstruction documents and specification experience\nContraction administration experience, as well as experience coordinating with a range of consultants including civil, electrical, and structural engineers\nAbility to skillfully work alongside internal and external customer\nStrong written and verbal communication and collaboration skills\nRequirements:\n\nMinimum Qualifications:\n\nA minimum of 5-8+ years of professional experience\nBachelor of Architecture degree or Master's of Architecture degree from an accredited college or university\nExperience with Autocad, Rhino, Photoshop, Illustrator, InDesign, and REVIT\nHand-drawing and residential experience preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architecture Studio Leader","company_name":"Stanley Consultants, Inc.","company_location":"Austin, TX 78731","salary_range":null,"days_ago_posted":"Posted\nPosted 20 days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$66.3K - $83.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nDescription:\n\nWe are seeking an architectural designer to assist and develop appropriate design solutions on multiple projects. Interested applicants must have a strong design aesthetic, enjoy creating beautiful work and be able to work collaboratively and independently.\n\n\nThe ideal candidate must possess the following skills:\n\nStrong design skills and a passion for creativity\nStrong organizational skills\nA high degree of self-motivation, flexibility, and resourcefulness\nConstruction documents and specification experience\nContraction administration experience, as well as experience coordinating with a range of consultants including civil, electrical, and structural engineers\nAbility to skillfully work alongside internal and external customer\nStrong written and verbal communication and collaboration skills\nRequirements:\n\nMinimum Qualifications:\n\nA minimum of 5-8+ years of professional experience\nBachelor of Architecture degree or Master's of Architecture degree from an accredited college or university\nExperience with Autocad, Rhino, Photoshop, Illustrator, InDesign, and REVIT\nHand-drawing and residential experience preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Associate Level Forensic Engineer/Architect","company_name":"YA Engineering Services, LLC","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 1 day ago","job_description":"Indeed's salary guide\nNot provided by employer\n$75.8K - $95.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nCompany Overview:\n\nYA Engineering Services (YAES) is a rapidly growing national multi-disciplinary forensic consulting firm that includes structural, mechanical, electrical, and geotechnical engineering services; architectural and building envelope investigative services; non-destructive testing services; seismic risk assessment services; materials analysis services; expert witness and litigation support services; and accident reconstruction services. YAES provides immediate response to new assignments, performs investigations in a timely manner, and provides comprehensive reports that are clear, concise, and backed by reasonable and sometimes complex analyses and recommendations. YAES offers a team of highly qualified, technically excellent engineering and architectural professionals who work seamlessly together to service the needs of our clients in the model of an engineering cooperative.\n\nSummary:\n\nSeeking Associate Level Professional Engineers or Architects excited to expand their knowledge of evaluating distress to existing buildings, structures and building envelopes. Associates will be responsible for assisting with investigative projects including coordinating with clients, performing site visits, managing resources, writing reports, conducting analyses, and reviewing building codes. This is a remote position based in the Austin, TX area.\n\nRole & Responsibilities:\n\nHelps coordinate with clients to set up site visits and complete deliverables.\nManages project resources and sets/meets deadlines to ensure that projects stay on schedule.\nAssists in the production of project reports that synthesize data collected from onsite inspections with environmental factors, material properties, and performance analysis to determine the most likely cause and scope of distress and failures to buildings and components.\nPerforms site visits to collect field data on residential, commercial and industrial properties.\nReviews and interprets relevant building codes as necessary for issues pertaining to the scope of work.\nAssists in the development of repair designs ensuring adequate coordination across disciplines.\nMakes independent decisions for projects including a selection of analysis and testing methods, repair materials (if necessary), and identifying and selecting resources relevant to the project.\nPerforms additional duties as assigned.\n\nQualifications:\n\nBachelor’s degree required.\nMaster’s degree preferred.\nLicensed Professional Engineer with a minimum of 3 years of experience.\nLicensed Architect with a minimum of 3 years of experience.\n\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Project Architect - Austin","company_name":"FGM Architects","company_location":"Hybrid remote in Austin, TX 78746","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$75.8K - $95.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nCompany Overview:\n\nYA Engineering Services (YAES) is a rapidly growing national multi-disciplinary forensic consulting firm that includes structural, mechanical, electrical, and geotechnical engineering services; architectural and building envelope investigative services; non-destructive testing services; seismic risk assessment services; materials analysis services; expert witness and litigation support services; and accident reconstruction services. YAES provides immediate response to new assignments, performs investigations in a timely manner, and provides comprehensive reports that are clear, concise, and backed by reasonable and sometimes complex analyses and recommendations. YAES offers a team of highly qualified, technically excellent engineering and architectural professionals who work seamlessly together to service the needs of our clients in the model of an engineering cooperative.\n\nSummary:\n\nSeeking Associate Level Professional Engineers or Architects excited to expand their knowledge of evaluating distress to existing buildings, structures and building envelopes. Associates will be responsible for assisting with investigative projects including coordinating with clients, performing site visits, managing resources, writing reports, conducting analyses, and reviewing building codes. This is a remote position based in the Austin, TX area.\n\nRole & Responsibilities:\n\nHelps coordinate with clients to set up site visits and complete deliverables.\nManages project resources and sets/meets deadlines to ensure that projects stay on schedule.\nAssists in the production of project reports that synthesize data collected from onsite inspections with environmental factors, material properties, and performance analysis to determine the most likely cause and scope of distress and failures to buildings and components.\nPerforms site visits to collect field data on residential, commercial and industrial properties.\nReviews and interprets relevant building codes as necessary for issues pertaining to the scope of work.\nAssists in the development of repair designs ensuring adequate coordination across disciplines.\nMakes independent decisions for projects including a selection of analysis and testing methods, repair materials (if necessary), and identifying and selecting resources relevant to the project.\nPerforms additional duties as assigned.\n\nQualifications:\n\nBachelor’s degree required.\nMaster’s degree preferred.\nLicensed Professional Engineer with a minimum of 3 years of experience.\nLicensed Architect with a minimum of 3 years of experience.\n\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Project Architect | Project Coordinator","company_name":"Kirksey Architecture","company_location":"Austin, TX 78721 \n(Martin Luther King-Hwy 183 area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$65.3K - $82.7K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nSummary\n\nKirksey is an architecture firm with a culture that values great design, environmental stewardship, diversity, and most of all, our employees.\n\nIn addition to great design, hard work, and having fun in the process, Kirksey values the personal and professional development of each employee by supporting individual initiatives and ambition. This empowerment, freedom, and entrepreneurial spirit supports long term careers at Kirksey.\n\nKirksey is looking for a dynamic, motivated Project Coordinator or Project Architect to join our Austin office.\n\n\n\n\nResponsibilities\n\nFull project team and document coordination, including specifications, all consultants and their documents.\nProject Team resource for technical guidance to resolve design issues while maintaining design intent.\nFacilitate open team communication with all levels of project team – Internal Team, Owners, Contractors, Consultants and Authorities Having Jurisdiction.\nCoordinate all Construction Administration processes.\nOther duties as assigned.\n\n\n\nQualifications\n\nProfessional degree in Architecture or related field\nThe ideal candidate will have 5-12 years of experience\nRevit experience is strongly preferred\nArchitectural license is preferred\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"Huckabee","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$67.5K - $85.4K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHuckabee is one of the fastest growing A/E firms in the nation and one of the top educational design firms. We are a mission-driven company that is dedicated to the success of all students. What we do matters, which is why we look for people who share our passion for changing the world through design and who want to create an impact of excellence on education. If you are ready to join our movement, reach out!\n\nCurrently, we are accepting resumes for a talented Architect with a minimum of 4 years experience working in the commercial architectural field to join our team. The position will offer the candidate opportunities to grow within the firm and thrive in an innovative, fast-paced, and highly collaborative environment developing well rounded skills. Educational facility experience is a plus. At Huckabee, an Architect will work under the direction of a Project Architect and is responsible for technical design development for a wide range of project sizes.\n\nRESPONSIBILITIES\n\nWork on project development in design phases\nMaintain project delivery schedule and communicate concerns with Project Team\nPrepare schematic and design development phase presentation materials\nDevelop construction documentation and specifications\nCreate develop and maintain BIM projects through all phases of project\nCoordinate with consultants utilizing BIM, 2D documentation, and specifications\nAssist the Project Architect in the preparation of request for pricing and review of shop drawings\nSite visits as necessary\n\nREQUIREMENTS\n\nProficient in Revit, Adobe Creative Suite, BIM 360, Bluebeam Revu, and Office 365\nExperience with Navisworks, and AutoDesk FormIt, preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Project Architect - Senior Living","company_name":"Ryan Companies US, Inc.","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nDisability insurance\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nShow 3 more benefits\nIndeed's salary guide\nNot provided by employer\n$76.9K - $97.4K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nCompany Info\n\nWith more than 80 years in business and 16 offices (and growing!), Ryan offers comprehensive commercial real estate solutions to customers across the US. We bring a collaborative, relationship-driven approach to delivering spaces where people thrive and businesses succeed. Join a company with an outstanding culture and competitive benefits. At Ryan, we don’t just build buildings – we build stories.\n\nLearn more about Ryan Architecture + Engineering here.\n\nJob Description\n\nRyan Companies is looking for an organized, innovative, collaborative and forward-thinking Senior Project Architect to join our team in Austin! The ideal candidate will be able to problem solve and design both as part of a collaborative team and perform work independently.\n\nRyan Companies uses a unique integrated delivery process that involves architecture, engineering, construction, development, real estate management and capital markets. Ryan’s integrated process requires an individual to be able to work in a proactive and positive manner in tandem with local teams and cross regionally within a national design practice.\n\nSome things you can expect to do:\n\nLead design documentation efforts throughout the design and construction phases of multiple projects\nAttend project interviews and participate in business development\nIndependently solve problems and applies basic principles of design\nProvide guidance on unusual or complex technical issues\nResearch and lead code reviews and regulatory approval process\nCreate complete and thorough set of design documents to meet project goals, milestones and schedule\nManage and coordinate Ryan’s QA/QC process and project specifications\nClearly communicate deviations in project scope\nPerform tasks with a high level of collaboration and set an example for others to follow\n\nTo be successful in this role, you must have a Professional Architecture degree; Bachelor or Master of Architecture. You must be a licensed Architect with relevant work experience and a strong knowledge of Revit, building codes, documentation and constructability.\n\nYou will really stand out if you:\n\nHave experience working in Bluebeam\nAre LEED AP Certified and/or WELL AP Certified\n\nEligibility\n\nPositions require verification of employment eligibility to work in the U.S.\n\nMust be authorized to work in the U.S.\n\nCertain positions and locations require Covid-19 vaccination, subject to reasonable accommodations for valid medical or sincerely held religious reasons.\n\nBenefits\n\nCompetitive Salary\n\nMedical, Dental and Vision Benefits\n\nRetirement and Savings Benefits\n\nFlexible Spending Accounts\n\nLife Insurance\n\nEducational Assistance\n\nPaid Time Off (PTO)\n\nParenting Benefits\n\nLong-term Disability\n\nRyan Foundation – charitable matching funds\n\nPaid Time for Volunteer Events\n\n\n\n\nRyan Companies US, Inc. is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\n\nTo view the Equal Employment Opportunity is the Law posters and the supplement, as well as the Pay Transparency Policy Statement, CLICK HERE.\n\nTo view an EEO is the Law Poster that is optimized for screen readers, CLICK HERE.\n\n\n\n\nRyan does not accept recruiting agency solicitations.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect - Mission Critical","company_name":"Jacobs","company_location":"Austin, TX 73344","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$94.7K - $120K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\nAt Jacobs, we’re transforming intangible ideas into innovative solutions designing the future – today. If you are someone who thrives in a fast-paced, collaborative work environment and who also enjoys working closely with clients in the Mission Critical market, this opportunity is for you!\n\nWe’re seeking a Senior Architect to join our growing team in Philadelphia. When you join us you’ll have the opportunity to communicate with client/user groups to understand project requirements; prepare client presentations, illustrative design studies and reports. In this role you will contribute to client relationship development, project proposal preparation and interviews.\n\nIn this role, you’ll lead and document early project phases including master planning and conceptual development as well as, prepare drawing and technical specification documentation for schematic through detailed design phases.\n\nAs a Senior Architect you will adhere to project schedules, scope of services and budgets through thorough coordination with in-house disciplines and external consultants, achieving comprehensive, integrated mission critical project delivery.\n\nYou will use your expertise to reviews submittals, address contractor requests for information and conduct periodic on-site visits during project construction phase. Additionally, we’ll ask you to prepare quantitative data to support cost estimates.\n\nPeriodic travel to project sites during design and construction phases will be required.\n\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other.\n\n\nHere’s What You’ll Need:\n\nSubstantial experience in mission critical facility design, including IT, microelectronics or other data driven technology companies as well as academic, governmental, or independent institutions.\nMission critical client relationship and project experience should include working directly with clients’ senior management representatives, managers, technicians, and other stakeholders in determining, developing, and documenting criteria and requirements.\nStrong communication, design and problem-solving skills.\nBachelor of Architecture degree from accredited architecture program (Masters of Architecture preferred).\nLicensed architect with active registration in at least one US state.\nProficiency in Revit, AutoCAD, SketchUp, Bluebeam Revue, word processing and spreadsheet software applications.\nAdvanced knowledge and experience in mission critical design process, construction documentation and administration, materials and methods of construction, model building, life safety and accessibility codes.\nAdvanced understanding of structural, mechanical, and electrical systems and their interrelationships.\nExperience supervising the work of other design professionals.\nAble to effectively balance multiple priorities.\nAble to communicate with all levels of project and program management\nSelf-driven time management skills; able to work independently and collaboratively; focused on total project success.\n\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Designer","company_name":"VLKArchitects","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$64.7K - $82K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nProject Designer (Austin)\nAustin\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Design Architect for our Education and Commercial market sectors due to the high growth and expansion we are experiencing. This position will lead the design process of a project, from preliminary planning through design development. They will work alongside the project team to oversee the implementation of the design throughout the construction document and construction administration phase to ensure the design intent is met. The ideal candidate for this position should be well-versed in all phases of design of K-12 schools, higher education, mixed-use developments, and corporate environments. This position will require creativity and strong organizational skills to find innovative solutions that exceed client expectations.\n\nRESPONSIBILITIES\n\nCoordinates design efforts during all phases of a project including bond planning, master planning, programming, schematic design, design development, construction documents, specifications, and construction administration.\nDevelops presentation strategies.\nCommunicates design ideas through hand sketching, 3D computer renderings, and verbal presentation skills.\nCoordinates with consultants, contractors, fabricators, specification writers, and design team members.\nMust work well in a collaborative environment and be able to respond to design needs from multiple project Architects, Directors, and firm Principals.\nServes in a mentoring role for emerging professionals.\nParticipates in interview presentations, trade show conventions and general marketing efforts.\nAbility to manage the design process of several concurrent projects.\n\nREQUIREMENTS\n\nAcademic/Professional:\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect or pursuing licensure\n\nCompetencies:\n\nDocumented experience leading and mentoring project teams.\nSelf-motivated, team player with excellent verbal and graphic communication skills\nAdept organization skills\nAbility to work well under pressure and just work accordingly to meet quick deadlines\nKnowledge of current educational trends and how school facilities can respond to them\nKnowledge of building codes\n\nPhysical Requirements:\n\n\n\nWhile performing this job, the employee is regularly required to talk or hear\nThe employee frequently is required to sit or stand for long periods of time; walk; use hands to finger, handle or feel; and reach with hands or arms\nThe employee will occasionally climb ladders to review conditions at job site and occasionally lift up to 25 lbs\n\nExperience:\n\nMinimum of 8 years of experience working in an Architecture firm and at least 3 years leading projects\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with Revit preferred\nRelevant experience with architectural modeling and graphic software, including but not limited to Enscape, 3DS Max, AutoCAD, Adobe Photoshop & InDesign, Bluebeam, and MS Office\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to Charles Johnson cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"Amplify Recruiting","company_location":"Austin, TX 78703","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$64.7K - $82K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nProject Designer (Austin)\nAustin\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Design Architect for our Education and Commercial market sectors due to the high growth and expansion we are experiencing. This position will lead the design process of a project, from preliminary planning through design development. They will work alongside the project team to oversee the implementation of the design throughout the construction document and construction administration phase to ensure the design intent is met. The ideal candidate for this position should be well-versed in all phases of design of K-12 schools, higher education, mixed-use developments, and corporate environments. This position will require creativity and strong organizational skills to find innovative solutions that exceed client expectations.\n\nRESPONSIBILITIES\n\nCoordinates design efforts during all phases of a project including bond planning, master planning, programming, schematic design, design development, construction documents, specifications, and construction administration.\nDevelops presentation strategies.\nCommunicates design ideas through hand sketching, 3D computer renderings, and verbal presentation skills.\nCoordinates with consultants, contractors, fabricators, specification writers, and design team members.\nMust work well in a collaborative environment and be able to respond to design needs from multiple project Architects, Directors, and firm Principals.\nServes in a mentoring role for emerging professionals.\nParticipates in interview presentations, trade show conventions and general marketing efforts.\nAbility to manage the design process of several concurrent projects.\n\nREQUIREMENTS\n\nAcademic/Professional:\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect or pursuing licensure\n\nCompetencies:\n\nDocumented experience leading and mentoring project teams.\nSelf-motivated, team player with excellent verbal and graphic communication skills\nAdept organization skills\nAbility to work well under pressure and just work accordingly to meet quick deadlines\nKnowledge of current educational trends and how school facilities can respond to them\nKnowledge of building codes\n\nPhysical Requirements:\n\n\n\nWhile performing this job, the employee is regularly required to talk or hear\nThe employee frequently is required to sit or stand for long periods of time; walk; use hands to finger, handle or feel; and reach with hands or arms\nThe employee will occasionally climb ladders to review conditions at job site and occasionally lift up to 25 lbs\n\nExperience:\n\nMinimum of 8 years of experience working in an Architecture firm and at least 3 years leading projects\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with Revit preferred\nRelevant experience with architectural modeling and graphic software, including but not limited to Enscape, 3DS Max, AutoCAD, Adobe Photoshop & InDesign, Bluebeam, and MS Office\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to Charles Johnson cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect - Workplace Interiors - Senior","company_name":"Gensler","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$96.4K - $122K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nYour Role\nAt Gensler we help companies innovate. We design spaces, services and environments for organizations seeking new ways to provide value by fostering healthier, more effective workplaces. As a result of a growing diverse client base and increasing project work, we are searching for a Senior Level Project Architect (10+ years) with a focus on interior architecture to join our team in Austin. In this role, you will provide design support for completion/execution of design concepts, prepare schematic and design development drawings, resolve design issues, analyze design options, and execute projects through construction administration. You must have prior experience working directly with contractors. The individual will be working with the team to complete assignments on schedule and with great quality to meet our clients’ expectations. You will be expected to resolve technical/design issues to maintain progress and quality control and to communicate between the project team and consultants. You will be responsible to meet building codes, budgets, and all necessary deadlines in order to fully meet client expectations.\n\nWhat You Will Do\nManage multiple aspects of client, project coordination, and general contractors including full documentation coordination with structural, MEP, lighting, AV, landscape, and civil consultants\nManage client relationships and team communication\nResolve complex technical and design issues\nMaintain the project manual and specifications\nConduct on-site observations and document site reviews\nProcess submittals, RFIs, substitution requests, etc. during construction\nInterface with building and permitting officials during the permitting and construction phases of the project\nMentor and grow junior staff members\nParticipate in office culture and initiatives\nYour Qualifications\nBachelor’s degree in Architecture\n10+ years of relevant experience as a project architect with a strong background in corporate interiors, including LEED-certified projects\nLicensed or registered Architect\nExperience managing multiple aspects of client, team, and project coordination, including full documentation coordination with structural, MEP, lighting, AV, landscape, and civil consultants\nExperience working directly with contractors\nExperience resolving complex technical and design issues\nProficiency with Revit, SketchUp, 3ds Max, and Adobe Creative Suite\nUnderstanding of how buildings are constructed and ability to create technical documents that succinctly, thoroughly, and accurately describe the work to be done\nKnowledge of building codes, standards and building structures\nUnderstanding of sustainable and universal design concepts\nStrong leadership, organizational, communication and relationship management skills\nDemonstrated commitment to sustainability and sustainable building practices required.\nAll applications must include a portfolio for full consideration.\nThis is not a remote position. The successful candidate will be expected to live in or relocate to the Austin area upon acceptance.\nLife at Gensler\nAt Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests. We encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities. As part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Designer II - Industrial","company_name":"Ryan Companies US, Inc.","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 23 days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nDisability insurance\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nShow 3 more benefits\nCompany Info\n\nWith more than 80 years in business and 16 offices (and growing!), Ryan offers comprehensive commercial real estate solutions to customers across the US. We bring a collaborative, relationship-driven approach to delivering spaces where people thrive and businesses succeed. Join a company with an outstanding culture and competitive benefits. At Ryan, we don’t just build buildings – we build stories.\n\nLearn more about Ryan Architecture + Engineering here.\n\nJob Description\n\nRyan Companies is looking for an organized, innovative, collaborative and forward-thinking Designer II to join our Industrial team! The ideal candidate will be able to problem solve and design both as part of a collaborative team and perform work independently. Candidates with approximately 3-5 years of experience are most likely to be successful. Ryan Companies uses a unique integrated delivery process that involves architecture, engineering, construction, development, real estate management and capital markets. Ryan’s integrated process requires an individual to be able to work in a proactive and positive manner in tandem with local teams and cross regionally within a national design practice.\n\nSome things you can expect to do:\n\nWork in tandem with Client, Project Architect, Design Project Manager, Designers, Development, Construction and Consultants to develop documentation for coordination and construction\nParticipate in design meetings, consultant meetings and project team meetings.\nIndependently solve problems.\nSeek guidance on unusual or complex technical issues.\nAssist in code reviews and regulatory approval process.\nCreate complete and thorough set of design documents to meet project goals, milestones and schedule.\nAssist with Ryan’s QA/QC process and project specifications.\nClearly communicate deviations in project scope.\nPerform tasks with a high level of collaboration and set an example for others to follow.\nContribute to Ryan culture through participation in office activities, initiatives and learning programs.\n\nTo be successful in this role, you must have a Professional Architecture degree; Bachelor or Master of Architecture.\n\nYou will really stand out if you:\n\nHave a strong knowledge of Revit.\nAre working through your Architectural licensure process.\nHave experience working in Bluebeam.\nAre LEED AP Certified and/or WELL AP Certified.\nHave the knowledge and willingness to learn building codes, documentation and constructability.\n\nEligibility\n\nPositions require verification of employment eligibility to work in the U.S.\n\nMust be authorized to work in the U.S.\n\nCertain positions and locations require Covid-19 vaccination, subject to reasonable accommodations for valid medical or sincerely held religious reasons.\n\nBenefits\n\nCompetitive Salary\n\nMedical, Dental and Vision Benefits\n\nRetirement and Savings Benefits\n\nFlexible Spending Accounts\n\nLife Insurance\n\nEducational Assistance\n\nPaid Time Off (PTO)\n\nParenting Benefits\n\nLong-term Disability\n\nRyan Foundation – charitable matching funds\n\nPaid Time for Volunteer Events\n\nEEO Policy and Reasonable Accommodation Notice\n\nRyan Companies US, Inc. is an equal opportunity and affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.\n\nTo view the Equal Employment Opportunity is the Law posters and the supplement, as well as the Pay Transparency Policy Statement, CLICK HERE.\n\nTo view an EEO is the Law Poster that is optimized for screen readers, CLICK HERE.\n\n\n\n\nIf we can help accommodate a disability during any portion of the application or hiring process, please email humanresources@ryancompanies.com. Reasonable accommodations will be determined on a case-by-case basis. Please note: Our accommodation specialist is unable to provide application status updates.\n\n\n\n\nRyan does not accept recruiting agency solicitations.\n\nHiring Insights\nJob activity\nPosted 23 days ago"},{"job_title":"Architects and Designers in Austin","company_name":"Lake|Flato Architects","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$80K - $101K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nLake|Flato Architects is seeking forward-thinking, energetic Architects & Designers to join our award-\nwinning sustainable design practice in Austin.\n\nIdeal candidates will exhibit a commitment to excellence in architectural design and craft and should have a\nminimum of three years of experience working collaboratively with creative teams.\n\nRequired Qualifications:\n\n3-7 years of relevant work experience\nProfessional degree in Architecture\nDesign and Technical detailing experience\nRevit, CADD drafting, modeling and rendering\nincluding SketchUp experience\n\nExcellent oral, written and graphic\ncommunication skills\n\nDigital graphic skills, including familiarity with\nsoftware such as Adobe Creative Suite\n\nAbility to sketch and draw by hand\nInterest in sustainable design and the craft of\nconstruction and contextual design\n\nHighly motivated and able to work both self-directed\n\nand in interdisciplinary teams in a fast paced and\nenergetic environment\n\nPreferred Qualifications:\n\nLEED Accreditation\nProfessional Registration\n\nApplication:\nPlease send a digital copy of your resume and an expanded\nedition of your portfolio in .pdf or .jpg format via e-mail\nwith the subject line “Architect/Designer - Austin Studio” to\nemployment@lakeflato.com\n\nPlease visit our website at\ninformation on our firm, our culture and our people.\nUpon receipt, we will review and contact you should your\nqualifications meet our staffing needs.\nNo phone calls, please.\n\n\n\n\nHotel Magdalena\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Coordinator - Architect","company_name":"Marx Okubo","company_location":"Austin, TX 73301 \n(St Edwards area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nContinuing education credits\nEmployee stock ownership plan\nTuition reimbursement\nIndeed's salary guide\nNot provided by employer\n$54.1K - $68.5K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nPROJECT COORDINATOR and SENIOR PROJECT COORDINATOR\n\n(ARCHITECT)\n\nMeet Marx|Okubo.\n\nAre you someone that has insatiable curiosity, always digging deeper to understand or innovate? Do you thrive when collaborating with others?\n\nFounded in 1982, Marx|Okubo is an employee-owned architecture, engineering and construction consulting firm with nine offices across the country. We work with real estate owners, investors and lenders—at every point of the property lifecycle—to evaluate their building projects, solve complex challenges and implement tailored solutions. We help clients understand their projects’ complexities so they can make more informed decisions and, ultimately, mitigate their risk.\n\nBecause of our need to uncover details with a 360-view, as well as continually evolve and hold ourselves—and the industry—to a higher standard, we have earned a reputation as “the gold standard” in what we do.\n\nHere at Marx|Okubo, we are a team of collaborative, bright and seasoned architects, engineers, construction and real estate professionals, with projects nationwide. We have broad technical expertise, yet deep local knowledge. We value collaboration, and we never stop learning. We truly value our different backgrounds and what each individual brings to the team. We genuinely care about and get to know our clients. And we care about balance—we are family-focused and work hard and play hard. As for loyalty, it is never lost on us and gets rewarded in many ways.\n\nWhat’s more? Our benefits happen to be some of the most progressive and competitive you will find in the industry. Here are a few highlights: Vested in you: As we are an ESOP, each employee owns a portion of the company.\n\nPlanning for your future: We have a 30% match on 401(k) contributions.\nStaying healthy: We contribute 100% of employee health premiums.\nCommitment to your growth: We want to see our employees grow—when new positions arise, existing employees are considered first.\nSupporting education: We encourage continuing education and provide education/licensure/ tuition benefits.\n\nPosition description\n\nCandidates for this position are generally recent graduates or architects (or engineers)-in-training who are seeking practical, hands-on experience in architecture, project management and/or construction. Working under the guidance of professional architects, project coordinators will:\n\nAssist in the review and evaluation of existing buildings and new construction.\nPerform field observations for project condition assessment surveys, construction loan monitoring and new construction.\nPerform plan reviews for general code compliance and adequacy of construction, including coordination, detailing, and building materials and systems.\nPrepare cost evaluations of new and existing construction.\nPerform existing building replacement cost evaluations.\nAssist in architectural/engineering repair documents for existing buildings.\n\nOur work covers most commercial building types, including office, retail, industrial, hotel/hospitality and multifamily.\n\nDesired skills and experience\n\nBachelor’s or master’s degree in architecture, or background in construction or related fields.\nMinimum 2-3 years of experience at an architecture or construction company.\nFor architectural candidates—in progress on AXP requirements and/or taking ARE exams.\nProficient in Microsoft Office, particularly Word and Excel.\nProficient in AutoCAD, Bluebeam, Plan Grid and Box; knowledge of Photoshop, Illustrator and Sketchup a plus, but not required.\nGeneral understanding of building materials and methods.\nGeneral understanding of state and federal codes as it applies to construction and design.\nStrong organizational skills.\nAbility to manage and delegate a multitude of tasks, assignments and changing priorities efficiently.\nStrong verbal and written communication skills.\n\n\nCompensation will be commensurate with qualifications and experience. The ability to travel out of town is a requirement for the position.\n\nMarx|Okubo is an equal employment opportunity employer. The Company’s policy is not to unlawfully discriminate against any applicant or employee on the basis of race, color, sex, sexual orientation, gender identity, religion, national origin, age, military status, disability, genetic information or any other consideration made unlawful by applicable federal, state, or local laws. The Company also prohibits harassment of applicants and employees based on any of these protected categories. It is also Marx|Okubo’s policy to comply with all applicable state and federal laws respecting consideration of unemployment status in making hiring decisions.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager - K-12","company_name":"Perkins+Will","company_location":"Austin, TX 78702 \n(Rosewood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$105K - $134K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nThe Austin Studio is seeking a dynamic Project Manager for our Education (K-12) team!\n\nAs a Project Manager on the Austin Perkins&Will team, you will:\n\nAssist in preparation of drawings for schematic design, design development, and contract documents\nFunction as the primary contact for all communication between the client and Perkins&Will, ensuring timely resolution of client concerns and management of business issues including contracts and additional services.\nAssist with or have direct responsibility for design, translating client requirements to design criteria from conceptual design through installation\nManage the project team, keeping everyone on task and on time\nParticipate in marketing efforts and may lead presentations to prospective clients\nCoordinate contractors, consultants, and vendor assignments\nDirect, organize, and mentor junior staff with responsibility for oversight\nBe responsible for the complete integration of design and technical aspects of the project and for the clear and timely communication of information to the project team and compliance with the project team’s goals\nWork hard, play hard, and learn a lot along the way!\n\nTo join us, you should have:\n\nA professional degree in Architecture, or related discipline\n10+ years of experience, including experience in education projects\nPMP designation preferred\nProficiency in 3D modeling, visualization, and graphic software; Revit strongly preferred\nAdvanced knowledge of project design process, construction documentation & administration\nMust have the ability to maintain existing client relationship and build new ones\nExperience negotiating and managing project scope and fees as well as risk management and financial accountability\nStrong leadership, organization, and communication skills.\nAbility to direct and coordinate work efforts of junior staff\nEffective verbal and written communication skills\nProblem solving skills, attention to detail, and motivation to learn\nCollaborative and professional work ethic\nLEED AP or within 6 months of hire\nLicensure preferred\n\nQualified and interested candidates should submit a resume and work samples. Include your resume and a compact, representative sample of your work (no larger than 4MB).\n\nAt Perkins&Will we believe that inclusion spurs creativity, and that innovation is born from an engaged culture of diverse people and ideas. By moving beyond barriers and stereotypes of gender, race, color, religion, national origin, ancestry, age, medical condition, disability, sexual orientation, gender identity, veteran status; we are committed to building an organization that reflects the diversity of the communities and clients we serve.\n\n\n\n\nQualifications\n\nEducation\n\nRequired\n\nBachelor or better in Architecture.\n\nLicenses & Certifications\n\nRequired\n\nLicensed Architect\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager – Multi-Family | Architecture","company_name":"STG Design","company_location":"Austin, TX 78703 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$77.5K - $98.2K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nLET’S DO THIS…\n\nYou’re a proven leader several years into your career and are looking for a more challenging opportunity. You’re dedicated to delivering projects on time and budget and are hungry for some exciting complex projects to manage. You have a lot to teach and are looking for a group eager to learn. You’ve come to the right place; at STG, we can make that happen.\n\nWHAT WE NEED…\n\nOur multi-family studio in Austin and Houston are seeking an experienced Project Manager to take on full responsibility for project profitability, schedule, and budget. We need a well-rounded Project Manager with a keen ability to manage client interactions and expectations, to oversee the projection of workload and flow and all consultant coordination, and to provide critical problem-solving for both the technical and design facets of each project. In short, we want a Project Manager as remarkable as we are. We want someone who understands how to plan a project and keep the client happy. We want a PM who attacks each new challenge with the knowledge that last week’s answer doesn’t fit this week’s question; a true project team leader who is always seeking to learn more and apply what they’ve learned to make those around them better.\n\nThis is exactly the stuff that gets to the heart of our legacy. Built on hard work and pure passion, STG has a 40+ year history of delivering award-winning commercial architecture and interior design. We’re building on that for the future, too.\n\nWHAT YOU’LL DO…\n\nThe only thing routine about us is that we are constantly unleashing innovation. Our routine is that there is no routine. On any given day you will (among other things)… One of our favorite things about this profession is the variety. Our routine is that there is no routine. On any given day you may (among other things):\n\nServe as a primary client liaison responsible to complete projects to satisfy the client’s goals.\n\nCollaborate on ideas for multifamily architectural amenities to help our clients stand out.\n\nManage work plans, schedules, programs, communication, and project team assignments.\n\nEstimate fees, determine scope of work, and prepares proposals and contracts.\n\nAssist staff in development of industry knowledge and architectural skills.\n\nIssue and record Change of Service Agreements in a timely manner.\n\nResearch, establish and adhere to city/county agency requirements.\n\nOversee and assure contract document submittals for agency review.\n\nDirect the preparation and issuance of bid documents.\n\nOversee construction contract administration and attend construction meetings as needed.\n\nWHAT YOU NEED TO HAVE…\n\nRegistered Architect (preferred).\n\nBachelor's degree in Architecture from a 5-year accredited school/program.\n\n8+ years of professional experience, inclusive of at least 2 years of project management experience with multifamily buildings.\n\nWorking knowledge of REVIT.\n\nComprehensive knowledge of architectural principles/practices.\n\nExperience leading complex projects and multi project accounts.\n\nStrong leadership, organization, communication, and interpersonal management skills.\n\nCommitment to a collaborative design process.\n\nExperience negotiating project scope and fees.\n\nKnowledge of local building codes and standards.\n\nWHAT WE EXPECT…\n\nAfter 40+ years, we know ourselves pretty well; we know what we expect and what lets people thrive at STG. We value people who are:\n\nInteresting – We want people that can provide unique insight into our clients’ problems and contribute to their solutions in unexpected ways.\nGreat communicators – if you can’t spread your message, you can’t deliver results.\nSelf-starters – We want people who don’t wait for direction; they find the next task and get started.\nReady learners – We want people who are excited to add another tool to their repertoire.\nAdaptable – We look for people who find the right context and right solution for the task at hand.\nTech savvy – REVIT, Adobe CC, Bluebeam are all musts.\n\nWHAT’S NEXT\n\nIf you’re excited, we’re excited! Please click the APPLY button below. We’ll be in touch soon with next steps. Our process usually encompasses a couple rounds of interviews and an opportunity to chat informally with a group of potential peers.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect | Commercial","company_name":"Corgan","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$77.5K - $98.2K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nLET’S DO THIS…\n\nYou’re a proven leader several years into your career and are looking for a more challenging opportunity. You’re dedicated to delivering projects on time and budget and are hungry for some exciting complex projects to manage. You have a lot to teach and are looking for a group eager to learn. You’ve come to the right place; at STG, we can make that happen.\n\nWHAT WE NEED…\n\nOur multi-family studio in Austin and Houston are seeking an experienced Project Manager to take on full responsibility for project profitability, schedule, and budget. We need a well-rounded Project Manager with a keen ability to manage client interactions and expectations, to oversee the projection of workload and flow and all consultant coordination, and to provide critical problem-solving for both the technical and design facets of each project. In short, we want a Project Manager as remarkable as we are. We want someone who understands how to plan a project and keep the client happy. We want a PM who attacks each new challenge with the knowledge that last week’s answer doesn’t fit this week’s question; a true project team leader who is always seeking to learn more and apply what they’ve learned to make those around them better.\n\nThis is exactly the stuff that gets to the heart of our legacy. Built on hard work and pure passion, STG has a 40+ year history of delivering award-winning commercial architecture and interior design. We’re building on that for the future, too.\n\nWHAT YOU’LL DO…\n\nThe only thing routine about us is that we are constantly unleashing innovation. Our routine is that there is no routine. On any given day you will (among other things)… One of our favorite things about this profession is the variety. Our routine is that there is no routine. On any given day you may (among other things):\n\nServe as a primary client liaison responsible to complete projects to satisfy the client’s goals.\n\nCollaborate on ideas for multifamily architectural amenities to help our clients stand out.\n\nManage work plans, schedules, programs, communication, and project team assignments.\n\nEstimate fees, determine scope of work, and prepares proposals and contracts.\n\nAssist staff in development of industry knowledge and architectural skills.\n\nIssue and record Change of Service Agreements in a timely manner.\n\nResearch, establish and adhere to city/county agency requirements.\n\nOversee and assure contract document submittals for agency review.\n\nDirect the preparation and issuance of bid documents.\n\nOversee construction contract administration and attend construction meetings as needed.\n\nWHAT YOU NEED TO HAVE…\n\nRegistered Architect (preferred).\n\nBachelor's degree in Architecture from a 5-year accredited school/program.\n\n8+ years of professional experience, inclusive of at least 2 years of project management experience with multifamily buildings.\n\nWorking knowledge of REVIT.\n\nComprehensive knowledge of architectural principles/practices.\n\nExperience leading complex projects and multi project accounts.\n\nStrong leadership, organization, communication, and interpersonal management skills.\n\nCommitment to a collaborative design process.\n\nExperience negotiating project scope and fees.\n\nKnowledge of local building codes and standards.\n\nWHAT WE EXPECT…\n\nAfter 40+ years, we know ourselves pretty well; we know what we expect and what lets people thrive at STG. We value people who are:\n\nInteresting – We want people that can provide unique insight into our clients’ problems and contribute to their solutions in unexpected ways.\nGreat communicators – if you can’t spread your message, you can’t deliver results.\nSelf-starters – We want people who don’t wait for direction; they find the next task and get started.\nReady learners – We want people who are excited to add another tool to their repertoire.\nAdaptable – We look for people who find the right context and right solution for the task at hand.\nTech savvy – REVIT, Adobe CC, Bluebeam are all musts.\n\nWHAT’S NEXT\n\nIf you’re excited, we’re excited! Please click the APPLY button below. We’ll be in touch soon with next steps. Our process usually encompasses a couple rounds of interviews and an opportunity to chat informally with a group of potential peers.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Refrigeration Engineer or Designer","company_name":"Cushing Terrell","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nContinuing education credits\nDental insurance\nDisability insurance\nFlexible schedule\nShow 8 more benefits\nIndeed's salary guide\nNot provided by employer\n$62.4K - $79K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nHello. We are Cushing Terrell.\n\nCushing Terrell is a global design firm that is mission- and vision- driven in ways that make us passionate about people, environments, and ingenuity. Our culture has grown from our client-focus that was instilled by our founders, Cushing and Terrell, in 1938, and our team continues to thrive on the energy inspired by collaboration.\n\nAs a fully integrated firm, offering a balance of architecture and the full spectrum of engineering services, our firm commands unique resources to support our on-going drive to be an acknowledged pioneer at the forefront of engineering, architecture, planning, and design across the country – ranking within the top of ENR’s best AE firms.\n\nAt Cushing Terrell, we empower our people to be creative pioneers. Our business is built around integrity, design ingenuity, and growth – to shape a new world and to discover imaginative, responsible, and exceptional environments.\n\nAs we seek to invent a better way of living, we collectively put the thought of all that inspires us into all that we create. Cushing Terrell’s design celebrates the harmony and spirit that is born of the unity & growth, of our individuality, and our shared passions.\n\nReady to design with us?\n\nIf you are a creative Mechanical Engineer who believes that environments can be reimagined through inventive engineering and are looking to surround yourself with a team dedicated to designing for the future, you’ve found your home.\n\nAs one of Cushing Terrell’s Mechanical Engineers, you will work on Environments that push the boundaries of cutting-edge design as well as see great opportunities for leadership and career growth that will emerge with building and leading an integrated team in your regional office. You will be a member of a collaborative team of talented designers, engineers, and business professionals across our 14 offices located throughout the United States, to achieve integrated, forward-thinking, and award-winning design solutions.\n\nWhat a leader like you will bring to the table:\n\nProfessional Licensure preferred but not required\nAt least 2 years of design experience with emphasis on refrigeration.\nThe drive and ability to develop new business opportunities within the local market\nA high comfort-level with leadership and collaboration in all aspects of integrated design\nA passion for client-focused design\nA talent for balancing graceful communication between Cushing Terrell teams and our clients\n\nAs a Refrigeration Engineer at Cushing Terrell…\n\nHas system knowledge of multiple refrigeration systems and is proficient with commercial layouts of refrigeration equipment, and hydronic heat of rejection piping systems\nIs capable of driving the development of refrigeration design from initial concept through construction drawings\nCan develop proposals, project estimates and design systems within budgetary constraints\nPerforms and/or reviews load calculations, equipment selections, and refrigeration piping design\nPossesses strong knowledge of refrigeration rack control systems and has experience writing sequence of operations\nKnowledgeable about Thermodynamics, experience with alternative refrigerants like CO2 as well as standard refrigerants, and has an in-depth knowledge of applicable mechanical codes applying to refrigeration systems such as cases\nExpertise with fluid coolers, compressors, condensers, and refrigerated fixtures\nExperience designing cutting edge systems utilizing energy efficient solutions\nDevelops project specifications\nTakes on construction administration duties, including submittal review, field inspections, RFIs, and change requests, when needed\nPassionate about LEED AP, BD+C or ability to design and support documentation of LEED projects\nProficiency in a variety of software applications to include: Revit, AutoCAD, and Microsoft Office\n\n\nWhy Cushing Terrell?\n\nBecause we know that where you work matters. While the world has put a pause on what office culture is, and as our culture evolves into remote collaboration, our teams are still filled with people who take care of each other, our clients, and are committed to the Cushing Terrell culture: we work hard, we have fun, we love new ideas and new ways of doing things, and we encourage our team members to set big goals.\n\n\nProfessional and personal growth are equally important to us; we offer educational and advancement opportunities and are committed to the continuing education and mentorship of all our team members.\n\n\nThis position also offers excellent pay and a complete benefits package including:\n\nProfit Sharing Bonuses\nMedical/dental/vision/life/disability insurance plan with an HSA\nFSA dependent care options\n401(k) retirement plan with employer match\nHoliday and Paid Time Off\nFlexible Schedules\nWellness Program\n\nFlexible Work Environments\n\nCushing Terrell’s Work Smart Program is a flexible work arrangement designed to acknowledge and embrace flexibility in our work environments and preferences. Team members here get to choose if they would like to work remotely, a hybrid schedule, or 100% in the office. This program enables you, as a Cushing Terrell team member, to select a work situation that suits you best, while at the same time providing uncompromised—and always exceptional—service to our clients, partners, and colleagues.\n\n\nEquity:\n\nCushing Terrell is an Equal Opportunity Employer, All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Applicants must be currently authorized to work in the United States on a full-time basis.\n\nIf you need assistance or an accommodation while seeking employment with us, please call 406.248.7455. We will make a determination on your request for reasonable accommodation on a case-by-case basis. If you are having difficulty applying through an external website, please visit www.cushingterrell.com/joinus/.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager IV","company_name":"Health & Human Services Comm","company_location":"Austin, TX 78751 \n(Heritage area)","salary_range":"$5,785 - $7,500 a month","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$5,785 - $7,500 a month\nJob Type\nFull-time\nFull Job Description\n\nProject Manager IV\nProject Manager IV provides senior level construction/large maintenance project management duties involving the project initiation, planning, coordination, and execution of the project related to repairs and renovations for the State Hospitals and State Supported Living Centers.\nThe Project Manager IV communicates with the engineers, architects, contractors and their sub-contractors, agency management, facility personnel and other relevant parties on a regular basis to ensure projects are completed timely and within budget. The Project Manager IV is responsible for the review and inspection of construction work, identifying construction issues, evaluating unforeseen conditions, initiating change orders, managing timely payment to the contractors, and completing the related construction documentation through the life cycle of the project. The Project Manager IV directs and supervises the work of design architects and engineers on assigned projects and oversees the construction based on regular site visits and ensures contract compliance. The Project Manager IV works under the supervision of Sr. Director/Director of Construction Services with considerable latitude for the use of initiative and independent judgement. The Project Manager IV may supervise the work of other staff members in the department and help with other duties as assigned by the Department Leadership.\n\n\n\n\n\nEssential Job Functions:\n1. Attends work on a regular and predictable schedule in accordance with agency leave policy and performs other duties as assigned.\n2. Manage and direct services performed by the professional services providers and construction contracts.\n3. Oversees administration of construction contract and manage project budget and timeline to ensure the completion with contract timeline and budget.\n4. Inspects construction to ensure compliance with design documents and applicable codes.\n5. Reviews design documents for best managed design practices, conformance with facility needs and requirements, applicable codes, and technical correctness.\n6. Directs, develops, and evaluates projects using acceptable project methodologies.\n7. Initiates multi-agency or enterprise level capital projects and project budgets, obtains authorizations and commitment, and demonstrates need and project feasibility.\n8. Identifies potential project risks and difficulties and develops strategies to mitigate or avoid them.\n9. Develops and coordinates project activities with the stakeholders and other team members within and outside the agency.\n9. Assist in the maintaining the project data and deficiencies in the CAFM facility assessment system (FAS).\n10. Provide quality services to the facility staff and leadership by keeping open communication and ensuring the quality product.\n11. May supervise, mentor, or review the other team members work if needed.\n12. Develops project status and budget reports using project management tools.\n13. Assists the Department with other related special tasks and duties as assigned by the leadership.\nAcquire and maintain a Certified Texas Contract Manager license as issued by the State of Texas.\n\n\n\n\nKnowledge Skills Abilities:\n1. Knowledge of project management theories and practice applicable to moderate scope projects; of systems and procedures used to evaluate third party vendor performance; of local, state, and federal laws and regulation relevant to the administration for the project undertaken.\n2. Skill in project management monitoring; in addressing changes in scope and budget and monitoring the schedule of the project.\n3. Ability to exercise sound judgement in making critical decisions, to analyze complex information and develop plans to address identified issues, to demonstrate negotiation and facilitation skills, to identify project risks, to understand the construction and different construction procurement methods, to prepare reports and charts, to communicate effectively and to coordinate the work of others.\n\n\n\nRegistration or Licensure Requirements:\n1. Certification as a Project Management Professional (PMP), Certified Associate in Project Management (CAPM), Certified Construction Manager (CCM), licensed architect or a professional engineer by the State of Texas is required.\n2. Certification as a licensed Architect or a Professional Engineer from any other state other than Texas is acceptable. The ability to transfer a current Architect or Engineer’s license from another state to Texas within six (6) months of hire date will be required.\n3. Acquire a Certified Texas Contract Manager license as issued by the State of Texas within 6 months from the date of hire.\n\n\n\n\n\nInitial Selection Criteria:\n1. Graduation from an accredited four-year college or university with major course work in a field relevant to the assignment is preferred.\n2. Minimum of 5 years project management experience in commercial or healthcare construction projects.\n3. Experience in renovation projects and contract negotiations is a plus.\n\n\n\n\n\nAdditional Information:\nThis position will be responsible for managing the construction projects at the El Paso facilities, Lufkin State Supported Living Center, with potential for Austin as an assignment headquarters. This position has an opportunity to telework. The candidate will attend new employee orientation and manage administrative functions through their designated headquarters. There is no guarantee of permanent telework, employees must meet telework eligibility requirements in accordance with agency policy, and any telework options are subject to change. A telework employee will not be reimbursed for travel from the employee's residence to their designated headquarters.\n\n\nMOS Code:\nNote: There may be no military occupation(s) that relate to the initial selection criteria and registry\nrequirements for this position. All active-duty military, reservists, guardsmen, and veterans are encouraged to apply if qualified to fill this position. For more information see the Texas State Auditor’s Military Code.\nhttp://www.hr.sao.state.tx.us/Compensation/JobDescriptions.aspx.\n\n\n\n\nTop 10 Tips for Success when Applying to Jobs at HHSC and DSHS\n\n\n\n\n\n\nHHS agencies use E-Verify. You must bring your I-9 documentation with you on your first day of work.\n\n\n\n\nIn compliance with the Americans with Disabilities Act (ADA), HHS agencies will provide reasonable accommodation during the hiring and selection process for qualified individuals with a disability. If you need assistance completing the on-line application, contact the HHS Employee Service Center at 1-888-894-4747. If you are contacted for an interview and need accommodation to participate in the interview process, please notify the person scheduling the interview.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect - Mission Critical (Austin)","company_name":"Burns & McDonnell","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$91.4K - $116K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nDescription\n\nBurns & McDonnell is actively recruiting Senior Architects to help shape our Mission Critical / Commercial / Higher Ed Studio in our well established Austin office. This position offers unique opportunities for both personal and professional growth by offering a wide-range of project responsibilities and team leadership roles. The ideal candidate will be a team-leading, highly-motivated individual seeking progressively more responsible assignments. Architecture at Burns & McDonnell is a different. Every studio has a goal to not only deliver design excellence but construct it\\! Senior Architects with a desire to lead a multidisciplinary team which includes in-house engineers, scientists and builders are encouraged to apply\\!\n\nResponsibilities:\n\nProvide project team leadership and coordination for finished plans, specification, and material selections; ensure design intent is incorporated into the construction documentation.\nMentor and lead teams in the production of accurate technical and contract documentation for project construction.\nMentor and lead construction administration duties including; bid review and support, site visits, address technical issues, and improve quality during construction.\nWork with government and regulatory agencies to achieve overall project schedule and objectives.\nManage, mentor and recruit talent including resources to produce 3D software renderings and critical presentations\n\nQualifications\n\nBachelor of Architecture degree from an accredited program is required.\n8 years of architectural experience, consulting preferred.\nRegistered Architect preferred.\nExpert knowledge in standard architectural techniques and procedures.\nExcellent written and verbal communication skills.\nExpert computer skills (e.g. Microsoft Office Suite)\nExpert computer skills (e.g. BIM (Revit), Adobe Suites, and 3D rendering programs).\nAbility to work methodically and analytically in a quantitative problem-solving environment and demonstrated critical thinking skills.\nExpert attention to detail, facilitation, team building, collaboration, organization and problem-solving skills.\nExperience with leading the design for large projects and delegating work tasks to team members. Ability to lead execution of work and resolve issues in a team environment.\nDemonstrated critical thinking skills, ability to work methodically and analytically in a quantitative problem-solving environment.\nStrong attention to detail, facilitation, team building, collaboration, organization and problem-solving skills.\nAbility to perform quality reviews for detailed architectural documents and specifications.\nAbility to travel.\n\nEEO/Minorities/Females/Disabled/Veterans\n\nJob Architecture\n\nPrimary Location US-TX-Austin\n\nSchedule: Full-time\n\nTravel: Yes, 15 % of the Time\n\nReq ID: 223160\n\n\\#LI-MJ \\#GFS\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager","company_name":"Amplify Recruiting","company_location":"Austin, TX 78703","salary_range":null,"days_ago_posted":"Posted\nPosted 6 days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$77.8K - $98.5K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nWith over 20 years of experience specializing in high-end, custom residential and club design, Ryan Street Architects provides first class architectural and interior design services on our projects. We are based in Austin, Texas and our projects offer unique opportunities for creative design, often on challenging site locations. Connections to nature, abundant natural light, and respect for the land and its character are hallmarks of our brand.\n\nOur process is collaborative, involving consultants, engineers, and contractors very early in the process, and our approach is personal. We build relationships with our clients that are based on mutual respect and trust. We are seeking a Senior Project Manager who is a leader and is skilled at overseeing day to day project development and delivery.\n\nThe successful candidate will manage multiple residential projects on a daily basis, provide oversight and coordination of the project team to ensure task completion, and ensure that our high standards of service are consistently delivered. Key strengths of the ideal candidate: leadership, communication, organization, planning, creative problem solving, confidence.\n\nBachelor’s degree in Architecture\n8+ years of project management experience, preferably in high end residential architecture\nLicensed Architect in the State of Texas preferred\nExcellent communication skills, both written and verbal\nExcellent professionalism and interpersonal skills\nExcellent organizational and time management skills - capability to work well in a fast paced environment with minimal supervision, juggle and prioritize multiple projects, and adjust work accordingly, often against tight deadlines. Must be able to maintain a great attitude under pressure. Must have sound judgement.\nAbility to make decisions related to project delivery\nAbility to resolve conflicts diplomatically\nAbility to anticipate problems and initiate mitigation measures\nWorking knowledge of AutoCAD and REVIT\nSound understanding of the design and documentation process\nProficiency in Microsoft Office programs such as Outlook, Word and Excel\nWorking knowledge of residential detailing, building materials, codes and construction\n\nCompensation and Benefits:\n\nCompetitive compensation, commensurate with experience\nFully paid health insurance for employee\nPaid membership in AIA\nPaid standard holidays and vacation\n401k retirement plan after 1 year of employment\nSupport for professional development, continued learning, and leadership development\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, or veteran's status.\n\nApplicants with a disability or a disabled veteran may request a reasonable accommodation if he/she is unable or limited in his/her ability to access job openings or apply for a job on our website as a result of his/her disability. The applicant may request reasonable accommodations by contacting us at 317.340.4154.\n\nHiring Insights\nJob activity\nPosted 6 days ago"},{"job_title":"Project Manager","company_name":"Method architecture","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nAD&D insurance\nDental insurance\nFlexible schedule\nHealth insurance\nParental leave\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$63.7K - $80.6K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nCompany Overview\nMethod Architecture is a uniquely ego-free architecture firm, committed to a systematic creative process that focuses on clients and their needs first and foremost. Operating with the flexibility of a small firm, but with a big reach, Method is a full-service architecture firm specializing in tenant finish and ground-up projects encompassing industrial, corporate interiors, healthcare, hospitality, breweries, retail and more.\n\nPosition Overview\nOur project managers work on every phase of building design projects including programming, schematic design, construction documents, and construction administration.\n\nResponsibilities\n\nProgramming, Schematic Design, and Design Development\nConstruction Documents\nConstruction Administration\nFinishes Selection\n3D Renderings\nConference calls and meetings with clients, engineers, vendors, and general contractors\nExpected to be an active participant at all networking events\n\nSkills & Abilities\n\nProficient in MS Office (Word, Excel, and PowerPoint)\nProficient in Adobe Design Software (Photoshop, Illustrator, and InDesign)\nProficient in AutoCAD and 3d rendering/visualization software\nProficient in Revit is required\nExcellent communication skills\nAble to work independently and as part of a team\nAble to multitask and balance multiple projects\n\nWork Experience\n\n5-8 years of relevant work experience\n\nFormal Education\n\nBachelor degree in Architecture or related field\nLicensed Architect or on the path to becoming licensed preferred\n\nThis information is to be treated as an overview of the position and not all encompassing of the role. The management team has the ability to assign other tasks as needed to ensure the success of the position.\n\nApplication Materials\nSubmit your resume with the subject line “Project Manager – Austin” on our website: methodarchitecture.com/careers/current-openings/. No hard copies, drop-ins, phone calls, or recruiter inquiries will be accepted.\n\nLife at Method\nMethod Architecture’s employees participate in a collaborative work environment that facilitates the cultivation of fresh and exciting ideas to fulfill the specific needs of the client. Method is pleased to have an open approach to employment with an ego-free, positive environment for employees in which everyone can thrive.\n\nMethod Architecture offers a competitive benefits package including:\n\nUnlimited Vacation (subject to conditions)\nFlexible Work Schedules\n100% paid employee health, dental, vision, & life/AD&D insurance\nRetirement account with employer matching\nPaid maternity/paternity leave\nFree snacks and drinks in the office\nCompany retreat\nQuarterly team building activities\n\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect - Austin, TX","company_name":"Kirksey Architects, Inc.","company_location":"Austin, TX 78721 \n(Martin Luther King-Hwy 183 area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nAD&D insurance\nDental insurance\nFlexible schedule\nHealth insurance\nParental leave\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$63.7K - $80.6K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nCompany Overview\nMethod Architecture is a uniquely ego-free architecture firm, committed to a systematic creative process that focuses on clients and their needs first and foremost. Operating with the flexibility of a small firm, but with a big reach, Method is a full-service architecture firm specializing in tenant finish and ground-up projects encompassing industrial, corporate interiors, healthcare, hospitality, breweries, retail and more.\n\nPosition Overview\nOur project managers work on every phase of building design projects including programming, schematic design, construction documents, and construction administration.\n\nResponsibilities\n\nProgramming, Schematic Design, and Design Development\nConstruction Documents\nConstruction Administration\nFinishes Selection\n3D Renderings\nConference calls and meetings with clients, engineers, vendors, and general contractors\nExpected to be an active participant at all networking events\n\nSkills & Abilities\n\nProficient in MS Office (Word, Excel, and PowerPoint)\nProficient in Adobe Design Software (Photoshop, Illustrator, and InDesign)\nProficient in AutoCAD and 3d rendering/visualization software\nProficient in Revit is required\nExcellent communication skills\nAble to work independently and as part of a team\nAble to multitask and balance multiple projects\n\nWork Experience\n\n5-8 years of relevant work experience\n\nFormal Education\n\nBachelor degree in Architecture or related field\nLicensed Architect or on the path to becoming licensed preferred\n\nThis information is to be treated as an overview of the position and not all encompassing of the role. The management team has the ability to assign other tasks as needed to ensure the success of the position.\n\nApplication Materials\nSubmit your resume with the subject line “Project Manager – Austin” on our website: methodarchitecture.com/careers/current-openings/. No hard copies, drop-ins, phone calls, or recruiter inquiries will be accepted.\n\nLife at Method\nMethod Architecture’s employees participate in a collaborative work environment that facilitates the cultivation of fresh and exciting ideas to fulfill the specific needs of the client. Method is pleased to have an open approach to employment with an ego-free, positive environment for employees in which everyone can thrive.\n\nMethod Architecture offers a competitive benefits package including:\n\nUnlimited Vacation (subject to conditions)\nFlexible Work Schedules\n100% paid employee health, dental, vision, & life/AD&D insurance\nRetirement account with employer matching\nPaid maternity/paternity leave\nFree snacks and drinks in the office\nCompany retreat\nQuarterly team building activities\n\n\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect I","company_name":"Perkins Eastman","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$67.8K - $85.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nLife at PE:\n\nPerkins Eastman is a global design firm with expertise that covers all aspects of the built environment. With studios in 24 locations globally, we design for people, to enhance the human experience and leave a lasting and positive impact on people’s lives and the world we inhabit.\n\nWe are an integrated firm which our professional roster consists of architects, interior designers, planners, urban designers, landscape architects, graphic designers, construction specification writers, construction economists, environmental analysts, resiliency experts, traffic and transportation engineers, and several other professional disciplines.\n\nThe Opportunity:\n\nPerkins Eastman, where employees are encouraged continuously to engage, to learn, and to contribute in a vibrant and supportive office culture, is in search of a Project Architect II with strong leadership, analytical and problem-solving skills and a passion for high-quality design and a collaborative process.\n\nThis position will provide an opportunity to work with integrated design teams on many projects of various sizes and complexity. The individual selected must possess the ability to react positively to a variety of design priorities, styles and project delivery methods. Our approach is client-focused, and our employees thrive in a collaborative, responsive environment.\n\nPrimary Responsibilities:\n\nWork in project teams to develop the aesthetic and technical design of the projects, and prepare architectural design and construction documents including drawings and specifications.\nSupport the construction administration efforts on projects.\nCollaborate with the Principal in Charge and Project Manager.\nWork on multiple projects simultaneously in different stages of design and construction.\nDemonstrate leadership in developing construction documents with minimum supervision.\nDevelop, check, and coordinate technical aspects of the design of projects, including compliance with Building and Life Safety codes, zoning regulations, and energy performance criteria.\nCoordinate with consulting engineer’s documents and specifications.\nMeet with client and stakeholders.\nFollow and focus on established standards for project production and review.\nKeep Project Manager and Principal-in-Charge informed of progress or the need for assistance.\n\n\n\nRequired Qualifications:\n\nBachelor or Master’s degree in Architecture is required.\nMinimum of 5+ years of Project Architect experience.\nConstruction Administration experience (submittal review, RFI response, ASI production and consultant coordination) is preferred.\nPrimary and Secondary Education, Multi-family, or Senior Living project experience is a plus.\nStrong communication, graphic, organizational, technical, and written skills required.\nDemonstrated experience in and readiness to lead the technical details of projects.\nProficient with Revit is required.\nExperience with other software applications such as Bluebeam, PowerPoint, Word and Excel a plus.\nExperience with construction management software such as Prolog and Newforma a plus.\nArchitects with construction company and construction management employment experience may apply.\n\nType: Hybrid. 3 days in office 2 days working remotely, flexible days/working hours\n\nPerkins Eastman is an affirmative action, equal opportunity employer and a participant in the U.S. Federal E-Verify program. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, or genetic information.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect / Quality Control","company_name":"Huckabee","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$101K - $127K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHuckabee is one of the fastest growing A/E firms in the nation and one of the top educational design firms. We are a mission-driven company that is dedicated to the success of all students. What we do matters, which is why we look for people who share our passion for changing the world through design and who want to create an impact of excellence on education. If you are ready to join our movement, reach out!\n\nCurrently we are accepting resumes for a talented, Senior Architect / Quality Control with a minimum of 15+ years experience working in the commercial architectural field to join our team. The position will offer the candidate opportunities to grow within the firm and thrive in an innovative, fast-paced, and highly collaborative environment mentoring design professionals. Educational facility experience is a plus. At Huckabee, the Senior Architect is a quality focused role serving as a resource and mentor in technical knowledge to project teams.\n\nRESPONSIBILITIES\n\nLead the quality assurance process on projects\nPerform thorough reviews to ensure projects meet technical quality standards\nCarefully monitor the use of new materials and construction methods for compliance with best practices and standards\nLead document review meetings with project teams to ensure understanding of corrections needed\nServe as a technical resource to staff in all phases of a project\nServe as a mentor to the Project Architect/Project Leader, investing in technical development\nMaintain proficiency regarding building materials, construction methods, costs, codes, and regulatory requirements\nAssist in the development of evloving best practice standards based on continuing education and lessons learned in construction\nImplement and teach standards and evolving best practices\n\nREQUIREMENTS\n\nActive architectural licensure required\nExperience in a quality control efforts in an architectural firm required\nExperience as a mentor and educator to architectural staff required\nInstitutional facilities experience required; educational facilities experience preferred\nTask driven and focused with high attention to detail\nProficient in Bluebeam\nExperience in the following software is a plus\nBIM360\nMicrosoft Teams\nRevit\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"PBK Architects","company_location":"Austin, TX 78759 \n(Arboretum area)","salary_range":null,"days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nHealth insurance\nOpportunities for advancement\nIndeed's salary guide\nNot provided by employer\n$78.6K - $99.5K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nFor over 40 years, PBK has been a leader in architectural and engineering design solutions across the United States. We are constantly seeking the brightest and most talented minds to be part of our award winning firm. Here at PBK, we pride ourselves in providing the best in class programmers, planners, architects, engineers, and consultants to offer top notch customer service. We strive to make a positive impact for future generations with our actions today. Here’s your chance, are you ready to make a difference?\n\nDescription – Project Architect\n\nThe Project Architect is responsible for producing high quality construction documents per PBK Standards. The Project Architect/Manager will participate in all phases of the project, including Schematic Design, Design Development, Construction Documents and Construction Administration. The Project Architect/Manager is responsible for the performance of the production team working underneath him or her. The Project Architect/Manager will work closely with the Project Manager to ensure timely projects completion within budget constraints in accordance PBK’s quality and client service standards.\n\nDuties will include but are not limited to:\n\nDirect and coordinate production of construction documents and specifications in compliance with PBK standards.\nOrganize and direct the architectural and/or engineering teams to execute the work in an orderly, timely and coordinated manner.\nEnsure that project meets the budget goals and schedules set by the client.\nCoordination with government agencies, utility companies and resolve plan check and approval issues with the agencies.\nMust exhibit strong knowledge of building codes and have the ability to ensure compliance.\nDirect, organize and mentor junior staff with the responsibility of overseeing their assignments.\nSupport Project Manager, Production Director and/or Client Executive in supervision of project staff.\nEstablish budget, task schedule and other components of the work plan with Project Manager.\nWork with Project Manager to establish project budget and schedule.\n\nRequirements\n\nBachelor’s Degree in Architecture is required.\nArchitecture License is required.\n5 + years of professional experience preferred.\n5 years of Revit experience producing construction documents for commercial buildings\nStrong customer service, organizational, and communication skills required.\n\nThis is an excellent opportunity for professional growth and career advancement within an award winning architectural firm. We offer a highly competitive salary and benefits package. An aggressive, client oriented personality with a knack for creative problem solving will succeed in this position.\n\nFirm Background\n\nPBK has built a client base of more than 200 clients, a list that includes school districts, university systems, hospital systems and Fortune 500 corporations. PBK offers employees competitive wages, health care and 401K matching along with numerous opportunities to become involved in extra-curricular activities and organizations established through the firm. PBK has established a culture that has led to the firm being named to the list of “Best Places to Work.”\n\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Project architect","company_name":"Fazio Architects","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$64.2K - $81.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nFAZIO Architects is a truly Boutique design firm providing Architectural and Interior Design services for a wide variety of programs from residential to commercial to healthcare. We believe that successful projects rely on our varied experiences, specialized knowledge, client engagement, collaboration and confidence. Each design is a unique problem to be addressed through a combination of building on past experience and questioning what we suspect to be true. Please review our post, and if it seems like you’d be a good fit, we’d love to hear from you!\n\nWe are currently seeking a Project Architect to expand our team of creative Architectural and Interior Designers. The right person will be:\n\nCreative and logical, continually considering the future implications of choices, actions and decisions.\n\nAn avid and self-driven learner with a desire to apply their experiences in new and innovative ways.\n\nSomeone who knows their resources and how to use them, but knows when and how to reach out for assistance.\n\nAn aide in creating a positive and ethical work environment that is conducive to productive team collaboration; attracting, retaining and developing a diverse group of top-quality employees at all levels.\n\nQualifications\n\nA Professional Degree in Architecture.\n\n5+ years of architectural Project Management experience.\n\nArchitectural registration is required.\n\nHigh-Level, technical understanding of Revit, including experience in creation of all elements in a CD set; proficiency Microsoft Office Suite (Excel, Word, Outlook, PowerPoint, Teams).\n\nExperience with managing medium sized projects from schematic design through construction documents.\n\nWorking knowledge of various building types and proficient with construction detailing.\n\nA detail-oriented mindset with the ability to understand the relationship and coordination required between drawings created by various project members with the ability to check all work for accuracy and completeness.\n\nHas worked closely with clients and developers to document ideas, concepts and design visions.\n\nMaintains and ensures good communication with clients, developers and team members.\n\nExcellent time management and organizational skills.\n\nExperience in collaborating with consulting engineers.\n\nProficient understanding of IBC and ADA standards.\n\nAn interest in working on both Architectural and Interior aspects of a project.\n\nresponsibilities\n\nModeling and drafting in Revit with efficient precision; adhering to drawing standards.\n\nAssist Design Principal in development of Schematic Designs and ensuring design continues to develop in-line with conceptual vision, code requirements, client expectations and project budget.\n\nAssist with and document site visits, submittals, substitution requests, and RFI’s during construction.\n\nManage project schedules, teams, tasks, consultants, clients and building and permitting officials, for multiple projects with varying timelines to meet project goals.\n\nDemonstrates strong written and oral communications skills, organizational skills and the ability to follow a task to completion.\n\nwhat we offer\n\nCompetitive compensation and benefits with a discretionary bonus based on profitability.\n\nAn open, collaborative studio environment in the middle of Downtown with easy access to cafés, restaurants, convenience stores, and bars.\n\nIndividual credit and authorship for work in press, publications, website, social media and awards.\n\nOpportunity to work on a variety of projects and tasks throughout all phases and across the country, and to learn valuable skills.\n\nVertical growth for employees.\n\nReimbursement for your professional Texas licensing and annual AIA dues.\n\nApply\n\nPlease email info@fazioarchitects.com with your Cover Letter, Resume and Portfolio.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"ARCHITECTURAL PROJECT MANAGER(S)","company_name":"BLGY","company_location":"Austin, TX 78754","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$75K - $94.9K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nBLGY Architecture is an award-winning 63-year-old practice with a passion for purposeful design, particularly of crucial built environments such as K-12 schools, training and support facilities for emergency and public safety operations, and other public entities that serve our communities.\n\nArchitectural licensing is preferred, but not required. Candidates should have a minimum of five (5) years of experience in the management of architectural projects (with construction cost of at least $5 million dollars), including oversight responsibilities during construction phase. This position requires a degree in Architecture or an acceptable correlated design and construction field.\n\nCandidate should have:\n\nEstablished supervisory, design and coordination skills.\nFamiliarity with engineering disciplines to sufficiently coordinate their planning input.\nAbility to communicate effectively with clients, consultants, contractors and team members.\nWorking knowledge of building materials, specifications and construction techniques.\nEstablished experience in meeting requirements of applicable building codes and ordinances.\nProficiency in Microsoft Office computer programs required; REVIT/BIM proficiency preferred.\nSuitable references\n\n. .\n\nSupport You Will Provide\n\nAccomplishing diverse in-house architectural assignments including project design and management, and oversight of subconsultant and other firms providing design and construction services to BLGY clientele.\n\n.\n\nCompensation and Benefits\n\nCompensation is negotiable and may include bonus pay at BLGY’s discretion.\nPaid leave includes sick, vacation, funeral, jury and holidays.\n“Personal Leave” is an additional paid leave offering provided at BLGY’s discretion.\nHealth insurance includes major medical, dental, vision, accident and life.\nMatching 401(k) retirement annuity includes BLGY matching contribution up to four (4) percent.\nFinancial support for professional development courses, Texas architectural license renewal fee if registered, or architectural licensing exam fees if not registered.\n\n.\n\nContact\n\nPlease contact Benny L. Hawkins, President and CEO, via phone at (512) 977-0390, or email at blhawkins@blgy.com.\n\nALL REPLIES WILL BE TREATED WITH CONFIDENTIALITY.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"The Beck Group","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$71K - $90K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nIt's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nWho we are\nWe're The Beck Group, the largest and most innovative integrated building firm in the country. We are focused on delivering design and construction excellence on a broad range of project types. Headquartered in downtown Dallas, with offices in Atlanta, Austin, Charlotte, Denver, Fort Worth, Mexico City, and Tampa, we believe a better process and outcome results from working together. At Beck, you will find yourself surrounded by passionate colleagues who have a collaborative mindset and care about each other. We are committed to hiring the best and brightest within our industry, and that's why we are seeking experienced Architects like you to help transform the industry and continue building Beck's respected reputation.\nWhat you bring to the table\nBeck is looking for a qualified Project Architect/Senior Project Coordinator to join an extraordinary project team in Austin, Texas. As the Project Architect/Senior Project Coordinator, you will apply sound and diverse knowledge of architecture principles and practices in a broad array of assignments and related fields.\nThe job involves the following responsibilities:\nMarket/Sell Beck - exhibits the ability to communicate the Integrated Enterprise\nParticipate in an overall company committee or initiative\nDemonstrate programming principles\nLead ADA, TAS and IBC discussions with Authority Having Jurisdiction (AHJ)\nUnderstand construction sequencing and constructability\nWork with the in-house construction budget in mind\nActively manage client budgets, schedules, programs, project communication and documentation, and project team assignments\nEffectively supervise and mentor staff\nIdentify customer's needs and understand their culture\nLead or design small projects\nServe as the point person for communications and transfer of documents between the entire design team, client/owner's representative and construction team.\nCo-locate with the team, where required for the project.\nAttend meetings during Bidding phase, where applicable.\nReview and process substitution requests. Coordinate with project specifications, design team and consultants.\nCoordinate issuance of any addenda during the Bidding/Negotiation phases.\nReview construction progress for adherence to the Construction Documents.\nMeet with the client during construction site visits to review issues and general progress.\nReview shop drawings and submittals. Coordinate with design partners where appropriate.\nRespond to requests for additional information; prepare, coordinate and/or issue supplemental drawings and/or specifications as required.\nReview and approve general contractor's applications for payment.\nPrepare and execute a punch list of deficient or non-complying work; conduct punch list walk-through with clients and general contractors to check conformance of the work with the construction documents, and to verify accuracy and completeness of the contractor submitted punch list.\nCoordinate with Authorities Having Jurisdiction (i.e. State health departments and other pertinent regulatory agencies) for inspections, etc.\nIssue Certificates of Substantial Completion.\nAuthorize final payments upon completion of projects.\nPrepare and manage project fee budget\nWho we think will be a great fit\nYou have an understanding of complex aspects of Architecture, a passion to get things done, and possess uncompromising authenticity and integrity.\nYou also meet the following requirements:\n4-8 years of relevant experience\nProfessional registration preferred\nRecommended training includes:\nCore Skills, Revit, IDP, Public Speaking, LEED Green Associate Certification\nPhysical Demands:\nFrequently operates a computer and other office productivity equipment; ability to coordinate and participate in client meetings; constantly communicates with project team and related parties; ability to maintain best practices related to architectural design and production; ability to adhere to consistent and timely attendance.\nJoin our team and build your future with Beck.\nThe Beck Group is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, disability, or genetic information. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities to this job at any time.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect | Project Coordinator","company_name":"KIRKSEY ARCHITECTS INC","company_location":"Austin, TX 78721 \n(Martin Luther King-Hwy 183 area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$73.7K - $93.3K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nDescription:\n\n\nKirksey is an architecture firm with a culture that values great design, environmental stewardship, diversity, and most of all, our employees.\n\nIn addition to great design, hard work, and having fun in the process, Kirksey values the personal and professional development of each employee by supporting individual initiatives and ambition. This empowerment, freedom, and entrepreneurial spirit supports long term careers at Kirksey.\n\nKirksey is looking for a dynamic, motivated Project Coordinator or Project Architect to join our Austin office.\n\nResponsibilities\n\nFull project team and document coordination, including specifications, all consultants and their documents.\nProject Team resource for technical guidance to resolve design issues while maintaining design intent.\nFacilitate open team communication with all levels of project team – Internal Team, Owners, Contractors, Consultants and Authorities Having Jurisdiction.\nCoordinate all Construction Administration processes.\nOther duties as assigned.\nRequirements:\n\nQualifications\n\nProfessional degree in Architecture or related field\nThe ideal candidate will have 5-12 years of experience\nRevit experience is strongly preferred\nArchitectural license is preferred\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect - Housing & Mixed Use","company_name":"Lord Aeck Sargent Planning & Design, Inc.","company_location":"Austin, TX 78701 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\nContinuing education credits\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$74.8K - $94.7K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nPROJECT ARCHITECT - HOUSING & MIXED USE\nOur Austin office is looking for a highly motivated Project Architect with excellent communication and team management skills. The ideal candidate needs to be able to work well with people at all levels of the firm and have architectural design and production experience with multi-family housing projects. This candidate will be self-motivated and demonstrate a willingness to learn, share and contribute in our collaborative office environment.\nMinimum Requirements:\nProfessional (NAAB Accredited) Degree in Architecture\nMust have at least 4-8 years of experience in an office environment\nStrong Revit and production skills required\nSelf-motivated individual able to work well in a highly collaborative office environment\nGraphic communication skills to support a variety of presentation media: presentation drawings, marketing materials, feasibility studies, etc. Photoshop, Illustrator and/or InDesign skills\nSkilled in analytical thinking, modeling and rendering to support the design process\nAbility to handle job stress, deadlines and interact effectively with others in the workplace is an essential function of the job\nGood computer skills and basic knowledge of Microsoft Office\nMulti-family housing experience preferred\nDesired Personality Traits\nDetail-oriented, methodical, meticulous, process-oriented, yet open to change and motivated by innovation.\nGreat collaborator and communicator – excellent verbal and written skills are important\nAmbitious self-starter with get-it-done attitude who strives for results and performs well under pressure\nCareer oriented\nGood sense of humor\nAt Lord Aeck Sargent Planning & Design, we strive to make a positive difference in the built environment. Our mission is to provide innovative, responsive design - coupled with cutting-edge technological expertise and exceptional service - to our clients. As an award-winning architectural firm, we strive to maintain the high standard of excellence our clients have come to expect of us. To do this we rely heavily upon, and invest significantly in, the success of our employees. Across our market sectors and multiple offices, we promote a collaborative, diverse environment that is at once challenging, stimulating, supportive, and fun.\n\nLord Aeck Sargent Planning & Design provides our employees with ongoing learning opportunities, great benefits and a team-centered environment. We encourage our employees to discover and develop their own particular talents, skills, and interests in order to reach their own full potential. We believe that the key to our success as a firm is the personal and professional growth of the men and women who serve our clients every day.\n\nLord Aeck Sargent Planning & Design offers competitive salaries and strong personal and professional benefit packages including:\nPersonal Benefits\nMedical, Prescription & Discount Vision Coverage\nDental Insurance\nDependent/Child Care Spending Accounts\nMedical Spending Accounts\n401(k)\nShort Term and Long Term Disability Insurance\nPaid Maternity/Paternity Leave\nLife Insurance (Employee and Family)\nNine (9) Paid Holidays\nPaid Personal Leave\nHybrid Office Schedule Flexibility (24 hours/week in office)\nProfessional Benefits\nInternal and External Continuing Education Opportunities\nProfessional Memberships Reimbursement\nBuilding/Design Product Lunches\nProject Site Tours\nOffice and Company-Wide Social Gatherings\nLord, Aeck & Sargent Planning & Design is an Equal Opportunity Employer committed to Affirmative Action. Lord Aeck Sargent is committed to providing equal employment opportunities to all employees and applicants without regard to race, ethnicity, religion, color, sex (including childbirth, breast feeding and related medical conditions), gender, gender identity or expression, sexual orientation, national origin, ancestry, citizenship status, uniform service member and veteran status (VEVRAA), marital status, pregnancy, age, protected medical condition, genetic information, disability or any other protected status in accordance with all applicable federal, state and local laws.\nAttention Applicants: If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, please let us know. Likewise, if you are limited in the ability to access or use this online application process and need an alternative method for applying, we will determine an alternate way for you to apply. Please contact Victoria Cunningham at victoria.cunningham@lordaecksargent.com for assistance with an accommodation.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architect, Team Lead","company_name":"Atkins","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nEmployee assistance program\nFlexible schedule\nRetirement plan\nTuition reimbursement\nIndeed's salary guide\nNot provided by employer\n$115K - $146K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nWhy join us?\n\nWe are hiring! Atkins is looking for a Senior Architect, Team Lead to support architectural teams and new business development opportunities. The successful candidate will be a trusted partner and advisor to clients. This candidate will guide architectural staff. Significant experience in higher education is strongly preferred. There are two locations for this role: Austin, TX and Dallas, TX. This position will report to Director of Architecture.\n\nAbout Us\n\nAtkins is one of the world’s most respected design, engineering and project management consultancies. Atkins has been providing infrastructure planning, engineering, construction, environmental consulting, urban planning, architecture, and program management services to public and private clients across the United States for more than 50 years. Atkins has the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.\n\nHow will you contribute to the team?\n\nProvide leadership to Texas Architectural Staff and coordinate with the nationwide practice.\n\nDevelop new business opportunities in higher education.\n\nManage staff assignments and administrative responsibilities.\n\nInterface with global counterparts to share knowledge and expertise.\n\nCoordinate design and production in accordance with applicable specifications and regulatory policies.\n\nConduct analyses and prepare technical studies and reports.\n\nParticipate in project planning for scope, time, related fee projections, and completion estimates.\n\nPrepare permit applications for regulatory agency review and approval.\n\nAssist with project scheduling.\n\nProvide database support for projects, to include document control, project logs, etc.\n\nAssist in the coordination and tracking of project submittals.\n\nWhat will you contribute?\n\nBachelor's degree in Architecture; Master's degree in Architecture or graduate level technical coursework preferred.\n\nThis level may be achieved by Architects with fifteen years’ experience since Bachelor's degree or fourteen years with Master's degree.\n\nRegistration as a licensed architect is required.\n\nHigher Education experience highly preferred.\n\nLEED and/or WELL accreditation preferred.\n\nAbility to excel at complex jobs which involve diversified technical duties.\n\nExceptional communication skills with both internal and external clients.\n\nConsistent discretion and independent judgement when making decisions.\n\nWhat we offer at Atkins:\n\nAt Atkins, you will enjoy a robust rewards package which includes:\n\nOpportunity to work on various projects of various sizes\n\nCompetitive salary\n\nFlexible work schedules\n\nGroup Insurance\n\nRetirement Savings Plan with employer match\n\nEmployee Assistance Program (EAP)\n\nLearning and development programs, training, career opportunities and a highly regarded tuition reimbursement program\n\nIf this sounds like you and you would like to expand your career with us, apply today!\n\nAtkins is an equal opportunity, drug-free employer committed to diversity in the workplace. EOE/Minorities/Females/Vet/Disability.\n\nPlease review Atkins Equal Opportunity Statement here:\n\nhttps://careers.snclavalin.com/equal-opportunities-statement\n\nAtkins cares about your privacy and are committed to protecting your privacy. Please consult our Privacy Notice on our Careers site to know more about how we collect, use and transfer your Personal Data.\n\nBy submitting your personal information to Atkins, you confirm that you have read and accept our Privacy Notice.\n\nNote to staffing and direct hire agencies:\n\nIn the event a recruiter or agency who is not on our preferred supplier list submits a resume/candidate to anyone in the company, SNC-Lavalin family of companies, we explicitly reserve the right to recruit and hire the candidate(s) at our discretion and without any financial obligation to the recruiter or agency. https://careers.snclavalin.com/recruitment-agencies\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager","company_name":"HNTB Corporation","company_location":"Austin, TX 78703","salary_range":null,"days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$81.5K - $103K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nWhat We're Looking For\n\nWe are seeking an experienced aviation professional to join our dynamic team as a project manager for medium sized projects within a larger program team. Responsible for the coordination of all project efforts, administrative and technical, to assure the most efficient and cost-effective execution of assigned projects. Serves as primary liaison contact with clients to bring projects to completion on schedule, within budget and with maximum client satisfaction.\n\nOur practice believes great design comes from a spirit of curiosity and collaboration. We value diverse perspectives and take pride in delivering solutions that are specifically tailored to each client.\n\nYou will need to possess strong communication skills, the ability to solve complex problems creatively, the ability to foster collaborative respectful team dynamics, and be able to develop and manage effective client relationships. This position is for a licensed architect who has demonstrated expertise in the delivery of aviation building projects.\n\nPrimary Focus Will Include:\n\nDevelop and execute project work plans on time and on budget\nPrepare technical proposals\nLead a multi-disciplined design team to delivery airport facilities\nAct as the primary client liaison responsible for managing and delivering all aspects of a medium to large project including contracting, project controls, quality, risk, and change management.\nProvide technical guidance and mentor staff.\n\nPreferred Qualifications and Skills:\n\nRevit skills\nLeadership qualities and characteristics\nRegistered Architect\nMinimum 7 years of experience on aviation architecture projects\nExcellent verbal and writing skills\nExperience leading and managing a team of consultants.\nUnderstanding of terminal programming and planningUnderstanding of aviation terminology\nAbility to work at the project location and/or frequent travel is required.\nCandidate must be able to pass the required background checks to work onsite at a U.S. airport.\nExperience delivering Design-Build projects is a plus.\nIND\n\n\\#KJ-LI\n\nWhat You'll Need\n\nEssential Responsibilities:\n\nResponsible for preparation for of strategic plans for project success. Serves as the primary client liaison to bring the schedule, budgets and scope of work to completion and to the client’s satisfaction.\nActively manages client’s budget, schedule and program as well as HNTB’s budget and schedule. Administers project communications and documentation. Oversees office administrative tasks and project team assignments.\nEstimates fees, determines scope of work, and prepares proposals and contracts on medium size projects.\nResponsible for the coordination of all project efforts, both administrative and technical, to assure the most efficient and cost-effective execution of assigned projects.\nCoordinates work efforts and reviews work performed.\nIntegrates quality control measures during all phases of design.\nPerforms other duties as assigned.\n\nMinimum Qualifications:\n\nBachelor's degree in Architecture, Interior Architecture, or Interior Design\n10 years related experience\n\nAdditional Information\n\nClick here for benefits information: HNTB Total Rewards\n\nClick here to learn more about EOE including disability and vet\n\nVisa sponsorship is not available for this position.\n\n\\#KJ #Architecture\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\n.\n\nNOTICE TO THIRD-PARTY AGENCIES:\n\nHNTB does not accept unsolicited resumes from recruiters or agencies. Any staffing/employment agency, person or entity that submits an unsolicited resume to this site does so with the understanding that the applicant's resume will become the property of HNTB. HNTB will have the right to hire that applicant at its discretion and without any fee owed to the submitting staffing/employment agency, person or entity. Staffing/employment agencies who have fee agreements with HNTB must submit applicants to the designated HNTB recruiter to be eligible for placement fees.\n\nJob Type: Regular\n\nFull/Part Time: Full time\n\nJob Category: Architecture Group\n\nReqID: R-12280\n\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Senior Architect/Specification Writer","company_name":"Atkins","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nEmployee assistance program\nFlexible schedule\nPaid time off\nRetirement plan\nTuition reimbursement\nFull Job Description\n\nWe are hiring!\n\nAtkins is looking for a Senior Architect to lead and support architectural teams in institutional and/or education projects. Successful candidates will be a trusted partner and advisor to clients and will coordinate project activities. Preferred location for this role will be Austin, TX. This position will report to Director of Architecture.\n\nAbout Us:\n\nAtkins is one of the world’s most respected design, engineering, and project management consultancies. Atkins has been providing infrastructure planning, engineering, construction, environmental consulting, urban planning, architecture, and program management services to public and private clients across the United States for more than 50 years. Atkins has the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.\n\nAtkins has the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.\n\nHow will you contribute to the team?\n\nProvide leadership to clients/project staff and coordinate with multiple disciplines.\n\nCompose and assemble specifications for various project types using MasterSpec, SpecLink, or SpecsIntact. Coordinate design and production in accordance with applicable specifications and regulatory policies.\n\nConduct analyses and prepare technical studies and reports.\n\nParticipate in project planning for scope, time, related fee projections, and completion estimates.\n\nPrepare permit applications for regulatory agency review and approval.\n\nAssist with project scheduling.\n\nAssist in the coordination and tracking of project submittals.\n\nWhat will you contribute?\n\nBachelor's degree in Architecture; Master's degree in Architecture or graduate level technical coursework preferred. This level may be achieved by Architects with fifteen years experience since Bachelor's degree or fourteen years with Master's degree. Typical incumbent has twenty or more years' experience.\n\nSignificant knowledge of Specification Writing.\n\nRegistered Architect.\n\nLEED AP and/or WELL AP accreditation preferred.\n\nAbility to excel at complex jobs which involve diversified technical duties.\n\nExceptional communication skills with both internal and external clients.\n\nConsistent discretion and independent judgement when making decisions.\n\nWhat we offer at Atkins:\n\nAt Atkins, you will enjoy a robust rewards package which includes:\n\nOpportunity to work on various projects of various sizes.\n\nCompetitive salary.\n\nFlexible work schedules.\n\nPaid Time Off (PTO).\n\nGroup Insurance.\n\nRetirement Savings Plan with employer match.\n\nEmployee Assistance Program (EAP).\n\nLearning and development programs, training, career opportunities and a highly regarded tuition reimbursement program.\n\nIf this sounds like you and you would like to expand your career with us, apply today!\n\nAtkins is an equal opportunity, drug-free employer committed to diversity in the workplace. EOE/Minorities/Females/Vet/Disability.\n\nPlease review Atkins Equal Opportunity Statement here:\n\nhttps://careers.snclavalin.com/equal-opportunities-statement\n\nAtkins cares about your privacy and are committed to protecting your privacy. Please consult our Privacy Notice on our Careers site to know more about how we collect, use and transfer your Personal Data.\n\nNote to staffing and direct hire agencies:\n\nIn the event a recruiter or agency who are not on our preferred supplier list submits a resume/candidate to anyone in the company, SNC-Lavalin family of companies, we explicitly reserve the right to recruit and hire the candidate(s) at our discretion and without any financial obligation to the recruiter or agency. https://careers.snclavalin.com/recruitment-agencies.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect - Corporate Interiors","company_name":"Perkins+Will","company_location":"Austin, TX 78702 \n(Rosewood area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$71.2K - $90.1K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nAre you committed to design excellence?\nDo you thrive in an environment of collaboration?\nDo you have a passion for sustainability?\nDo you show a high degree of creativity and entrepreneurship?\n\nIf yes, join us in AUSTIN to change the world through design!\n\nAs a Project Architect on the Perkins&Will Corporate Interiors team, you will:\n\nBe responsible for planning, developing, and executing technical documentation which may include interpreting, organizing, and coordinating project team assignments\nDirect and coordinate production of schematic, design development and construction documents in collaboration with Project Manager\nPerform construction administration duties (e.g., RFI’s, RFP’s, change orders, etc.)\nExecute applicable agency review analysis (accessibility, zoning, life-safety, etc.)\nEstablish budget, task schedule, and other components of the work plan with Project Manager\nParticipate in marketing efforts and may lead presentations to prospective clients\nWork with engineering consultants through schematic and design development phases\nDirect, organize, and mentor junior staff with responsibility for oversight\nUtilize your rock star technical skills in Revit and other design application software\nWork hard, play hard, and learn a lot along the way!\n\n\n\nRequirements\n\nTo join us, you should have:\n\nA professional degree in Architecture, Design, or related discipline\n8+ years of experience\nProficiency in 3D modeling, visualization, and graphic software; Revit strongly preferred\nAbility to direct and coordinate work efforts of junior staff\nExperience in all phases and aspects of a project\nFamiliarity with building codes, specifications, building and engineering systems\nUnderstanding of project management process\nEffective verbal and written communication skills\nCollaborative and professional work ethic\nLEED AP or within 6 months of hire\nLicensure required\n\nQualified and interested candidates should submit a resume and work samples. Include your resume and a compact, representative sample of your work (no larger than 4MB).\n\nAt Perkins&Will we believe that inclusion spurs creativity, and that innovation is born from an engaged culture of diverse people and ideas. By moving beyond barriers and stereotypes of gender, race, color, religion, national origin, ancestry, age, medical condition, disability, sexual orientation, gender identity, veteran status; we are committed to building an organization that reflects the diversity of the communities and clients we serve.\n\nEqual Opportunity Employer:\n\nPerkins&Will is an equal opportunity employer and supports talent from diverse backgrounds that bring experiences, viewpoints and solutions that best serve our clients, community and enrich our work environment. Women, minorities, individuals with disabilities and active duty wartime, campaign badge veterans or Armed Forces service medal veterans are encouraged to apply. EOE/M/F/V/D\n\n\n\n\nQualifications\n\nEducation\n\nRequired\n\nBachelor or better in Architecture or related field.\n\nLicenses & Certifications\n\nPreferred\n\nLicensed Architect\n\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\n\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Licensed Architect","company_name":"Sp-ai, Inc.","company_location":"Round Rock, TX 78664","salary_range":"$50,000 - $70,000 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$50,000 - $70,000 a year\nJob Type\nFull-time\nQualifications\n\nAutoCAD: 5 years (Required)\n\nWork authorization (Required)\n\nFull Job Description\n\nSpencer-Pierce Architecture is looking to expand our design team! As a small firm, our team gets to work on many different project types including: financial, medical, retail, religious, education, municipal and county governmental, fire stations, residential - single family, office, restaurant, tenant finish-out, warehouses, industrial. Future team members will have the opportunity to work on a diverse portfolio of projects!\n\nApplicant should have strong design experience, be self-motivated, able to work with minimal direction, and be sensitive to deadlines. Applicant should have leadership characteristics but with a collaborative mentality. The demonstration of strong attention to detail, adaptability, and willingness to learn new things/ask questions will fit well in our small office environment.\n\nApplicant should be able to:\n\nWork on multiple projects simultaneously.\nAssist with the management of client expectations, budgets, schedules, and programs; project communications and documentation.\nServe as a point of contact with clients, consultants and contractors and assist with bringing projects to completion on schedule, within budget, and with client satisfaction.\nGenerate architectural design concepts.\nGenerate, prepare and manage development of architectural design and construction drawings.\nPut together project specifications.\nReview architectural documents for areas of conflict with all consultant disciplines.\nAttend project meetings and coordinate the completion and distribution of meeting minutes.\n\nThis is an in-office job.\n\nREQUIREMENTS:\n\nLicensed Architect with minimum of five years of experience.\nProficient in AutoCad\nRevit knowledge a plus but not required.\nExperience with computer 3D modeling using Sketch-Up or other programs.\nFluent in the English language.\n\nWe will not be paying for relocation at this time.\n\nJob Type: Full-time\n\nPay: $50,000.00 - $70,000.00 per year\n\nSchedule:\n\nMonday to Friday\n\nAbility to commute/relocate:\n\nRound Rock, TX 78664: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nAutoCAD: 5 years (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Project Architect, Commercial & Industrial","company_name":"Stantec","company_location":"Austin, TX 78723 \n(Mueller area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$98.6K - $125K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\n\nSenior Project Architect, Commercial & Industrial - ( 210002FN )\n\nDescription\n\nThe buildings that make up the landscape of our daily lives seem like permanent fixtures, fastened to a time and place. But what if that didn’t have to be true? What if our built environment — where we live, learn, play, and conduct business — carried us forward instead?\n\nOur Buildings practice keeps people at its heart, recognizing that our shared journey forward is shaped by the meaningful and responsive places we design. From iconic designs to monumental groundbreakings, join us to bring transformational building solutions to life. Every day we apply our expertise, creativity, and passion to propel communities into the future—join us!\n\nYour Opportunity\n\nJoin a Top 10 global design firm in our Texas buildings practice that provides Architecture, Buildings Engineering, and Interior Design services with a long history and deep commitment to the education sector. Our Plano office is seeking a Sr. Project Architect for our Commercial | Industrial sector designing and managing projects for large iconic brands.\n\nAs a senior contributor on our professional Architecture team you will work independently to assist clients through the planning and creation of fiscally responsible, award-winning designs. Your experience ensures that you are quite familiar with construction plans, specifications, estimates and building codes. You will be innovating and creating new prototypes designed with sustainable products with green architecture sensibility as your goals. You will lead the development of integrated design proposals, continuous updating of a building information model, preparing a variety of output / drawings throughout the project, while leading and mentoring others and collaborating with team members to contribute to the final deliverables as required under instruction from the Project Leader.\n\nYour Key Responsibilities\n\nResponsible for large projects of high complexity.\nEngages in the development of a design through sketches, physical models, electronic models, diagrams, massing studies, and other visual formats.\nUtilizes BIM technologies in development of three dimensional models of buildings and their components.\nParticipates in design critiques and pin-ups.\nInterprets and applies building codes and requirements of other regulatory agencies.\nPrepares and revises documentation in various architectural phases including site plans, floor plans, building elevations, building sections, details.\nParticipates in bidding and negotiation phase and prepares addenda.\nReviews shop drawings and submittals, responds to RFIs, prepares site observation reports, and other contract administration tasks.\nLeads project coordination and meetings with internal team members and/or external consultants, owner and contractor and sub-contractors.\nParticipates in client project requirement meetings and value analysis and basic cost estimating.\nAssists in the preparation of the project specifications.\nCoordination of specs with construction documents.\nParticipates in constructability review.\nConducts quality assurance and quality control on own projects.\n\nQualifications\n\nYour Capabilities and Credentials\n\nPassion for and experience in the commercial and industrial sectors\nStrong experience in commercial core / shell and industrial typologies\nStrong construction document / construction detailing experience\nRequisite knowledge and application of accessibility codes, applicable building codes.\nKnowledge of building construction systems, means and methods, materials and industry associated standards.\nStrong understanding of all phases of architectural document production and the relationship between drawings and specifications.\nStrong knowledge of building construction systems, means and methods, materials, and industry standards.\nAbility to conduct space planning, block planning and adjacencies in coordination with building program.\nAbility to develop floor plans, wall sections, and details.\nAbility to check work of others for accuracy and completeness and manage time to meet project budget and schedule.\nAbility to lead one or more teams through all phases of architectural document production.\nAbility to participate and collaborate in a project team setting through all phases of architectural document production.\nAbility to engage in creative and critical thought.\nAbility to hand sketch and communicate concepts and ideas to others effectively.\nAbility to interpret sketches, drawings, building program and other similar material.\nAbility to communicate abstract ideas (verbal/written).\nStrong presentation and interview skills.\nRequires understanding of Microsoft Office Suite, Revit, AutoCAD, Abobe Creative Suite, SketchUP, Newforma, Sefaira.\n\nEducation and Experience\n\nBachelor’s degree in Architecture or related field.\nRegistered Architect or actively pursuing licensure.\nMinimum of 10 years of experience.\nExperience in core & shell and industrial typologies.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n\nPrimary Location : United States-Texas-Plano\n\nOther Locations : United States-Texas-Houston, United States-Texas-San Antonio, United States-Texas-Austin\n\nOrganization : BC-2140 Buildings-US Texas\n\nEmployee Status : Regular\n\nJob Level : Individual Contributor\n\nTravel : Yes, 25 % of the Time\n\nSchedule : Full-time\n\nJob Posting : Nov 21, 2022, 6:02:09 PM\n\nReq ID: 210002FN\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Project Manager","company_name":"Page Southerland Page, Inc.","company_location":"Austin, TX 78730","salary_range":null,"days_ago_posted":"Posted\nPosted 28 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$89.6K - $113K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\nFull Job Description\nOverview:\nAt Page, we’re actively seeking talented people to join an empowered employee environment. Our teams provide architecture, engineering, interiors and consulting services on large, complex projects around the world. As our market sectors and services grow, we continuously add new opportunities. Will you join us?\nResponsibilities:\nWe are searching for a Senior Project Manager to work in our Industrial Market Sector. This position will be located in our Northwest Austin office. The ideal candidate will have experience in a variety of market sectors such as: Semiconductor and Science & Technology. You will lead large design teams for technically sophisticated projects such as; advanced manufacturing for semiconductor, automotive manufacturing centers and battery/energy manufacturing facilities. The Senior Project Manager role involves both client-facing and team-facing responsibilities and has tremendous growth potential.\n\nIn addition the responsibilities include:\nForecast and organize project teams for design, development, production and project document delivery;\nCoordinate with consultants, team members and the client;\nSuccessfully execute projects by following Page’s and Owner’s protocols and procedures in order to reach the best solution;\nDevelop strong client, consultant and collaborator relationships;\nUnderstand budget, code and jurisdictional requirements;\nProvide monthly project status report including staffing and cashflow projections;\nProvide mentorship and guidance to project team;\nCollaborate on project fee development and proposals.\nQualifications:\nA Degree in engineering, architecture or a related field from an accredited, four-year university;\nProfessional Engineers or Architecture license preferred;\n5+ years of relevant professional experience;\nExperience in science and technology, mission critical or similarly complex projects;\nAbility to manage multiple project sizes, with a concentration in large projects valued at $30MM plus;\nApply detailing skills and be proficient with construction administrative processes;\nProven effectiveness coordinating with contractors, engineering teams, and consultants;\nProficiency with Microsoft Office Suite, and familiar with BIM, Revit and AutoCAD;\nAbility to successfully lead/organize a team of multiple disciplines and consultants;\nConfident with public speaking and networking;\nExcellent writing skills;\nDetail oriented and organized with proven experience in managing multiple projects simultaneously.\n#LI-1012\nHiring Insights\nJob activity\nPosted 28 days ago"},{"job_title":"Sr. Project Manager – High-Rise | Architecture","company_name":"STG Design","company_location":"Austin, TX 78703 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$82.9K - $105K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nLET’S DO THIS…\n\nYou’re a proven architectural leader several years into your career and are looking for a more challenging and strategic market-level opportunity. You’ve proven you can return results and want the chance to play a key influential role across capable teams. You’re dedicated to delivering projects on time and budget. You have a lot to teach and are looking for a group excited to learn. You’ve come to the right place; at STG, we can make that happen.\n\nWHAT IT IS…\n\nOur high-rise studio in Austin or Houston are seeking a seasoned Project Manager to take on full responsibility for project profitability, schedule, and budget. We need a well-rounded, strategic thinker with a keen ability to manage client interactions and expectations, to oversee the projection of workload and flow and all consultant coordination, and to provide critical problem-solving for both the technical and design facets of each project. In short, we want a Senior Project Manager as remarkable as we are. We want someone who understands how to plan a project and is excited about making their clients happy and better. We need a seasoned PM who wants to strategically grow a market, who looks around the corner and can see problems coming before they arise. We want a PM who attacks each new challenge with the knowledge that last week’s answer doesn’t fit this week’s question - a true, influential leader who is always seeking to learn more and apply what they’ve learned to make those around them better.\n\nThis is exactly the stuff that gets to the heart of our legacy. Built on hard work and pure passion, STG has a 40+ year history of delivering award-winning commercial architecture and interior design. We’re building on that for the future, too.\n\nWHAT YOU’LL DO…\n\nThe only thing routine about us is that we are constantly unleashing innovation. Our routine is that there is no routine. On any given day you will (among other things)… One of our favorite things about this profession is the variety. Our routine is that there is no routine. On any given day you may (among other things):\n\nServe as the primary client liaison responsible to complete projects to satisfy the client’s goals.\nCollaborate on ideas for high-rise architectural amenities to help our clients stand out.\nManage work plans, schedules, programs, communication, and project team assignments.\nEstimates fees, determine scope of work, and prepares proposals and contracts.\nAssist staff in development of industry knowledge and architectural skills.\nIssue and record Change of Service Agreements in a timely manner.\nResearch, establish and adhere to city/county agency requirements.\nOversee and assure contract document submittals for agency review.\nDirect the preparation and issuance of bid documents.\nOversee construction contract administration and attend construction meetings as needed.\n\nWHAT YOU NEED TO HAVE…\n\nRegistered Architect (preferred).\nBachelor's degree in Architecture from an accredited school.\n12+ years of professional experience, inclusive of at least 5 years of project management experience with high-rise buildings.\nWorking knowledge of REVIT.\nComprehensive knowledge of architectural principles/practices.\nExperience leading complex projects and multi project accounts.\nStrong business development and client development acumen.\nStrong leadership, organization, communication, and interpersonal management skills.\nExperience negotiating project scope and fees.\nKnowledge of local building codes and standards.\n\nWHAT WE EXPECT…\n\nAfter 40+ years, we know ourselves pretty well; we know what we expect and what lets people thrive at STG. We value people who are:\n\nInteresting – We want people that can provide unique insight into our clients’ problems and contribute to their solutions in unexpected ways.\nGreat communicators – if you can’t spread your message, you can’t deliver results.\nSelf-starters – We want people who don’t wait for direction; they find the next task and get started.\nReady learners – We want people who are excited to add another tool to their repertoire.\nAdaptable – We look for people who find the right context and right solution for the task at hand.\nTech savvy – REVIT, Adobe CC, Bluebeam are all musts.\n\nWHAT’S NEXT\n\nIf you’re excited, we’re excited! Please click the APPLY button below. We’ll be in touch soon with next steps. Our process usually encompasses a couple rounds of interviews and an opportunity to chat informally with a group of potential peers.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Designer","company_name":"Huckabee","company_location":"Austin, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$74K - $93.8K a year is Indeed's estimated salary for this role in Austin, TX.\nReport inaccurate salary\n\nHuckabee is one of the fastest growing A/E firms in the nation and one of the top educational design firms. We are a mission-driven company that is dedicated to the success of all students. What we do matters, which is why we look for people who share our passion for changing the world through design and who want to create an impact of excellence on education. If you are ready to join our movement, reach out!\n\n\n\n\nCurrently we are accepting resumes for a talented, Senior Designer with a minimum of 15+ years experience working in the commercial architectural field to join our team. Preferably including a minimum of 5 to 10 years as a senior designer on a range of education projects. The position will offer the candidate opportunities to grow within the firm and thrive in an innovative, fast-paced, and highly collaborative environment mentoring design professionals. Educational facility experience is a plus. At Huckabee, the Senior Designer is a design leadership focused role, providing design creativity, development, quality and mentorship.\n\n\n\n\nRESPONSIBILITIES\n\nMentor, train and inspire all project team members on the thinking and use of our firm’s design tenets, philosophy and principles\nResearch design and educational trends and apply them within the design solutions along with educating clients and project team members\nLead, create, coordinate and review the on-going design process and its related activities for assigned projects\nLead, create and review all design concepts and detailed solutions, in the form of in-person and virtual critiques, group collaboration and all forms of design review, to assure thoughtful and creative design is acomplished\nFacilitate design charrettes with stakeholders by leading and creating the production of the design concepts and solutions while soliciting contributions from all involved\nReview all design imagery and graphic content, re-assuring that it conveys design intent and quality\nReview and coordinate with all project teams for the development of client presentations\nLead conversations with the client in partnership with other project leadership to develop design solutions that meet client expectations\nWork closely with Design Directors, to collectively align and communicate firm wide design standards, design vision and goals\nLead design effort and client presentations, support client relationships\nResolve complex design issues with innovative and practical solutions\nParticipate in firm marketing, industry events and project interviews\n\n\n\nREQUIREMENTS\n\nActive registered architectural licensure required\nExperience in a quality control effort in an architectural firm required\nExperience as a mentor and educator to architectural staff required\nInstitutional facilities experience required; educational facilities experience preferred\nProficiency in the use of 2D/3D software, including, AutoCAD, Formit, Sketchup, BIM 360, PhotoShop, InDesign and Illustrator required and Revit preferred\nProficiency in hand drawing (sketching) 2D/3D with team members and clients required\nKnowledge of materials, construction techniques, and building codes\nStrong presentation skills\nStrong organizational skills and the ability to work on multiple projects at the same time\nHiring Insights\nJob activity\nPosted 30+ days ago"}]