[{"job_title":"Architect - Mid Level","company_name":"Gensler","company_location":"San Antonio, TX 78205 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$84.5K - $107K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nFull Job Description\nYour Role\nAs a Gensler Architect, your job is to combine creativity and technical knowledge with business skills and understanding to help guide our clients. You have experience in the design and execution of a variety of project types, and have developed communication and team-building skills which have prepared you to manage projects. In this role, you will have opportunities to develop your existing strengths in design and technical coordination while also beginning to directly manage client relationships.\nWhat You Will Do\nPerform technical design assignments that include programming client needs, diagramming and modeling conceptual strategies, developing conceptual designs into technical studies, and construction documentation\nEngage directly with clients in the development of contracts, scheduling of the design process, preparation of consultant RFPs, and coordination with client stakeholders to assure approvals\nManage client, team and project coordination, including full documentation coordination with engineering and specialty consultants\nSupport communication between project team, clients, vendors, contractors, consultants, and building and permitting officials\nProvide design support and documentation during completion and execution of design concepts\nWork with external consultants, product representatives, furniture dealers, and fabricators\n\nYour Qualifications\nProfessional degree in Architecture, demonstrated with a rigorous portfolio\nMust be a licensed architect\n8+ years of relevant architectural experience, with a strong background designing multiple building typologies of varying scale\nProficiency in Revit\nProficient and confident in public-speaking, and in moderating large teams of consultants, contractors, and clients\nExcellent analytical and problem solving skills\nOutstanding graphic presentation skills\nAbility to develop collaborative relationships across the firm, with clients, and with other key constituents\nTO BE CONSIDERED, PLEASE SUBMIT CURRENT PORTFOLIO AND/OR WORK SAMPLES IN PDF FORMAT*\n*This is not a remote position. The successful candidate is expected to be in the San Antonio office.*\nLife at Gensler\nGensler is committed to\nDiversity, Equity and Inclusion\n. Through our Five Strategies to Fight Racism, we continue to create a just and equitable future for our colleagues and our communities with our clients. We are a solid voice for social change as we impact people’s lives and fight racism. At Gensler, we celebrate diversity and are committed to creating an inclusive workplace environment.\nAs a people-first organization, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.\nWe encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"Jacobs","company_location":"San Antonio, TX 78202 \n(Dignowity Hill area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$77.3K - $97.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\nAt Jacobs, we’re transforming intangible ideas into innovative solutions designing the future – today.\n\nWe’re seeking a Project Architect to join our team in Central Texas. Someone who can build their experience in the industry and apply it to today’s challenges.\n\nYou’ll research, program, plan, design, and detail, building projects for clients, applying knowledge of architectural design, zoning and building codes, building systems and materials for our clients.\n\nWorking together, we’ll help you grow and pursue what fulfills you so that we can make impacts on the future – big and small, global and local. Your role will include participating in large teams and leading smaller teams of architecture staff on projects to produce project documentation, performing and/or assisting in the construction administration phase of projects, maintaining firm-wide documentation procedures and standards, working closely with technical leadership and engineering discipline leads to understand design intent and goals for successful implementation for various facility design projects.\n\nYour most impactful mission in this role is to embrace living inclusion every day and enabling diversity and equality globally. For us, this means creating a culture of belonging where we all thrive by embracing all perspectives. An inclusive culture with many perspectives through diverse backgrounds allows us to leverage knowledge, leadership and connection to bring forth opportunity, creativity and growth.\n\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other. Design your career with a company that inspires and empowers you to deliver your best work so you can evolve, grow, and succeed.\n\n#bia\n\nHere’s What You’ll Need:\n\nBachelor’s Degree in Architecture from an accredited program\nProfessional Registered Architect (RA)\nDemonstrated professional relevant experience for buildings related design projects\nStrong organizational skills to help facilitate multiple tasks at one time, communication (both verbal and written) skills, creative problem-solving abilities, client relationship building skills, and desire to develop leadership abilities\nEffectively communicate and collaborate with design team and consultants\nAbility to support project manager in forecasting project schedules, hours and budget.\nDemonstrated program experience in the usage of Revit, SketchUp, basic rendering and publishing program\nFamiliarity with building code requirements\n\nIdeally, You'll Also Have:\n\nMaster’s in Architecture\nRenovation and new construction experience\nExperience in large scale semi-conductor facilities, electronics vehicle manufacturing facilities, higher education,\nand government work\nExperience on fast-track, accelerated project delivery\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect - San Antonio","company_name":"Marmon Mok","company_location":"San Antonio, TX 78209\n+1 location","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$71.6K - $90.7K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nFull Job Description\n\nMarmon Mok, a leading Texas architectural practice, will be expanding our San Antonio architectural team and seeks a talented individual with demonstrated experience.\n\n\nArchitect\n\n\nThis position requires strong understanding of building systems, and delivery methods. Ability to work in a team environment with consultants and maintain client communications and expectations. Architectural registration required; LEED AP preferred.\n\n\n\n\nResponsibilities:\n\nAssist in preparation of drawings for schematic design, design development, and contract documents.\n\nEmphasis will be on the knowledge of building systems and ability to develop documents in Revit.\n\n\n\n\nApply knowledge of the organization and preparation of construction documents in Revit for the preparation of pricing and bidding packages.\n\n\n\n\nCommunication with other Marmon Mok team members including specification writers to identify appropriate building systems and incorporate the requirements in the technical documentation.\n\n\n\n\nAssist with or have direct responsibility for reviewing and translating client design criteria, standards and project requirements from document preparation through installation.\n\n\n\n\nBe responsible for the complete integration of design and technical aspects of the project.\n\n\n\n\nApply knowledge and experience in services during Bidding and Construction Administration.\n\n\n\n\nSkill Set:\n\nProfessional Architectural degree and license\n5-10 years of experience\nKnowledge of project design process, construction documentation, and administration\nEffective verbal and written communication skills\nStrong organization\nCollaborative and professional\nRevit\nInDesign, Word, Excel\n\n\n\nMarmon Mok/Metroplan, Inc. is an Equal Opportunity Employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Designer","company_name":"VLKArchitects","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$63.9K - $80.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nProject Designer (San Antonio)\nSan Antonio\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Design Architect for our Education and Commercial market sectors due to the high growth and expansion we are experiencing. This position will lead the design process of a project, from preliminary planning through design development. They will work alongside the project team to oversee the implementation of the design throughout the construction document and construction administration phase to ensure the design intent is met. The ideal candidate for this position should be well-versed in all phases of design of K-12 schools, higher education, mixed-use developments, and corporate environments. This position will require creativity and strong organizational skills to find innovative solutions that exceed client expectations.\n\nRESPONSIBILITIES\n\nCoordinates design efforts during all phases of a project including bond planning, master planning, programming, schematic design, design development, construction documents, specifications, and construction administration.\nDevelops presentation strategies.\nCommunicates design ideas through hand sketching, 3D computer renderings, and verbal presentation skills.\nCoordinates with consultants, contractors, fabricators, specification writers, and design team members.\nMust work well in a collaborative environment and be able to respond to design needs from multiple project Architects, Directors, and firm Principals.\nServes in a mentoring role for emerging professionals.\nParticipates in interview presentations, trade show conventions and general marketing efforts.\nAbility to manage the design process of several concurrent projects.\n\nREQUIREMENTS\n\nAcademic/Professional:\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect or pursuing licensure\n\nCompetencies:\n\nDocumented experience leading and mentoring project teams.\nSelf-motivated, team player with excellent verbal and graphic communication skills\nAdept organization skills\nAbility to work well under pressure and just work accordingly to meet quick deadlines\nKnowledge of current educational trends and how school facilities can respond to them\nKnowledge of building codes\n\nPhysical Requirements:\n\n\n\nWhile performing this job, the employee is regularly required to talk or hear\nThe employee frequently is required to sit or stand for long periods of time; walk; use hands to finger, handle or feel; and reach with hands or arms\nThe employee will occasionally climb ladders to review conditions at job site and occasionally lift up to 25 lbs\n\nExperience:\n\nMinimum of 8 years of experience working in an Architecture firm and at least 3 years leading projects\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with Revit preferred\nRelevant experience with architectural modeling and graphic software, including but not limited to Enscape, 3DS Max, AutoCAD, Adobe Photoshop & InDesign, Bluebeam, and MS Office\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to Charles Johnson cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect","company_name":"Huckabee","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$63.9K - $80.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nProject Designer (San Antonio)\nSan Antonio\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Design Architect for our Education and Commercial market sectors due to the high growth and expansion we are experiencing. This position will lead the design process of a project, from preliminary planning through design development. They will work alongside the project team to oversee the implementation of the design throughout the construction document and construction administration phase to ensure the design intent is met. The ideal candidate for this position should be well-versed in all phases of design of K-12 schools, higher education, mixed-use developments, and corporate environments. This position will require creativity and strong organizational skills to find innovative solutions that exceed client expectations.\n\nRESPONSIBILITIES\n\nCoordinates design efforts during all phases of a project including bond planning, master planning, programming, schematic design, design development, construction documents, specifications, and construction administration.\nDevelops presentation strategies.\nCommunicates design ideas through hand sketching, 3D computer renderings, and verbal presentation skills.\nCoordinates with consultants, contractors, fabricators, specification writers, and design team members.\nMust work well in a collaborative environment and be able to respond to design needs from multiple project Architects, Directors, and firm Principals.\nServes in a mentoring role for emerging professionals.\nParticipates in interview presentations, trade show conventions and general marketing efforts.\nAbility to manage the design process of several concurrent projects.\n\nREQUIREMENTS\n\nAcademic/Professional:\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect or pursuing licensure\n\nCompetencies:\n\nDocumented experience leading and mentoring project teams.\nSelf-motivated, team player with excellent verbal and graphic communication skills\nAdept organization skills\nAbility to work well under pressure and just work accordingly to meet quick deadlines\nKnowledge of current educational trends and how school facilities can respond to them\nKnowledge of building codes\n\nPhysical Requirements:\n\n\n\nWhile performing this job, the employee is regularly required to talk or hear\nThe employee frequently is required to sit or stand for long periods of time; walk; use hands to finger, handle or feel; and reach with hands or arms\nThe employee will occasionally climb ladders to review conditions at job site and occasionally lift up to 25 lbs\n\nExperience:\n\nMinimum of 8 years of experience working in an Architecture firm and at least 3 years leading projects\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with Revit preferred\nRelevant experience with architectural modeling and graphic software, including but not limited to Enscape, 3DS Max, AutoCAD, Adobe Photoshop & InDesign, Bluebeam, and MS Office\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to Charles Johnson cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"LPA, Inc.","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$95.3K - $121K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nLPA is seeking a passionate Project Architect to join our integrated team of architects, engineers, interior designers, landscape architects and master planners. Our San Antonio studio is continuing to grow, and you’ll have the opportunity to be a central part of our development. You will have the opportunity to collaborate with team members across studios on projects that are both local and across Texas and California. Our clients are both public and private and represent nine different market segments allowing your career to take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic, and social impact.\nWe’re committed to diversity, wellness, and work-life balance which is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nAs a studio we work hard, have fun, and strive for excellence. We are looking for teammates who have the same drive and hustle.\nYou will be working with directors and principals in the studio and across the firm. We are looking to you to help us continue to develop our talented designers and engineers.\nWhat will you do:\nYou will lead, craft, and execute the project documentation and contract administration on projects\nLead the technical execution from concept design and documentation process with your team of designers and engineers\nWork in unison with the Project Designer and Project Manager and lead the realization of the project\nOversee documentation for schematic design, design development and construction documents\nQuality control research for product and construction methods related to projects\nLead the construction administration process\nCultivate and maintain excellent relationships with clients, builders, governing authorities, stakeholders, and team members\nMentor your team members and help to train and upskill them\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration including Catapult and LPA Foundation\nProject Architect Requirements:\nBachelor’s or Master’s Degree in Architecture required\n10+ years of experience in all phases of architectural projects\nStrong Revit knowledge\nExpertise in building codes and construction as it relates to design and construction services\nArchitectural license required\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness, and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Project Architect","company_name":"Jasmine Engineering Incorporated","company_location":"San Antonio, TX 78205 \n(Downtown area)","salary_range":"$50,000 - $85,000 a year\n Employer est.","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$95.3K - $121K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nLPA is seeking a passionate Project Architect to join our integrated team of architects, engineers, interior designers, landscape architects and master planners. Our San Antonio studio is continuing to grow, and you’ll have the opportunity to be a central part of our development. You will have the opportunity to collaborate with team members across studios on projects that are both local and across Texas and California. Our clients are both public and private and represent nine different market segments allowing your career to take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic, and social impact.\nWe’re committed to diversity, wellness, and work-life balance which is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nAs a studio we work hard, have fun, and strive for excellence. We are looking for teammates who have the same drive and hustle.\nYou will be working with directors and principals in the studio and across the firm. We are looking to you to help us continue to develop our talented designers and engineers.\nWhat will you do:\nYou will lead, craft, and execute the project documentation and contract administration on projects\nLead the technical execution from concept design and documentation process with your team of designers and engineers\nWork in unison with the Project Designer and Project Manager and lead the realization of the project\nOversee documentation for schematic design, design development and construction documents\nQuality control research for product and construction methods related to projects\nLead the construction administration process\nCultivate and maintain excellent relationships with clients, builders, governing authorities, stakeholders, and team members\nMentor your team members and help to train and upskill them\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration including Catapult and LPA Foundation\nProject Architect Requirements:\nBachelor’s or Master’s Degree in Architecture required\n10+ years of experience in all phases of architectural projects\nStrong Revit knowledge\nExpertise in building codes and construction as it relates to design and construction services\nArchitectural license required\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness, and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Senior Architect - Development Services Airport Team **NEW PAY RATE**","company_name":"City of San Antonio","company_location":"San Antonio, TX 78204 \n(Lone Star area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$80K - $101K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nFull Job Description\nCompany Description\n\n\nThe City of San Antonio's mission is to deliver quality City services and commit to achieve San Antonio's vision of prosperity for our diverse, vibrant, and historic community.\n\nOur approximately 12,000 employees are critical in the delivery of quality services to the residents of the City of San Antonio. The commitment our employees demonstrate to their jobs and to the advancement of the City's goals is the key to our success in mission accomplishment.\n\nThe City of San Antonio has identified four core values - Teamwork, Professionalism, Integrity, and Innovation - to efficiently and effectively inspire, motivate, lead, develop and empower employees in order to serve the public economically, ethically, equitably, and continuously improve and promote the high performance of government.\n\nTo ensure commitment to these values and to further integrate them with our organizational mission and vision, it is imperative that we seek these behaviors in the people we hire.\n\n\n\nJob Description\n\n\nUnder direction, is responsible for performing professional work managing the development, review, and approval of the design and construction of airport buildings and facilities and providing management of other related City and high profile building projects as directed by the Development Services Plan Review Division. Working conditions are in an office or construction environment with occasional exposure to temperature extremes, traffic construction. Exercises functional supervision over assigned staff.\n\nFor more information and to submit your application, visit the City of San Antonio's website at: https://www.governmentjobs.com/careers/sanantoniotx/jobs/3754218\n\n\nWork Location\nDevelopment Services, 1901 S. Alamo St., San Antonio, Texas 78207\n\nWork Hours\n7:45 a.m. - 4:30 p.m., Monday - Friday\n\nESSENTIAL JOB FUNCTIONS:\n\nOversees the customer service initiatives and the mission of the Capital Improvements Management Services Department.\nDirects and participates in project development for one of the project management teams.\nEstablishes and supervises the setting of preliminary programs, budgets, and schedules to meet project needs and makes recommendations to the City Architect on the project delivery method.\nAssists with the consultant selection process and oversees and manages their work products; reporting to the City Architect any issues that will delay project delivery.\nReviews plans, specifications, cost estimates, and inspects sites during construction operations.\nOversees city staff and the consultants as they coordinate with contractors and client departments and communicates with various department representatives.\nDevelops reports and presentations on projects to city staff and the general public.\nOversees staff adherence to department policies on records and file management procedures.\nPrograms, designs, draws, and writes technical specifications for City projects.\nPerforms related duties and fulfills responsibilities as directed as required.\n\n\nQualifications\n\nBachelor's Degree from an accredited college or university.\nFive (5) years of increasingly responsible experience in architecture.\nValid Class 'C' Texas Driver's License.\nLicensed to practice as a Registered Architect in the State of Texas.\nMust obtain a license to practice in the State of Texas within one (1) year of employment.\n\nPreferred Qualifications\n\nExperience with oversight of large commercial design projects.\n\nAdditional Information\n\n\nFor more information and to submit your application, visit the City of San Antonio's website at: https://www.governmentjobs.com/careers/sanantoniotx/jobs/3754218\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Technical Designer","company_name":"PBK Architects","company_location":"San Antonio, TX 78216 \n(Airport area)","salary_range":null,"days_ago_posted":"Posted\nPosted 28 days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nHealth insurance\nOpportunities for advancement\nIndeed's salary guide\nNot provided by employer\n$62.3K - $78.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\n\nFor over 40 years, PBK has been a leader in architectural and engineering design solutions across the United States. We are constantly seeking the brightest and most talented minds to be part of our award winning firm. Here at PBK, we pride ourselves in providing the best in class programmers, planners, architects, engineers, and consultants to offer top notch customer service. We strive to make a positive impact for future generations with our actions today. Here’s your chance, are you ready to make a difference?\n\nDescription – Technical Designer\n\nThe Technical Designer is responsible for producing high quality construction documents. The Technical Designer can work in all phases of a project, including Schematic Design, Design Development, Construction Documents and Construction Administration. The Technical Designer will report to the Production Director.\n\nDuties will include but are not limited to:\n\nParticipate in the drawing architectural construction documents in Revit.\nAssemble plans, construction documents, and other information for permitting.\nCoordinate the preparation of construction documents with team members.\nAssist with the building of Revit models during the design phase.\nAssist architects and project managers during the construction administration phase.\n\nRequirements\n\nMust have an Bachelor’s or Master’s Degree in Architecture or related field.\n1-3 years of professional experience preferred.\nStrong problem-solving and teamwork skills.\nMust demonstrate proficiency in using Revit.\nStrong customer service skills.\nStrong organizational skills.\nCreativity, integrity, and initiative.\nAbility to work well under pressure, juggle and prioritize multiple projects and adjust work accordingly, often against tight deadlines.\nExcellent oral and written communication skills.\nA strong desire to excel and advance in a fast paced, challenging and client focused environment.\n\nThis is an excellent opportunity for professional growth and career advancement within an award winning architectural firm. We offer a highly competitive salary and benefits package. An aggressive, client oriented personality with a knack for creative problem solving will succeed in this position.\n\nFirm Background\n\nPBK has built a client base of more than 200 clients, a list that includes school districts, university systems, hospital systems and Fortune 500 corporations. PBK offers employees competitive wages, health care and 401K matching along with numerous opportunities to become involved in extra-curricular activities and organizations established through the firm. PBK has established a culture that has led to the firm being named to the list of “Best Places to Work.”\n\nHiring Insights\nJob activity\nPosted 28 days ago"},{"job_title":"Project Architect","company_name":"Alta Architects, Inc.","company_location":"San Antonio, TX 78204 \n(Lone Star area)","salary_range":"$57,063 - $112,722 a year\n Employer est.","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$57,063 - $112,722 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nFlexible schedule\nFlexible spending account\nShow 6 more benefits\nFull Job Description\n\nAlta Architects is currently seeking an experienced PROJECT ARCHITECT with the skills and aspiration to manage delivery of construction documents, while working under the direction of the Principal-in-Charge and Project Manager, on a wide range of project sizes.\n\nWHO WE ARE:\n\nAlta Architects, formerly Munoz & Company, is a multi-faceted and award-winning architectural design firm with more than 95 years of experience. We enjoy a diverse architectural practice that encompasses Large Public and Private work including Governmental, Institutional, Educational, Cultural, Corporate, Mix-use, and Multi-Family Housing. We have changed our name but not our passion for architecture.\n\nEXPERIENCE REQUIRED:\n\n5-10 years’ post grad experience with employment in Architectural firms, 3 years minimum managing architectural project delivery.\n\nPREFERRED EDUCATION & BACKGROUND:\n\nRegistration as a licensed Architect in the State of Texas preferred, at minimum a bachelor’s degree in Architecture from an accredited program.\n\nCANDIDATE REQUIREMENTS & RESPONSIBILITIES:\n\nCandidates should have strong graphic and verbal communication skills with a proven portfolio of work in related project types, and aspiration to further the firm’s grounding in culturally based design. Candidates with strong skills in project programming and design desirable. Broad knowledge of technical detailing, materials, and products for heavy commercial projects essential. Should be able demonstrate skills and experience with project management.\n\nResponsibilities will include overall management of the project delivery team including in-house support and outside consultants, overseeing preparation of design studies from concepts through CD’s, organization, and coordination of construction documents, directing and attending client meetings, and follow through management during bidding and construction administration. Ideal candidates will demonstrate a wide variety of abilities, including computer skills in Revit, AutoCAD, Photoshop, InDesign, SketchUp, and MS Office, as well as hand graphics and illustration, with the ability to interact positively with clients, consultants, general contractors, and our studio team are essential.\n\nWHAT ALTA CAN OFFER YOU:\n\n· A commitment to staff growth and professional development\n\n· Excellent compensation and benefits\n\n· A beautifully renovated office in the popular South Flores (SoFlo) neighborhood\n\n· Remote working opportunities\n\nBENEFITS:\n\n· Company Paid Employee Medical, Vision, Life and LTD Insurance\n\n· 10 Company Paid Holiday's + Company Wide Holiday Week Off\n\n· 2 Weeks Paid Vacation + 1 Personal Day\n\n· Matching 401(k)\n\n· Flexible Work Schedule\n\nCONTACT INFORMATION:\n\nAlta is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity, age, physical or mental disability, or covered veteran status.\n\nTo apply: Submit resume and portfolio samples in PDF format to jobs @alta-architects.com; with Job Code PA2022\n\nFor more information about Alta Architects visit our website at www.alta-architects.com\n\nJob Type: Full-time\n\nPay: $57,062.93 - $112,722.27 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nFlexible spending account\nHealth insurance\nLife insurance\nPaid time off\nProfessional development assistance\nRetirement plan\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Designer","company_name":"PBK Architects","company_location":"San Antonio, TX 78216 \n(Airport area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$72K - $91.2K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nFull Job Description\n\nDescription – Designer\n\nPBK is looking for a highly motivated and creative Designer who is ready to join our design team. You will be responsible for producing high quality project design deliverables in construction documents. You will work on any/all phases of development including Pre-Design, Schematic Design, Design Development, Construction Documents and Construction Administration. You will report to the Director/Principal/Associate Principal on tasks and deliverables to ensure the project is completed on time and within budget constraints.\n\nYour Impact:\n\nCreate innovative designs that can adapt to a variety of materials and situations meeting client requirements\nParticipate and lead design charrettes with clients and PBK staff\nGenerate detailed designs and facilitate the production process\nPrepare concept design, schematic design, and design development\nCommunicate design concepts verbally and visually\nWork collaboratively with the Design Leadership in establishing format, drawing assignments, deliverables, and schedules.\nFunction as a conduit between conceptual design process and architectural implementation\nSupervise and mentor teams of Designers assigned to project teams\n\nWhat You'll Need:\n\n5+ years of related design experience, preferably K-12 or Higher Education\nBachelor’s Degree in Architecture\nAdvanced proficiency in Photoshop, Sketchup, InDesign, Lumion and AutoCAD\nAbility to interact with senior management, external client organizations, and vendors\nStrong oral, written, and graphic English communication skills\nExcellent time-management and organizational skills\nAbility to self-edit work and command a high level of accuracy\n\nHow You'll Stand Out:\n\nDesign experience with large-scale commercial projects\nProficient in Revit\nLEED accredited\nHand sketching skills\n\n#OS #FT #AS\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architecture Project Manager","company_name":"LPA, Inc.","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 7 days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$94.7K - $120K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nLPA is seeking a passionate Project Manager to join our integrated team of architects, engineers, interior designers, landscape architects and master planners. Our San Antonio studio is continuing to grow, and you will be a central part of our development. You will have the opportunity to collaborate with team members across studios on projects that are both local and across Texas and California. Our clients are both public and private and represent nine different market segments allowing your career to take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic, and social impact.\nWe’re committed to diversity, wellness, and work-life balance which is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nAs a studio we work hard, have fun, and strive for excellence. We are looking for teammates who have the same drive and hustle.\nYou will partner directly with our clients, lead project teams, partake in interviews, attend conferences, and contribute to our growing team.\nWhat you will do:\nYou will be living and breathing the project from inception to completion\nYou will be responsible for meeting the project goals including integrated design and planning goals, budget, schedule, and project financial performance.\nYou will be the main client point of contact on your projects\nPrepare schedules, budgets, and work plan documents during all phases of the project\nReview contractual and financial construction administration documents\nReview research for product and construction methods related to projects\nMaintain excellent relationships with the clients, builders, governing authorities, stakeholders, and team members\nServe as the Architect of Record\nSigning and stamping, as a licensed professional, all project related documentation which has been prepared under the supervision and direction of the Project Manager or Managing Director\nMentor your team members and help to train and upskill them\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including licensure incentives, professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration including Catapult and LPA Foundation\nProject Manager Requirements:\nBachelor’s or Master’s Degree in Architecture\n10+ years of experience in all phases of architectural projects\nArchitectural license in Texas\nProficiency in Microsoft Project and Excel. Knowledge of Revit and Bluebeam preferred\nKnowledge in management of project business: scope, fee, schedule, work plans, and budget\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness, and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Architectural Associate","company_name":"Huckabee","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nIndeed's salary guide\nNot provided by employer\n$94.7K - $120K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nLPA is seeking a passionate Project Manager to join our integrated team of architects, engineers, interior designers, landscape architects and master planners. Our San Antonio studio is continuing to grow, and you will be a central part of our development. You will have the opportunity to collaborate with team members across studios on projects that are both local and across Texas and California. Our clients are both public and private and represent nine different market segments allowing your career to take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic, and social impact.\nWe’re committed to diversity, wellness, and work-life balance which is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nAs a studio we work hard, have fun, and strive for excellence. We are looking for teammates who have the same drive and hustle.\nYou will partner directly with our clients, lead project teams, partake in interviews, attend conferences, and contribute to our growing team.\nWhat you will do:\nYou will be living and breathing the project from inception to completion\nYou will be responsible for meeting the project goals including integrated design and planning goals, budget, schedule, and project financial performance.\nYou will be the main client point of contact on your projects\nPrepare schedules, budgets, and work plan documents during all phases of the project\nReview contractual and financial construction administration documents\nReview research for product and construction methods related to projects\nMaintain excellent relationships with the clients, builders, governing authorities, stakeholders, and team members\nServe as the Architect of Record\nSigning and stamping, as a licensed professional, all project related documentation which has been prepared under the supervision and direction of the Project Manager or Managing Director\nMentor your team members and help to train and upskill them\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including licensure incentives, professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration including Catapult and LPA Foundation\nProject Manager Requirements:\nBachelor’s or Master’s Degree in Architecture\n10+ years of experience in all phases of architectural projects\nArchitectural license in Texas\nProficiency in Microsoft Project and Excel. Knowledge of Revit and Bluebeam preferred\nKnowledge in management of project business: scope, fee, schedule, work plans, and budget\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness, and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 7 days ago"},{"job_title":"Project Architect","company_name":"VLKArchitects","company_location":"San Antonio, TX","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$77.3K - $97.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\n \nProject Architect (San Antonio)\nSan Antonio\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Project Architect in our San Antonio location due to the high growth and expansion we are experiencing. This position will manage the design and production process of a project, coordinate consultant documents, lead client meetings, and oversee the project team in the documentation of project deliverables. The ideal candidate has documented experience leading and mentoring project teams, has analytical problem-solving abilities, and is an organized individual.\n\nRESPONSIBILITIES\n\nCoordinate the implementation of design intent into construction documents, specifications, and construction administration. Working with the Project Director to develop and manage the project schedule, will oversee and manage the documentation process to ensure timely and profitable completion of the project.\nProvides input and support to the Project Designer during programming, schematic design, and design development phases.\nSubmit and obtain approval from Authorities Having Jurisdiction.\nAttend job site as required to stay current with construction progress and information related to duties during the construction phase of the project. Provide documentation for changes during construction phase and review submittals to ensure design intent is met.\nMonitor and direct the design team to delegate project duties and ensure feasibility of produced designs, including the architectural staff assigned and external consultants. Integrate and coordinate all disciplines into the building project. Lead team meetings to discuss project issues, technical issues, and coordination.\nMotivate and mentor the project design and development team to ensure timely and effective completion of projects, while also serving as a resource to leadership on practice issues, resource needs, and development.\n\nREQUIREMENTS\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect\nSelf-motivated, team player with analytical problem-solving abilities\nExcellent communicator with relationship management skills.\nWorks at a well under pressure and adjusts work accordingly to meet deadlines.\nResolves conflict effectively and encourages a healthy team environment.\nMinimum of 8 years of experience working in an Architecture firm, 3 years leading projects.\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with relevant software, including Revit, AutoCAD, Bluebeam, Adobe products, MS Office, and MS Teams.\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Residential Land Development CAD Technician / Designer","company_name":"ESP Associates","company_location":"San Antonio, TX 78216","salary_range":null,"days_ago_posted":"Posted\nPosted 15 days ago","job_description":"Benefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 2 more benefits\nIndeed's salary guide\nNot provided by employer\n$77.3K - $97.9K a year is Indeed's estimated salary for this role in San Antonio, TX.\nReport inaccurate salary\nProject Architect (San Antonio)\nSan Antonio\n\nMARKET SEGMENT\n\nVarious\n\nOVERVIEW\n\nVLK Architects is seeking a Project Architect in our San Antonio location due to the high growth and expansion we are experiencing. This position will manage the design and production process of a project, coordinate consultant documents, lead client meetings, and oversee the project team in the documentation of project deliverables. The ideal candidate has documented experience leading and mentoring project teams, has analytical problem-solving abilities, and is an organized individual.\n\nRESPONSIBILITIES\n\nCoordinate the implementation of design intent into construction documents, specifications, and construction administration. Working with the Project Director to develop and manage the project schedule, will oversee and manage the documentation process to ensure timely and profitable completion of the project.\nProvides input and support to the Project Designer during programming, schematic design, and design development phases.\nSubmit and obtain approval from Authorities Having Jurisdiction.\nAttend job site as required to stay current with construction progress and information related to duties during the construction phase of the project. Provide documentation for changes during construction phase and review submittals to ensure design intent is met.\nMonitor and direct the design team to delegate project duties and ensure feasibility of produced designs, including the architectural staff assigned and external consultants. Integrate and coordinate all disciplines into the building project. Lead team meetings to discuss project issues, technical issues, and coordination.\nMotivate and mentor the project design and development team to ensure timely and effective completion of projects, while also serving as a resource to leadership on practice issues, resource needs, and development.\n\nREQUIREMENTS\n\nProfessional degree in Architecture from a NAAB accredited University\nRegistered Architect\nSelf-motivated, team player with analytical problem-solving abilities\nExcellent communicator with relationship management skills.\nWorks at a well under pressure and adjusts work accordingly to meet deadlines.\nResolves conflict effectively and encourages a healthy team environment.\nMinimum of 8 years of experience working in an Architecture firm, 3 years leading projects.\nExperience in K-12, Higher Ed, and Commercial market sectors is preferred\nProficiency with relevant software, including Revit, AutoCAD, Bluebeam, Adobe products, MS Office, and MS Teams.\n\nVLK Architects offers competitive compensation and comprehensive benefits such as generous medical/dental/vision insurance, life insurance, 401(k) plan with employer match, paid vacation and holidays, profit-sharing, and more. Please e-mail your resume to cjohnson@vlkarchitects.com. No phone calls please. VLK Architects is an equal opportunity employer.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"}]