[{"job_title":"Architectural Project Manager (Healthcare Market)","company_name":"Anderson Brulé Architects","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":"From $100,000 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\nFrom $100,000 a year\nJob Type\nFull-time\nQualifications\n\nArchitectural: 6 years (Required)\n\nProject Management: 2 years (Required)\n\nHCAI/OSHPD: 2 years (Required)\n\nWork authorization (Required)\n\nBachelor's (Preferred)\n\nRevit: 1 year (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\nAD&D insurance\nDental insurance\nDisability insurance\nEmployee assistance program\nEmployee discount\nShow 11 more benefits\nFull Job Description\n\n**Please apply only if you meet the architectural education and experience requirements listed at the end of this post and are located within the San Francisco Bay Area, as this position will require time in our San Jose office. Experience and interest in managing projects in the healthcare market is required.**\n\nWould you like to revitalize your career and apply your passion to making positive differences in your community? If so, Anderson Brulé Architects, selected as the Firm of the Year by the AIA Silicon Valley, is currently seeking a Project Manager (Healthcare Market) to join our firm.\n\nABA is a thriving, creative and successful architecture, planning and interior design firm – delivering the highest quality services for over 35 years. The scope of services we offer ranges from pre-project planning through post-occupancy evaluations. ABA is committed to assisting clients in improving their own culture, environment, operation, function and organization. Our motto: Do Good, Exceptionally Well, by Design – means we see our services to our community, health and wellness, education and residential clients as fundamental to making our world better.\n\nYour key responsibilities and opportunities to learn the daily processes involved in running an architectural/design office which may include:\n\nBusiness Development\n\nMeet with potential clients to develop relationships and determine client needs, draft fee proposals, and coordinate creative solutions\nTransform leads into project opportunities through proactive business development and follow up measures\nMaintain existing client relationships while developing new ones\n\nTechnical\n\nEstablish project goals, prepare budgets and schedules, and monitor adherence to contract terms\nCollaborate with team members and consultants\nResearch and prepare feasibility studies, master plans, and reports\nPerform preplanning through construction administration services\nKnowledge of working drawings, building codes, specifications, and construction standards\nDevelop and maintain knowledge of industry trends, products, and installation types\n\nPractice Leadership\n\nResponsible for client relationship and management\nResponsible for planning, coordinating, and managing multiple projects through all phases of development\nLead design efforts and direct staff production to effectively meet client goals, budgets and deadlines\nResponsible for communication with other disciplines, vendors, and contractors to ensure incorporation of all information into project requirements and provide support as necessary\nProvide support and mentoring to all team members for specific field, style, or phase of architectural expertise\n\nEducation and experience requirements are:\n\nLicensed Architect in California\nLEED accreditation is desired\n8+ years of architectural experience with recent experience in Healthcare. HCAI/OSHPD experience is important. Experience in Education and Community markets professionally is a plus.\n2-3 years of related experience in Project Management\nRevit/AutoCAD and MS Office proficiency\nExperience in sustainable design, integrated design and LEED guidelines\nAbility to prioritize workload, multi-task between projects and maintain organization in a changing environment\nWorking knowledge of building codes and other regulatory requirements\nAdvanced knowledge of design techniques, tools, and principles involved in production of technical plans, blueprints, drawings, and models\nProven ability to meet deadlines, adhere to budgetary goals and provide high quality service to clients\nExcellent oral, written and presentation communication skills\n\nBenefits of being an ABA Employee:\n\nMedical, Dental, & Vision\nLife, AD&D, and Long-Term Disability Insurance\n401(k) Profit Sharing Plan\nSection 125 Healthcare & Dependent Care Flexible Spending Account Option\nPTO\nPaid Holidays\nAnnual Professional Education & Training Allowance\nReimbursement for Professional Exams and Certifications\nQuarterly Professional Development Assistance with a Senior Leader of the firm\nMonthly Parking Allowance\nPerformance-Based Bonuses\nHybrid, Flexible Work Schedule available\n\nABA is an equal opportunity employer M/F/D/V.\n\nPlease submit resume, cover letter, work samples, and salary requirements.\n\nJob Type: Full-time\n\nPay: From $100,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nProfessional development assistance\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nCOVID-19 considerations:\nVaccinations or medical/religious exemption required.\n\nAbility to commute/relocate:\n\nSan Jose, CA 95121: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nRevit: 1 year (Preferred)\nArchitectural: 6 years (Required)\nProject Management: 2 years (Required)\nHCAI/OSHPD: 2 years (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"V.R.E Design","company_location":"San Jose, CA 95131 \n(North Valley area)","salary_range":"$85,000 - $150,000 a year","days_ago_posted":"Employer\nActive 8 days ago","job_description":"Job details\nSalary\n$85,000 - $150,000 a year\nJob Type\nFull-time\nQualifications\n\nRevit: 5 years (Required)\n\nSketchup: 5 years (Required)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nOpportunities for advancement\nPaid time off\nShow 2 more benefits\nFull Job Description\n\nProject Architect (Intermediate/Senior level, multiple positions)\n\n5-15 years of project architect experience in residential and commercial projects, able to work independently on entitlement and permitting submittals.\nProficiency with Revit and AutoCAD is required.\nProfessional degree in Architecture (B. Arch required)\nProfessional license preferred but not required.\n\nAs one of the fastest growing developers in the bay area, we offer competitive salary, steady projects, collaborative working environment and opportunity to advance your professional career together with the company.\n\nJob Type: Full-time\n\nPay: $85,000.00 - $150,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nPaid time off\nRelocation assistance\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nSan Jose, CA 95131: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nRevit: 5 years (Required)\nSketchup: 5 years (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 2 candidates for this role\n\nUrgently hiring\n\nJob activity\nEmployer reviewed job 8 days ago\nPosted 30+ days ago"},{"job_title":"Architect - Industrial","company_name":"Nelson Worldwide","company_location":"Hybrid remote in San Jose, CA 95126","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$84.7K - $107K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nWe are currently seeking a highly motivated and team-oriented Architect to work in our Industrial practice. The Architect must demonstrate leadership qualities and a collaborative approach to the successful production of design and/or construction documents. Candidates should demonstrate experience in all aspects of the design process including Programming, Master Planning, Conceptual, Schematic and Design Development presentations, 3D modeling, and the technical proficiency to successfully implement designs through the CD/CA phases. Responsibilities would include participation in design phase activities and coordinating with clients, consultants, and contractors throughout the project.\n\nResponsibilities, not limited to:\n\nLeadership:\n\nAssist project team with design and technical questions during the project.\nShare knowledge with the entire studio and be a resource to the entire NELSON staff\nBe a mentor to staff, including interns\nDirect a team of Teammates\n\nProject Delivery:\n\nAssist with proposal and contract documents\nContribute to the work plan for each project\nPrepare and oversee the preparation of Concept, Schematic Design, Design Development and Construction Documents\nConduct field survey as required\nGenerate overall project design concepts\nDevelop and/or oversee the development of design concepts into complete design development set and further advance into complete construction drawings\nOversee material research and compilation of project data and incorporation throughout the project\nPrepare project specifications\nCommunicate with project team members and resolve drawing discrepancies independently\nCoordinate and incorporate work of internal and external project consultants\nOversee the preparation of Addenda and Bullentin documentation\nReview Shop Drawings\nReview, respond to and track RFI's\nAttend construction meetings, make periodic site observation visits as required by contract\nPrepare and update punch lists as required\nAdhere to NELSON standards in the preparation of deliverables\nReview and correct your own work and works of the project team including both internal & external consultants following established QA procedures\nReview and understand applicable building codes and other standards (including Accessibility Standards)\nPrepare zoning and building code analysis and review\nAssist with the timely submittal of drawings to the appropriate authorities having jurisdiction\nOversee the maintenance and archiving of electronic project files\nUnderstand project scope and identify items that are beyond the original scope of services and bring attention to Team Lead\nDraft Client Agreement change orders and Sub Consultant agreement change ordered as directed by Team Leader\nPrepare meeting agendas, meeting minutes, phone conversation notes, etc. to document the process of the project and directions received from the Client.\nAttend project meetings\nShare knowledge with other teammates and assist team with design and/or detailing challenges\n\nClient Relationships:\n\nMaintain secondary client contact as back up to primary contact\n\nBusiness Development:\n\nAssist in secondary marketing by maintaining good working relationships with Client contacts\nAttend interviews as requested by Team Leaders, Studio or Managing Directors\n\nQualifications:\n\nMin. 8-15 years of industry experience\nBachelor's degree in Architecture or Interior Design from an accredited university\nLicensure: Registered Architects or individuals seeking registration preferred\nExpertise in AutoCAD, Revit, SpecLink,, Newforma, SketchUp, Photoshop and InDesign\nAdvanced knowledge of building life safety and ADA codes\nAptitude to communicate ideas and direction quickly\nStrong leadership, organization, communication and relationship management skills\n\n#LI-MV1\n\n#INDArch\n\n\n\n\n#LI-Hybrid\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Design Studio Director","company_name":"Designminds","company_location":"Santa Clara, CA 95050","salary_range":"$150,000 - $190,000 a year","days_ago_posted":"Posted\nPosted 21 days ago","job_description":"Job details\nSalary\n$150,000 - $190,000 a year\nJob Type\nFull-time\nQualifications\n\nInterior Design: 10 years (Required)\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nShow 3 more benefits\nFull Job Description\n\nLocation: Santa Clara, CA (hybrid office schedule)\n\nOverview\n\nAre you ready to thrive in a dynamic, fast paced, forward thinking, growing organization!\n\nPosition Summary: The Design Studio Director is responsible for establishing and achieving strategic goals for the California design team. Customer engagement and success is a key priority in addition to the day-to-day leadership and management of individual design teams and their businesses.\n\nA minimum of 10 years of Design experience desired.\n\nResponsibilities:\n\nOrganizational leadership responsibilities include Design Team network and market development, customer and A&D partner relationship development and management, enterprise-wide influence.\nResponsible for organizational and divisional performance and outcomes.\nSets organizational budgets, goals, policies, processes, objectives, and strategic plans.\nOversees organizational and divisional metrics to ensure profitability and achievement of financial goals.\nDrives standardization, process improvement, and quality assurance.\nDirects major design initiatives & participate in enterprise initiatives as needed.\nOversees divisional workloads, workflow, and project assignment.\nProvides mentorship and thought leadership.\nDrive a “Consultative Design Approach”.\nPartners at a leadership level with clients, consultants, partners, and influencers.\nLeads internal and external projects and process improvement initiatives.\nPartners with Sales Leadership and teams to ensure flawless execution of design services.\nOrganizes meetings and meet with key customers and stakeholders, as well as serve as customer point of contact.\nAttend industry events and peer networking opportunities.\nDevelops peer level relationships with A&D leaders and customer stakeholders.\n\nMembership in industry professional organizations required.\n\nQualifications:\n\nEducation/Experience\n\nBachelor’s Degree from a four-year college or university. Associate Art’s Degree or equivalent from a two-year college or technical school will be considered.\nA minimum of 10 years of Design experience desired.\nCouncil for Interior Design Accreditation (CIDA) or National Architecture Board (NAB) accreditation preferred.\nTwo or more professional certifications desired (NCIDQ, CID, LEED AP, WELL AP, EDAC, 6 Sigma, PMI, etc.)\nPrior experience with system furniture products a plus.\n\nKnowledge/Skills/Abilities\n\nMastery of commercial furniture products and systems furnishings.\nMust have basic knowledge of financial and strategic planning.\nAbility to apply ancillary furnishing and décor and understanding of design thinking methodology.\nKnowledge of state and local building codes, regulations, ADA, Egress, Occupancy and compartmentalization.\nKnowledge of interior design principles, to include: texture, color, form, function, materiality balance, rhythm, repetition, proximity, symmetry, biophilia, historical precedent, sustainability.\nAdvanced proficiency in a variety of software; AutoCAD, SketchUP, Adobe Creative Suites (Photoshop, Illustrator, In-Design, Premier).\n\nBenefits Include:\n\n15 days of PTO\n8 Paid holidays\nMedical/Dental/Vision Insurance\n401k + Employer Match\nWellness App with reimbursement of up to $500/year\nProfit Sharing\n\nJob Type: Full-time\n\nPay: $150,000.00 - $190,000.00 per year\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nSupplemental pay types:\n\nBonus pay\n\nAbility to commute/relocate:\n\nSanta Clara, CA 95050: Reliably commute or willing to relocate with an employer-provided relocation package (Required)\n\nExperience:\n\nInterior Design: 10 years (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nUrgently hiring\n\nJob activity\nPosted 21 days ago"},{"job_title":"Architect","company_name":"Salas O'Brien","company_location":"San Jose, CA 95112 \n(Downtown area)","salary_range":"$90,000 - $100,000 a year","days_ago_posted":"Posted\nPosted 20 days ago","job_description":"At Salas O’Brien we tell our clients that we’re engineered for impact. This passion for making a difference applies just as much to our team as it does to our projects. That’s why we’re committed to living our values every day: inspiring, achieving, and connecting as shared owners of our success with a focus on a sustainable future.\nBuilding for the long-term means that all of our team members can expect to work on amazing projects with a people-first approach to problem solving. It also means that each member of our team has truly limitless potential to build a unique, meaningful, and high-impact career—and they’ll receive great total rewards along the way.\nAbout Us:\nFounded in 1975, Salas O’Brien is an employee-owned engineering and professional services firm focused on achieving impact for our clients, our team, and the world. We know that tomorrow’s requirements are today’s opportunities, and we are here to design lasting solutions for pressing challenges.\nWe work across a variety of industries providing integrated engineering and consulting services. Our specialized experience includes design for data centers, healthcare, science and technology, high-rise buildings, clean energy, education, and other building types as well as structural and building sciences, infrastructure asset management, advanced robotics, and more.\nOur technical expertise is paired with an exceptional team of business development, human resources, finance and accounting, information technology, and marketing professionals, all of whom play a key role in bringing our commitments to life every day.\nPosition:\nOur office in San Jose is looking for a Design Architect to join our growing company. We are looking for qualified individuals to:\nProduce architectural and roofing drawings in AutoCAD.\nStrong familiarity with design and production of construction drawings and architectural construction details.\nFamiliarity with coordinating with mechanical, and electrical building systems is desirable.\nWorking with Engineers and CAD/Revit designers to generate complete construction drawings per company standards\nQualifications:\nTo succeed in this role, you must meet the following basic requirements:\nMinimum AIA, Licensed Architect preferred.\nDemonstrate a high level of proficiency with AutoCAD 2018 or newer. Revit is a plus.\nMinimum of 5 years of experience\nExtremely high level of attention to detail and accuracy\nConstruction experience is highly desirable.\nStrong time-management skills and an ability to prioritize and execute requests effectively\nExcellent organizational, written, and verbal communication skills\nHigh energy, ability to multi-task, work independently, and assume responsibility\nAbility to work with different personalities and varying levels of experience in the firm\nMicrosoft Office (Excel, Word, Outlook) and Blue Beam proficiency\nEqual Opportunity Employment Statement\nSalas O’Brien provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, colour, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state/provincial, or local laws. Salas O’Brien will accommodate the disability-related needs of applicants as required by law.\nHiring Insights\nJob activity\nPosted 20 days ago"},{"job_title":"Architect/Designer","company_name":"AlphaX RE Capital","company_location":"San Jose, CA 95128 \n(Willow Glen area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nDental insurance\nHealth insurance\nReferral program\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$72.1K - $91.3K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nWe are looking for a right-brained Architect to perform all phases of architectural work including planning, designing and overseeing the construction. You will be involved in new building designs, extensions, alterations, restorations and conservations from the earliest stages right through to completion. The goal is to match client’s needs and to produce sustainable, functional and aesthetically pleasing designs.\n\nResponsibilities:\n\nControl project from start to finish to ensure high quality, innovative and functional design\nTake the “brief” to identify clients’ needs and put together feasibility reports and design proposals\nDevelop ideas keeping in mind client’s needs, building’s usage and environmental impact\nProduce detailed blueprints and make any necessary corrections\nCompile project specifications\nKeep within budgets and timelines\nEnsure that all works are carried out to specific standards, building codes, guidelines and regulations\nMake on site visits to check on project status and report on project\nCooperate and liaise with construction professionals\nFollow architectural trends and advancements\n\nSkills\n\nProven working experience as an architect\nStrong portfolio to prove artistic skills\nExpert knowledge of building products, construction details and relevant rules, regulations and quality standards\nExcellent drawing skills and familiarity with design software (Adobe Photoshop, SketchUp, 3d Studio VIZ or similar)\nStrong imagination and the ability to think and create in three dimensions\nVisual awareness and an eye for detail\nCommunication and project management skills\nBS degree in Architecture\n\nJob Type: Full-time\n\nBenefits:\n\nDental insurance\nHealth insurance\nReferral program\nVision insurance\n\nSchedule:\n\n8 hour shift\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nUrgently hiring\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"LPA, Inc.","company_location":"San Jose, CA \n(Downtown area)","salary_range":"$100,000 - $150,000 a year","days_ago_posted":"Posted\nPosted 1 day ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nLPA is seeking a passionate Project Architect to join our integrated team of architects, engineers, interior designers, landscape architects and master planners in our education practice. You will have the opportunity to collaborate with team members across studios on projects that are both local and across California and Texas. Our clients are both public and private and represent nine different market segments so your career can take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real, we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic and social impact.\nAs a studio, we work hard, have fun and we experiment. Egos are ‘checked at the door’; we expect ideas to come from everyone in our organization - the best ideas are ones developed.\nWe’re committed to diversity, wellness and work-life balance and it is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nWhat you will do:\nYou will lead, craft, and execute the project documentation and Contract Administration on all projects\nLead the technical execution from concept design and documentation process with your team of designers and engineers.\nWork in unison with the Project Designer and Project Manager and lead the realization of the project.\nOversee documentation for schematic design, design development and construction documents\nQuality control research for product and construction methods related to projects\nLead the construction administration process\nCultivate and maintain excellent relationships with clients, builders, governing authorities, stakeholders and team members\nMentor your team members and help to train and upskill them.\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration – Catapult, LPA Foundation\nProject Architect Requirements:\nBachelor’s or Master’s Degree in Architecture required\n10+ years of experience in all phases of architectural projects\nStrong Revit knowledge\nExpertise in building codes and construction as it relates to design and construction services\nArchitectural license required\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nThe salary range for this position is $100K - $150K and is eligible for annual bonus. If you are hired at LPA, your base salary is based on factors such as geographic location, skills, education, experience and/or project complexity. We believe in the importance of pay equity and consider internal equity of our current team members as part of any final offer.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Architectural Designer (All Levels)","company_name":"Lionakis","company_location":"San Jose, CA 95110 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 19 days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nLPA is seeking a passionate Project Architect to join our integrated team of architects, engineers, interior designers, landscape architects and master planners in our education practice. You will have the opportunity to collaborate with team members across studios on projects that are both local and across California and Texas. Our clients are both public and private and represent nine different market segments so your career can take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real, we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic and social impact.\nAs a studio, we work hard, have fun and we experiment. Egos are ‘checked at the door’; we expect ideas to come from everyone in our organization - the best ideas are ones developed.\nWe’re committed to diversity, wellness and work-life balance and it is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nWhat you will do:\nYou will lead, craft, and execute the project documentation and Contract Administration on all projects\nLead the technical execution from concept design and documentation process with your team of designers and engineers.\nWork in unison with the Project Designer and Project Manager and lead the realization of the project.\nOversee documentation for schematic design, design development and construction documents\nQuality control research for product and construction methods related to projects\nLead the construction administration process\nCultivate and maintain excellent relationships with clients, builders, governing authorities, stakeholders and team members\nMentor your team members and help to train and upskill them.\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration – Catapult, LPA Foundation\nProject Architect Requirements:\nBachelor’s or Master’s Degree in Architecture required\n10+ years of experience in all phases of architectural projects\nStrong Revit knowledge\nExpertise in building codes and construction as it relates to design and construction services\nArchitectural license required\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nThe salary range for this position is $100K - $150K and is eligible for annual bonus. If you are hired at LPA, your base salary is based on factors such as geographic location, skills, education, experience and/or project complexity. We believe in the importance of pay equity and consider internal equity of our current team members as part of any final offer.\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Project Architect","company_name":"HGA Architects & Engineers","company_location":"Hybrid remote in San Jose, CA 95113","salary_range":"$97,100 - $141,200 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$97,100 - $141,200 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nShow 2 more benefits\nFull Job Description\nOverview:\nExpand your desire for making a positive, lasting impact through design with this great opportunity for professional growth as a Project Architect at HGA in the San Jose area. We are an award winning architectural, engineering and planning firm that is dedicated to thinking innovatively about not only what we design but why it matters!\n\nWe are looking for a talented, ambitious, design professional who enjoys being part of collaborative project teams where diversity of thought, background and experiences creates new energy. You’ll be working on all phases of design and construction documentation with clients that serve the arts, our communities and higher education campuses. This position requires excellent communication, time management, and technical skills as you work closely with a Project Manager or Principal and a team of consultants developing design concepts into high quality documents.\n\n\nHGA’s culture is committed to setting sustainability goals with our clients that push beyond net zero energy to net positive energy. We recognize the importance of designing spaces that shift from a neutral effect on health, safety, and resources to a positive one. As the need and desire for sustainability environments grow, so does our focus on high-performance buildings with sound data that we can share back with clients and our design teams.\nIn this role you will:\nDevelops a thorough understanding of projects’ design philosophy and provides major input in developing a design and building performance strategy, effectively conveying this to assigned team members when appropriate.\nProvides technical design input and support for the development of the entire design concept. Responsible for a project’s technical design effort, subsequent detailed design development, project coordination and quality control efforts during all phases of project work, in close collaboration with a Senior Designer and Project Manager.\nSeeks creative and innovative solutions to assigned tasks and develops appropriate research and documents to support these solutions.\nActively collaborates with and coordinates work of consultants and knowledge resources to ensure the project deliverables are coordinated, integrated and support the design concept and performance goals of the project.\nContributes to the preparation of design documents and leads the detailed development of construction documents during all project phases, delivering complete, accurate and coordinated project documentation.\nAdvances the production of schematic, design development and construction document drawings and specifications in compliance with project scope, schedule, cost and design intent.\nReviews and aides coordination of project documents with relevant Building Codes, City Planning/Zoning ordinances and similar requirements for Authorities Having Jurisdiction\nMaintains awareness of evolving building technology and systems.\nReviews shop drawings, material samples and Construction Documents for conformance with design.\nPerforms construction administration duties (e.g., RFI’s, RFP’s, change orders, etc.)\nMaintains contact with clients, consultants and contractors during all project phases, participating in marketing, client and owner presentations as required.\nYou will need to have::\n\nBachelor’s degree in architecture; Master’s degree preferred\nLicensed architect in California or actively pursuing licensure\nLEED accreditation preferred\n5-7 years of experience working on small- to large-scale project types\nStrong graphic skills\nRevit knowledge and experience required\nKnowledge of AutoCAD, Revit, SketchUp and other industry accepted software as well as expertise with project management software and Microsoft Office Suite products is needed\nWe'd love to hear from you. If interested, please click on APPLY above and upload your resume and portfolio.\nSalary Information:\nThe pay range listed aligns to the geography of the office for which this position is posted. Actual compensation will be based upon work experience, education, licensure requirements and/or skill level and will be finalized at the time of offer. Individuals in this role working more than 24 hours a week on a regular basis are eligible to participate in HGA’s robust benefit programs which include an annual bonus and success sharing bonus program, 401(k) guaranteed contribution, paid parental leave, medical, dental and life insurance plans as well as PTO and short- and long-term disability programs. Salary Range: $97,100 - $141,200\nAdditional Information:\n\n#LI-Hybrid\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect (All Levels)","company_name":"Lionakis","company_location":"San Jose, CA 95110 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 19 days ago","job_description":"Job details\nSalary\n$97,100 - $141,200 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nHealth insurance\nLife insurance\nShow 2 more benefits\nFull Job Description\nOverview:\nExpand your desire for making a positive, lasting impact through design with this great opportunity for professional growth as a Project Architect at HGA in the San Jose area. We are an award winning architectural, engineering and planning firm that is dedicated to thinking innovatively about not only what we design but why it matters!\n\nWe are looking for a talented, ambitious, design professional who enjoys being part of collaborative project teams where diversity of thought, background and experiences creates new energy. You’ll be working on all phases of design and construction documentation with clients that serve the arts, our communities and higher education campuses. This position requires excellent communication, time management, and technical skills as you work closely with a Project Manager or Principal and a team of consultants developing design concepts into high quality documents.\n\n\nHGA’s culture is committed to setting sustainability goals with our clients that push beyond net zero energy to net positive energy. We recognize the importance of designing spaces that shift from a neutral effect on health, safety, and resources to a positive one. As the need and desire for sustainability environments grow, so does our focus on high-performance buildings with sound data that we can share back with clients and our design teams.\nIn this role you will:\nDevelops a thorough understanding of projects’ design philosophy and provides major input in developing a design and building performance strategy, effectively conveying this to assigned team members when appropriate.\nProvides technical design input and support for the development of the entire design concept. Responsible for a project’s technical design effort, subsequent detailed design development, project coordination and quality control efforts during all phases of project work, in close collaboration with a Senior Designer and Project Manager.\nSeeks creative and innovative solutions to assigned tasks and develops appropriate research and documents to support these solutions.\nActively collaborates with and coordinates work of consultants and knowledge resources to ensure the project deliverables are coordinated, integrated and support the design concept and performance goals of the project.\nContributes to the preparation of design documents and leads the detailed development of construction documents during all project phases, delivering complete, accurate and coordinated project documentation.\nAdvances the production of schematic, design development and construction document drawings and specifications in compliance with project scope, schedule, cost and design intent.\nReviews and aides coordination of project documents with relevant Building Codes, City Planning/Zoning ordinances and similar requirements for Authorities Having Jurisdiction\nMaintains awareness of evolving building technology and systems.\nReviews shop drawings, material samples and Construction Documents for conformance with design.\nPerforms construction administration duties (e.g., RFI’s, RFP’s, change orders, etc.)\nMaintains contact with clients, consultants and contractors during all project phases, participating in marketing, client and owner presentations as required.\nYou will need to have::\n\nBachelor’s degree in architecture; Master’s degree preferred\nLicensed architect in California or actively pursuing licensure\nLEED accreditation preferred\n5-7 years of experience working on small- to large-scale project types\nStrong graphic skills\nRevit knowledge and experience required\nKnowledge of AutoCAD, Revit, SketchUp and other industry accepted software as well as expertise with project management software and Microsoft Office Suite products is needed\nWe'd love to hear from you. If interested, please click on APPLY above and upload your resume and portfolio.\nSalary Information:\nThe pay range listed aligns to the geography of the office for which this position is posted. Actual compensation will be based upon work experience, education, licensure requirements and/or skill level and will be finalized at the time of offer. Individuals in this role working more than 24 hours a week on a regular basis are eligible to participate in HGA’s robust benefit programs which include an annual bonus and success sharing bonus program, 401(k) guaranteed contribution, paid parental leave, medical, dental and life insurance plans as well as PTO and short- and long-term disability programs. Salary Range: $97,100 - $141,200\nAdditional Information:\n\n#LI-Hybrid\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect - Mountainview","company_name":"Design Everest Inc","company_location":"Remote in Mountain View, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nContract\nRemote\nBenefits\nPulled from the full job description\nFlexible schedule\nIndeed's salary guide\nNot provided by employer\n$81.6K - $103K a year is Indeed's estimated salary for this role in Mountain View, CA.\nReport inaccurate salary\nFull Job Description\nWhy Design Everest?\n\nDesign Everest is a technology-enabled managed marketplace for the architecture, engineering, and construction (AEC) industry. We connect owners with architects, engineers, and contractors while utilizing automation and project management to simplify the complex pre-construction process. Currently providing architecture and engineering services in California, Design Everest plans to expand its services offered to build the next generation AEC platform nationally and globally in the long run.\n\nThe opportunity\n\nWe are seeking an Architect to join our California team on a project-to-project basis. The architect will be working on a variety of projects such as custom homes, additions, remodels, retail, restaurant, and a variety of tenant improvements and additions to existing structures. Responsible for the development, design, and management of some projects. This role will require a high level of autonomy and coordination of communication of tasks and deliverables for both internal and external stakeholders.\nWhat’s in it for you!\nFreedom to choose your projects\nCompetitive pay & bids for different types of projects\nBe part of an innovative and growing company\nDiverse projects and scopes across California\nRemote work and flexible work schedule\nDedicated project manager for your projects for seamless coordination with clients\nWhat will you bring to the table:\nLicensed and registered Architect in California\nProficient in REVIT & AutoCAD, Bluebeam\nSketch-up, Adobe Creative Suite, Drafting, Modeling and Rendering also helpful\n7 years of project experience (ADUs, new home and remodel experience preferred); ideally as a Project Architect or as a Job Captain at a minimum.\nExcellent organizational skills and an extremely high level of attention to detail\nKnowledgeable and thoughtful with a knack for problem-solving and willingness to be a part of the solution\nQuick learner able to handle a fast-paced environment and be self-motivated\nDesign Everest is proud to be an equal opportunity employer and committed to having a diverse and inclusive workforce from all backgrounds and parts of the world.\n\nDesign Everest does not accept unsolicited resumes from agencies.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Project Architect, Healthcare Architecture","company_name":"Stantec","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 22 days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$82.8K - $105K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nSenior Project Architect, Healthcare Architecture - ( 2200045G )\n\nDescription\n\nThe buildings that make up the landscape of our daily lives seem like permanent fixtures, fastened to a time and place. But what if that didn’t have to be true? What if our built environment — where we live, learn, play, and conduct business — carried us forward instead?\n\nOur Buildings practice keeps people at its heart, recognizing that our shared journey forward is shaped by the meaningful and responsive places we design. From iconic designs to monumental groundbreakings, join us to bring transformational building solutions to life. Every day we apply our expertise, creativity, and passion to propel communities into the future—join us!\n\nYour Opportunity\n\nYou will support all aspects of the project process from validation/pre-design through construction administration and close-out within Acute, Sub-Acute and Outpatient Healthcare projects. Coordination with consultants, contractors, and Owners can be a part of your weekly activities to manage projects. You may be required to support multiple projects at any time, within various phases of design and construction. This position requires an onsite presence as needed in a co-location setting with the Project Team thru the design and construction phases.\n\nThis is a pipeline position. Please expect a delay in communication from the hiring team as we are looking to hire for this position in early 2023.\n\nYour Key Responsibilities\n\nResponsible for projects of large and medium complexity/size.\nInspire creativity, critical thought, and design excellence both internally and externally.\nConceptualize a building design from both a functional and aesthetic perspective in concert with a client’s requirements, budget, and program.\nDevelop a design through sketches, physical models, electronic models, diagrams, massing studies, and other visual formats to express the design intent and communicate to project team, client, and building user groups.\nUtilize BIM technologies in development of three-dimensional models of buildings and their components.\nParticipate in design critiques and constructability reviews.\nPresent the design with the Project Manager and Project Designer to stakeholders during early project phases. Develops building design in accordance with cost parameters.\nDevelop space planning, block planning, and adjacency diagrams in coordination with building program.\nEvaluate and select building systems and materials.\nCoordinate building systems to ensure compatibility with the design intent.\nImplement sustainable design principles into the design and environment.\nAnalyze site incorporating geotechnical, hydrological, environmental, social, economic and contextual conditions.\nParticipate in development of the program and other pre-design efforts.\nEnsure the design intent is maintained through documentation and construction.\nResponsible for leading others in project team setting and design critiques and pin-ups.\nImplement Life Safety strategies for healthcare and related occupancies.\nKnowledge of Lean tools and on-site big room experience is a plus.\n\nQualifications\n\nYour Capabilities and Credentials\n\nAbility to engage in creative and critical thought.\nTo produce design at a level that would be perceived externally as excellent.\nTo hand sketch and communicate concepts and ideas to others effectively.\nTo participate in an on-site project team setting.\nTo lead one or more teams on medium size projects through the development of design concept.\nTo check work of others for accuracy and completeness and manage team to meet project budget and schedule.\nTo interpret sketches, drawings, codes, building program and other similar material.\nTo present abstract ideas to the client and client representatives.\nTo apply accessibility codes, applicable building codes, and life-safety codes to a wide variety of project scopes and complexity.\nAbility to lead a highly collaborative BIM delivery strategy.\nGeneral knowledge of building construction systems, constructability, materials, and industry associated standards.\nGeneral understanding of the relationship between drawings and specifications.\nRequires understanding of Microsoft Office Suite, Revit, Adobe Creative Suite, SketchUp, Newforma\nExperience with leading and implementation of Lean Tools.\nLEED Green Associate or LEED AP preferred.\nCalifornia Registered Architect is required.\n\nEducation and Experience\n\nBachelor’s degree in Architecture and licensure. Minimum of 8 years of experience, preferably on large teams with healthcare or institutional clients and an understanding of working with HCAI/OSHPD.\n\nTypical office environment working with computers and remaining sedentary for long periods of time. Field work may include exposure to the elements including inclement weather.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n\nPrimary Location : United States-California-San Francisco\n\nOther Locations : United States-California-San Jose\n\nOrganization : BC-2014 Buildings-US Pacific\n\nEmployee Status : Regular\n\nJob Level : Individual Contributor\n\nTravel : Yes, 25 % of the Time\n\nSchedule : Full-time\n\nJob Posting : Dec 6, 2022, 4:32:18 PM\n\nReq ID: 2200045G\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans\n\nHiring Insights\nJob activity\nPosted 22 days ago"},{"job_title":"Project Manager","company_name":"Anderson Brulé Architects","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":"$100,000 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$100,000 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nAD&D insurance\nDental insurance\nDisability insurance\nEmployee assistance program\nEmployee discount\nShow 10 more benefits\nFull Job Description\n\n**Please apply only if you meet the architectural education and experience requirements listed at the end of this post and are located within the San Francisco Bay Area, as this position will require time in our San Jose office. Experience and interest in managing projects in the healthcare market is required.**\nWould you like to revitalize your career and apply your passion to making positive differences in your community? If so, Anderson Brulé Architects, selected as the Firm of the Year by the AIA Silicon Valley, is currently seeking a Project Manager (Healthcare Market) to join our firm.\nABA is a thriving, creative and successful architecture, planning and interior design firm – delivering the highest quality services for over 35 years. The scope of services we offer ranges from pre-project planning through post-occupancy evaluations. ABA is committed to assisting clients in improving their own culture, environment, operation, function and organization. Our motto: Do Good, Exceptionally Well, by Design – means we see our services to our community, health and wellness, education and residential clients as fundamental to making our world better.\nYour key responsibilities and opportunities to learn the daily processes involved in running an architectural/design office which may include:\nBusiness Development\n\nMeet with potential clients to develop relationships and determine client needs, draft fee proposals, and coordinate creative solutions\nTransform leads into project opportunities through proactive business development and follow up measures\nMaintain existing client relationships while developing new ones\n\nTechnical\n\nEstablish project goals, prepare budgets and schedules, and monitor adherence to contract terms\nCollaborate with team members and consultants\nResearch and prepare feasibility studies, master plans, and reports\nPerform preplanning through construction administration services\nKnowledge of working drawings, building codes, specifications, and construction standards\nDevelop and maintain knowledge of industry trends, products, and installation types\n\nPractice Leadership\n\nResponsible for client relationship and management\nResponsible for planning, coordinating, and managing multiple projects through all phases of development\nLead design efforts and direct staff production to effectively meet client goals, budgets and deadlines\nResponsible for communication with other disciplines, vendors, and contractors to ensure incorporation of all information into project requirements and provide support as necessary\nProvide support and mentoring to all team members for specific field, style, or phase of architectural expertise\n\nEducation and experience requirements are:\n\nLicensed Architect in California\nLEED accreditation is desired\n8+ years of architectural experience with recent experience in Healthcare. HCAI/OSHPD experience is important. Experience in Education and Community markets professionally is a plus.\n2-3 years of related experience in Project Management\nRevit/AutoCAD and MS Office proficiency\nExperience in sustainable design, integrated design and LEED guidelines\nAbility to prioritize workload, multi-task between projects and maintain organization in a changing environment\nWorking knowledge of building codes and other regulatory requirements\nAdvanced knowledge of design techniques, tools, and principles involved in production of technical plans, blueprints, drawings, and models\nProven ability to meet deadlines, adhere to budgetary goals and provide high quality service to clients\nExcellent oral, written and presentation communication skills\n\nBenefits of being an ABA Employee:\n\nMedical, Dental, & Vision\nLife, AD&D, and Long-Term Disability Insurance\n401(k) Profit Sharing Plan\nSection 125 Healthcare & Dependent Care Flexible Spending Account Option\nPTO\nPaid Holidays\nAnnual Professional Education & Training Allowance\nReimbursement for Professional Exams and Certifications\nQuarterly Professional Development Assistance with a Senior Leader of the firm\nMonthly Parking Allowance\nPerformance-Based Bonuses\nHybrid, Flexible Work Schedule available\n\nABA is an equal opportunity employer M/F/D/V.\nPlease submit resume, cover letter, work samples, and salary requirements.\nJob Type: Full-time\nPay: From $100,000.00 per year\nBenefits:\n\n401(k)\nDental insurance\nEmployee assistance program\nEmployee discount\nFlexible schedule\nFlexible spending account\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nProfessional development assistance\nReferral program\nRetirement plan\nVision insurance\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nCOVID-19 considerations:\nVaccinations or medical/religious exemption required.\nAbility to commute/relocate:\n\nSan Jose, CA 95121: Reliably commute or planning to relocate before starting work (Preferred)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nRevit: 1 year (Preferred)\nArchitectural: 6 years (Required)\nProject Management: 2 years (Required)\nHCAI/OSHPD: 2 years (Required)\n\nWork Location: One location\n\nJob Type: Full-time\n\nPay: $100,000.00 per year\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Project Designer","company_name":"HMC Architects","company_location":"Hybrid remote in San Jose, CA 95110","salary_range":null,"days_ago_posted":"Posted\nPosted 30 days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\nFlexible schedule\nIndeed's salary guide\nNot provided by employer\n$96.8K - $123K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nPosition Location\nWork where you want! This position is eligible for hybrid (office/remote) working arrangement and flexible working hours. You can be located near the following HMC Northern California locations: San Jose or San Francisco.\nWho We Are\nHMC Architects is an employee-owned design firm with an inherent desire to make a difference in our communities. As a purpose-driven brand based on values, our mission to design for good drives everything we do. And our ownership culture creates alignment and increased commitment to that mission, keeping us on track to being successful.\nWhat We Do\nFounded with the purpose of anticipating community needs, HMC aims to create designs that have a positive impact, now and into the future. We focus primarily on opportunities to have the most direct contribution to communities–through healthcare, education, and civic spaces.\nJob Summary\nThe Senior Project Designer will be a prominent creative leader for the office and company, and will plan, coordinate, and lead the design efforts for various sized projects. Coordinate and produce design presentation material, and coordinate the design intent with the production and documentation of construction documents. Coordinate with the construction administration of the project and maintain design intent during construction. Has primary responsibility for client contact. Strong ability to multi-task and prioritize. Ability to oversee two to three project designers and several junior design staff.\nMinimum Requirements\nEducation: Architectural degree from an accredited university.\nExperience: Minimum of ten (10) years experience in architectural design, and in the production and coordination of significant design projects. Demonstrates leadership in design with the profession.\nOther Requirements and Responsibilities\nCommunication and Collaboration\n\nListen and communicate effectively and professionally\nAbility to communicate complex design concepts both verbally and graphically to team members and clients\nCoordinate project design with team members and consultants for conflicts and discrepancies\nEstablish productive working relationships, and deal effectively and cooperatively with team members, consultants, and government agencies\nDisplay willingness to make decisions; exhibit sound and accurate judgment; support and explain reasoning for decisions; include appropriate people in decision-making process; make timely decisions\nAbility to apprise supervisor and client for status of work\nCollaborate with appropriate staff to meet goals and objectives of project\nAsks questions about assignments when unclear\nResolve issues related to team members, staff, and clients\nAbility to organize and deliver complete project design presentations to client user group or public forum\nEnsure that coaching, mentoring, and performance-enhancing feedback of assigned team members are provided\nDirect overall verbal and graphic communication of complex project concepts to clients, public agencies, and project team members, and be a primary point of contact for the client\nResolve \"lost opportunity\" issues, including staffing reduction, review of contractual obligations, and scope of service\n\nSupervision and Delegation\n\nAbility to professionally communicate both verbally and in writing to give assignments to office support staff, consultants, and vendors\nAbility to delegate assignments to support staff and always be respectful\nAssist and/or prepare evaluations and meet with their personnel to discuss the evaluations\nPrimary source for monitoring designers on a daily basis and taking the appropriate action to report both positive and negative performance\nSupervise and manage the design of several projects and design teams. Ability to supervise and direct the design of projects within other offices or studios\nSupervised 4 – 10 employees\n\nDocumentation\n\nAbility to correspond effectively with consultants and clients\nAbility to write and edit design narratives\nPrepare/edit marketing proposals and participate in interview\nWrite meeting minutes, professional correspondence, and lead or assist in the documentation of the design process\nWrite articles for professional publications of the architecture and construction industry\nUnderstand and review agreements with clients and consultants, especially pertaining to fees and deliverables\nWrite training material for staff development\n\nBusiness Development\n\nAttend professional activities outside of office\nAlways be professional and respectful in interactions with clients and consultants\nPrimary proponent for project pursuit\nMay maintain primary contact with client, have excellent follow-through with client and maintain excellent client relationships\nHave primary role in marketing interviews and in the graphic preparation of marketing proposals. Write and approve marketing proposals\nAbility to market project capability through client interviews, public presentations, and professional publications\nActively work to cultivate new clients\n\nManagement\n\nDemonstrate motivation in seeking new responsibilities and challenges\nSet goals, prioritize, and plan work activities for self-management and use time efficiently\nEstimate hours for assigned tasks and finish tasks within agreed-upon budget hours for the task\nPrepare work plans and schedules for the design process, and coordinate schedule with project manager\nWork collaboratively and effectively with PIC’s, project manager and project team\nLead the design efforts for all sized projects\n\nDesign\n\nLead with the PIC and participate in design awards and publications efforts\nTake leadership role in the promotion of design quality throughout the company\nInitiate and lead efforts to promote the design reputation of the firm\nLead the Schematic and Design Development efforts of projects in collaboration with PM\nLead the design efforts on all sized projects, and coordinate the design efforts on several projects\nEnsure the design integrity of all studio projects through the Design Development, Construction Document, and Construction Phases\nDemonstrate creativity in architectural design on projects\nDemonstrate knowledge of the appropriate use of building systems, materials, and technologies. Show initiative in the research of alternative systems and materials\nLead the documentation of project design, such as three-dimensional CAD modeling, physical models, and product or material research in collaboration with PM\nCoordinate the preparation of various Design Communication and Presentation materials including: sketches, rendered 2D & 3D drawings, rendered perspectives, slide shows and material selection boards in collaboration with PM\nLead office design charettes, team design critiques and pin-ups\nProvide a positive design leadership example to project teams and to the studio\n\nTechnical\n\nDemonstrate proficiency in applications and multimedia software\nUnderstand technical terminology of the architectural and construction industry\nCoordinate a project’s design intent through the construction document and construction phases\nUnderstand requirements/deliverables of all phases\nDemonstrate knowledge of the applicable building codes for use in design\nReview documents to ensure quality, coordination, and compliance with the requirements of deliverables and client standards in all phases\nUnderstand the organization of the contract documents\nSelect appropriate materials, systems and develop design details and systems\nEnsure the design intent in the development of specifications\nProvide training and mentoring for all technical aspects of our work\nHave working knowledge and follows HMC procedures, standards, and protocols\nDirect all field verification efforts and validate information for authenticity\n\nJob Type: Full-time\n\nHiring Insights\nJob activity\nPosted 30 days ago"},{"job_title":"Project Architect","company_name":"Jacobs","company_location":"San Jose, CA 94105 \n(North San Jose area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$86.3K - $109K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nOur People & Places Solutions business – reinforces our drive to improve the lives of people everywhere and epitomizes the \"why\" of what we do – the tremendous positive impact and value our solutions bring to our communities and society as a whole. From facilities delivering life-saving therapies and ensuring clean water to enabling the connection of people through all modes of transportation and providing access to technology – we're integrating a multitude of these solution elements to build the smart environments of tomorrow.\n\nStart your Jacobs career with a company that inspires and empowers you to deliver your best work so you can evolve, grow and succeed – today and into tomorrow.\n\n\n\nYour Impact:\n\n\n\nAt Jacobs, we challenge what is currently accepted, so we can shape innovation and lasting solutions for tomorrow. If you’re interested in a long and rewarding career working with the industry’s best and most innovative engineers, then Jacobs is where you belong.\n\nAs a Project Architect, in partnership with the Architectural Discipline Director, Project Manager, Project Designer, you are accountable for project financial performance and team communication. Responsible for the development, issuance and content of deliverables, technical content of documents and coordination of disciplines including consultants and for the supervision of all staff producing documents on your projects.\n\nPrimary Responsibilities\n\nResponsible for ensuring the overall design intent of the project established by the Project Designer is incorporated into the detailed documentation.\nMonitors the design process from conceptual phase through construction administration, ensuring the design idea is consistent and properly executed.\nResponsible for technical resolution and coordination for a defined portion of a project.\nWorks with the project specification writer to develop specifications and is responsible for coordination of drawings and specifications.\nChecks completed reports, plans, estimates and calculations for accuracy.\nWorks to implement the overall strategy for producing the documents and identifies the sheets planned for each stage of the work. This includes defining how data will be organized into files and which elements will be incorporated in a Building Information Model (BIM).\nFosters and maintains a collaborative professional working relationship with the entire Project Team.\nResponsible for communication with other disciplines, vendors, and contractors to ensure incorporation of all information into project requirements and provides support as necessary.\nEnsures that construction detail documentation conforms to quality assurance, quality control and best practice standards.\nReviews drawings supplied by vendors, clients, and other discipline group designers that affect the specific project design.\nFosters a commitment to external and internal client service.\nDevelops a positive relationship of trust with clients and other project leadership.\nRegularly communicates with client representative to verify design requirements and specifications, progress reviews and delivery of final presentation.\nTeamwork\n\nReceives project direction from the Design Principal and technical direction from the Quality Control project reviewer, the Architectural Discipline Director and the Quality Control Manager in the studio.\nCoordinates and tracks electronic documentation and files with project team, clients and consultants.\nAttends on-site visits, field reviews and project meetings as required for the project. Prepares and coordinates the review of contractor’s schedules, submission of shop drawings and samples.\nParticipates in team meetings to help resolve project issues, coordination with other disciplines, schedule adherence, technical issues.\nPrepares meeting minutes of consultant coordination meetings and/or oversees development of the minutes with a project admin or the project manager depending on the project size.\nMay prepare 2D and 3D presentation/design drawings and builds models for client/project team review.\nIncorporates Integrated Sustainable Design solutions into projects.\nBusiness Development\n\nCreating and growing your personal brand within JACOBS across disciplines, offices and divisions.\nBeing a strong advocate for the studio to other JACOBS colleagues and offices.\nActively involved in the community in a capacity that is in alignment with personal goals, hobbies and passions.\nRequired Skills\n\nStrong knowledge of design, trends, construction methodology, material application, and manufacturer-supplier appropriateness.\nKnowledge of architectural building systems.\nKnowledge of sustainability and integrated design.\nKnowledge of Building Information Modeling (BIM).\nKnowledge of QA/QC process.\nKnowledge of building codes and ability to research and apply/incorporate into technical documents.\nProficiency in Revit preferred.\nProficiency in Microsoft Office Suite.\nProficiency in Photoshop, Illustrator, Sketchup, Enscape and InDesign graphic software preferred.\nAbility to work in team environment.\nAbility to effectively meet deadlines.\nParticipation in professional organizations is preferred\n\nAt Jacobs, we’re partnering across the globe to create the best project outcomes by maximizing the design, digital technology, and support capabilities of our Global Integrated Delivery (GID) teammates. By joining Jacobs, you’ll commit to supporting and engaging with these teams, as we work to build a company like no other.\n\n#biaffederal\n\n\nHere’s What You’ll Need:\n\n\n\nBachelor’s degree in architecture or equivalent in education or experience\nAt least 5 years practicing as a licensed Architect\nLicensed Architect with current registration in your region required, if licensure is offered in your region\nValid driver’s license\nUS Citizenship\nIdeally, You'll Also Have:\n\nNCARB registration\nLEED AP BD+C and GBI Guiding Principles Certified Professional (GPCP)\nOSHPD experience\n\n\n\n\nJacobs is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, religion, creed, color, national origin, ancestry, sex (including pregnancy, childbirth, breastfeeding, or medical conditions related to pregnancy, childbirth, or breastfeeding), age, medical condition, marital or domestic partner status, sexual orientation, gender, gender identity, gender expression and transgender status, mental disability or physical disability, genetic information, military or veteran status, citizenship, low-income status or any other status or characteristic protected by applicable law. Learn more about your rights under Federal EEO laws and supplemental language.\n\n\nAt Jacobs, we’re challenging today to reinvent tomorrow by solving the world’s most critical problems for thriving cities, resilient environments, mission-critical outcomes, operational advancement, scientific discovery and cutting-edge manufacturing, turning abstract ideas into realities that transform the world for good. With $13 billion in revenue and a talent force of more than 55,000, Jacobs provides a full spectrum of professional services including consulting, technical, scientific and project delivery for the government and private sector.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architect, Factory Design (Fremont, CA)","company_name":"Tesla","company_location":"Fremont, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$111K - $140K a year is Indeed's estimated salary for this role in Fremont, CA.\nReport inaccurate salary\nFull Job Description\nThe Role:\n\nTesla’s Infrastructure Engineering group is seeking an Architect with 5-8 years of experience to work on multiple projects across Fremont Tesla sites. This person will be responsible for driving innovation and first principles mindset, executing projects and professional growth, and promoting collaboration between all project disciplines. This position is located in Fremont, CA.\n\n\n\nResponsibilities:\nProject Execution.\nFirst Principles Mindset.\nProject Quality, Standards, Specifications, Drawing Deliverables.\nDrives Discipline Coordination.\nTeam Morale, Dynamics, Capability / Capacity Gaps.\nDesigning, producing construction documents, obtaining building permits.\nArchitect of record for some projects for licensed candidates.\nCode Planning / Life Safety design.\nParticipate in project scheduling and cost estimating.\nDevelop process improvements / workflows / templates to increase design productivity.\nLearn, advance, and increase quality through construction observation / administration.\n\n\nRequirements:\nBachelors or Master’s degree in Architecture or equivalent experience and evidence of exceptional ability.\nMinimum 5 years’ experience.\nAdvanced proficiency in Revit.\nLicensed architect in the state of California is a plus.\nConstruction administration experience.\nWork well under pressure and can manage multiple projects at the same time.\nMust be highly organized with outstanding prioritization skills.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Interior Project Manager","company_name":"LPA, Inc.","company_location":"San Jose, CA \n(Downtown area)","salary_range":"$100,000 - $150,000 a year","days_ago_posted":"Posted\nPosted 1 day ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nLPA is seeking a passionate Interior Project Manager to join our integrated team of architects, engineers, interior designers, landscape architects and master planners in our workplace practice. You will have the opportunity to collaborate with team members across studios on projects that are both local and across California and Texas. Our clients are both public and private and represent nine different market segments so your career can take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real, we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic and social impact.\nWe’re committed to diversity, wellness and work-life balance and it is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nWhat you will do:\nYou will be living and breathing the project from inception to completion and be able to turn your hand to all aspects of the project.\nYou will be the main client point of contact on all of your projects.\nPrepare schedules, budgets and work plan documents during all phases of the project.\nReview contractual and financial construction administration documents.\nProject types include primarily workplace, commercial and civic.\nReview research for product and construction methods related to project.\nMentor your team members and help to train and upskill them.\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including licensure incentives, professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration – Catapult, LPA Foundation\nInterior Project Manager Requirements:\nBachelor and/or Masters Degree in Interior Architecture, Interior Design and/or Architecture\n10+ years of experience in all phases of interior architectural projects\nArchitecture license or Interiors Certification\nProficiency in Microsoft Project and Excel. Knowledge of Revit and Bluebeam preferred.\nKnowledge in management of project business: scope, fee, schedule, work plans and budget.\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nThe salary range for this position is $100K - $150K and is eligible for annual bonus. If you are hired at LPA, your base salary is based on factors such as geographic location, skills, education, experience and/or project complexity. We believe in the importance of pay equity and consider internal equity of our current team members as part of any final offer.\n\n\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Associate Architect II","company_name":"HNTB Corporation","company_location":"San Jose, CA 95115 \n(Willow Glen area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Benefits\nPulled from the full job description\nDental insurance\nHealth insurance\nLPA is seeking a passionate Interior Project Manager to join our integrated team of architects, engineers, interior designers, landscape architects and master planners in our workplace practice. You will have the opportunity to collaborate with team members across studios on projects that are both local and across California and Texas. Our clients are both public and private and represent nine different market segments so your career can take many different trajectories.\nWe walk the talk in changing lives by design. Our sustainability commitment is real, we are the only large firm in the nation to comply with the 2030 Challenge for the past two years running. Our award-winning projects aim to have a positive and enduring environmental, economic and social impact.\nWe’re committed to diversity, wellness and work-life balance and it is neatly summarized in our Just label. We offer competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nWhat you will do:\nYou will be living and breathing the project from inception to completion and be able to turn your hand to all aspects of the project.\nYou will be the main client point of contact on all of your projects.\nPrepare schedules, budgets and work plan documents during all phases of the project.\nReview contractual and financial construction administration documents.\nProject types include primarily workplace, commercial and civic.\nReview research for product and construction methods related to project.\nMentor your team members and help to train and upskill them.\nWhat we will do:\nProvide mentorship from Managing Directors and Design Directors as well as other in-house disciplines on all projects\nProvide career growth opportunities including licensure incentives, professional development grants and our professional development process\nIn-house management and leadership training opportunities\nEducation opportunities including LPA+U and LPA Tech Talks\nProvide study grants for exploration – Catapult, LPA Foundation\nInterior Project Manager Requirements:\nBachelor and/or Masters Degree in Interior Architecture, Interior Design and/or Architecture\n10+ years of experience in all phases of interior architectural projects\nArchitecture license or Interiors Certification\nProficiency in Microsoft Project and Excel. Knowledge of Revit and Bluebeam preferred.\nKnowledge in management of project business: scope, fee, schedule, work plans and budget.\nLPA is an integrated design firm with offices in California and Texas. We specialize in creating innovative, sustainable environments that work better, do more with less and improve people’s lives. We provide a vibrant and rewarding work environment—one that values and fosters creativity, collaboration, critical thinking, community engagement and ongoing career development and growth. LPA is also committed to diversity, wellness and work-life balance. LPA offers competitive salaries and generous benefits, including health and dental insurance, retirement and financial, wellness and other work/life plans.\nThe salary range for this position is $100K - $150K and is eligible for annual bonus. If you are hired at LPA, your base salary is based on factors such as geographic location, skills, education, experience and/or project complexity. We believe in the importance of pay equity and consider internal equity of our current team members as part of any final offer.\n\n\nNOTICE TO RECRUITMENT AGENCIES AND RECRUITERS:\nPlease note that LPA does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed contract, LPA will not agree to pay any recruiter fee. In the situation an agency or recruiter submits a candidate or resume without a previously signed agreement and/or without LPA’s request, LPA explicitly reserves the right to hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of LPA.\nHiring Insights\nJob activity\nPosted 1 day ago"},{"job_title":"Architectural Millwork Project Manager","company_name":"Commercial Casework Inc","company_location":"Fremont, CA 94538 \n(Baylands area)","salary_range":"$90,000 - $120,000 a year","days_ago_posted":"Posted\nToday","job_description":"Job details\nSalary\n$90,000 - $120,000 a year\nJob Type\nFull-time\nQualifications\n\nProject management: 1 year (Required)\n\nMillwork: 1 year (Required)\n\nTime management: 1 year (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\nFull Job Description\n\nPOSITION: Project Manager\n\nDESCRIPTION/RESPONSIBILITY:\n- Manage Projects (15-20 annually-varies depending on size) from time of award to Close\n- Review and Submit drawing and material submittals, and track approvals\n-Develop RFI’s and/or and solutions for our clients\n-Track changes in scope and submit Change Orders.\n-Communicate effectively in and out of house for the success of your projects\n\nSKILLS/REQUIREMENTS:\n-Minimum 3 years experience managing Commercial Millwork projects\n-Ability to multi-task and Attention to detail\n-Ability to cooperate, collaborate, and work as a team\n-Ability to plan, set priorities, and multi-task for multiple projects.\n-Motivated self-starter & problem solving ability\n-Ability to learn quickly\n\nJob Type: Full-time\n\nPay: $90,000.00 - $120,000.00 per year\n\nBenefits:\n\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\nSigning bonus\n\nAbility to commute/relocate:\n\nFremont, CA 94538: Reliably commute or planning to relocate before starting work (Required)\n\nExperience:\n\nProject management: 1 year (Required)\nTime management: 1 year (Preferred)\nMillwork: 1 year (Required)\n\nWillingness to travel:\n\n25% (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted Today"},{"job_title":"SENIOR ARCHITECT / PROJECT MANAGER:MANAGER","company_name":"Studio Current","company_location":"San Jose, CA 95112 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$92.1K - $117K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nA Manager to lead out and guide projects from the programming & conceptual planning stage through completion and occupancy.\nBasic job requirements are listed below:\n\n\nPassionate about quality Architectural design & Urban planning\n- Graduate of accredited 4 or 5-year University -Architectural Design program\n\nLicensed to practice Architecture in California Experienced in all phases of design & architectural drawings\nSkilled at estimating & budgeting hours and scope for new design projects\nHands on experience with Revit / AutoCAD / Bluebeam programs\nGreat communication / leadership / and communication skills\nExpert at navigating &amp; conversing on Zoning & Building Codes\nReady to make mark on the future of our community\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Designer","company_name":"Studio W Architects","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$92.1K - $117K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nA Manager to lead out and guide projects from the programming & conceptual planning stage through completion and occupancy.\nBasic job requirements are listed below:\n\n\nPassionate about quality Architectural design & Urban planning\n- Graduate of accredited 4 or 5-year University -Architectural Design program\n\nLicensed to practice Architecture in California Experienced in all phases of design & architectural drawings\nSkilled at estimating & budgeting hours and scope for new design projects\nHands on experience with Revit / AutoCAD / Bluebeam programs\nGreat communication / leadership / and communication skills\nExpert at navigating &amp; conversing on Zoning & Building Codes\nReady to make mark on the future of our community\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Healthcare Architecture Project Manager","company_name":"Stantec","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$97.2K - $123K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nHealthcare Architecture Project Manager - ( 220003KP )\n\nDescription\n\nThe buildings that make up the landscape of our daily lives seem like permanent fixtures, fastened to a time and place. But what if that didn’t have to be true? What if our built environment — where we live, learn, play, and conduct business — carried us forward instead?\n\nOur Buildings practice keeps people at its heart, recognizing that our shared journey forward is shaped by the meaningful and responsive places we design. From iconic designs to monumental groundbreakings, join us to bring transformational building solutions to life. Every day we apply our expertise, creativity, and passion to propel communities into the future—join us!\n\nYour Opportunity\n\nJoin a growing Healthcare practice in the San Francisco market as a Project Manager working with some of our top Healthcare clients. With general guidance from the Healthcare leadership team, you’ll support all aspects of the project process from validation/pre-design through construction administration and close-out within Acute and non-Acute Healthcare projects. Coordination with consultants, contractors, and Owners can be a part of your weekly activities supporting multiple projects at any time, within various phases of design and construction.\n\nAs a Project Manager contributing on our professional Architectural team, you will build and expand our client relationships, impact how projects are delivered and manage the culture of our internal design and delivery teams. This is a role that requires relationship-building skills providing direction, oversight, guidance and mentoring of others.\n\nFor this opportunity, you will be based out of our San Francisco office. Stantec embraces a hybrid home/office work environment upon project approval. You will also spend time at project locations based on the business needs of the client.\n\nYour Key Responsibilities\n\nResponsible for delivering large healthcare projects of varying complexity/size.\nOversee preparation of documentation in various architectural phases.\nCoordinate building engineering systems to ensure compatibility with the design intent. Ensure that design intent is maintained through documentation and construction.\nParticipate in design critiques and constructability reviews.\nMonitor building design in accordance with cost parameters.\nConduct field observation and report progress of construction to the client.\nPrepare fee proposals, and manage tracking change orders for changed scope, pay apps and other contractual modifications impacting budget and schedule.\nLead project coordination and site meetings with internal team members, external consultants, owner, contractors and subcontractors.\nReview project budget versus weekly fee spending, project schedule progress and report to Project Principals.\nDetermine staffing needs and make recommendation.\nParticipate in marketing efforts, including proposal development, market strategy, presentations, and client interviews.\n\nQualifications\n\nYour Capabilities and Credentials\n\nProven delivery of successful Healthcare projects with OSHPD/HCAI.\nAbility to engage in creative and critical thought.\nStrong communication skills, both oral and written.\nStrong understanding of project financials.\nCheck work of others for accuracy and completeness and manage team to meet project budget and schedule.\nLead one or more teams on projects through the development of design concept.\nInterpret sketches, drawings, codes, building program and other similar materials.\nMaintain contact with clients, consultants, and contractors during all project phases, participating in marketing, client and owner presentations as required\nGeneral understanding of accessibility codes, applicable building codes, and life-safety codes to a wide variety of project scopes and complexity.\nGeneral knowledge of building construction systems, constructability, materials, and industry associated standards.\nGeneral understanding of the relationship between drawings and specifications.\nGeneral understanding with implementation of Lean Tools\nAbility to lead a collaborative BIM delivery strategy.\nRequire understanding of Microsoft Office Suite, Revit, Adobe Creative Suite, Bluebeam and Newforma.\nParticipate in on-site project team setting.\nAbility to travel up to 20% as desired.\n\nEducation and Experience\n\nBachelor’s degree in Architecture and working towards California licensure required.\nMinimum 5-7 years of experience with healthcare or institutional clients.\nLEED Green Associate or LEED AP preferred.\n\nTypical office environment working with computers and remaining sedentary for long periods of time. Field work may include exposure to the elements including inclement weather.\n\nThis description is not a comprehensive listing of activities, duties or responsibilities that may be required of the employee and other duties, responsibilities and activities may be assigned or may be changed at any time with or without notice.\n\nStantec is a place where the best and brightest come to build on each other's talents, do exciting work, and make an impact on the world around us. Join us and redefine your personal best.\n\nPrimary Location : United States-California-San Francisco\n\nOther Locations : United States-California-Sacramento, United States-California-San Jose, United States-California-San Francisco\n\nOrganization : BC-2014 Buildings-US Pacific\n\nEmployee Status : Regular\n\nJob Level : Individual Contributor\n\nTravel : Yes, 20 % of the Time\n\nSchedule : Full-time\n\nJob Posting : Nov 9, 2022, 2:29:52 PM\n\nReq ID: 220003KP\n\nStantec provides equal employment opportunities to all qualified employees and applicants for future and current employment and prohibit discrimination on the grounds of race, color, religion, sex, national origin, age, marital status, genetic information, disability, protected veteran status, sexual orientation, gender identity or gender expression. We prohibit discrimination in decisions concerning recruitment, hiring, referral, promotion, compensation, fringe benefits, job training, terminations or any other condition of employment. Stantec is in compliance with local, state and federal laws and regulations and ensures equitable opportunities in all aspects of employment. EEO including Disability/Protected Veterans\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Design Director - Workplace Interiors","company_name":"Gensler","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$93.2K - $118K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\nYour Role\nAt Gensler we help companies innovate. We design spaces, services and environments for the most innovative companies in the world, seeking new ways to provide value by fostering healthier, more effective workplaces. As a result of a growing diverse client base and increasing project work we are seeking a Design Director with exceptional design skills and a portfolio of innovative design solutions with an emphasis on Workplace design projects, particularly with our Tech and Consumer Goods Clients.\nAs a Gensler Design Director, you will lead the design of projects, acting as stewards of Gensler’s mission. You will design for all of humanity, driving a passionately curious design culture to create solutions that are emotionally resonant and that positively impact people’s everyday experiences. You will also passionately lead our teams, and our clients, as we drive towards our Sustainability goals for 2030.\nAs a member of a studio’s leadership team, you will collaborate with talented colleagues to enhance Gensler’s culture for design excellence, elevate the quality of design, and achieve recognition for our clients and the firm. You are a mix of strategic and creative, with the ability to create great form while embracing sound business strategy. Use your unique design perspective to lead design teams, develop next-generation talent, bring new approaches to the design process, and help our clients redesign what’s possible.\nWhat You Will Do\nLead the creative efforts of multiple interior design teams on projects from the initial marketing stages through construction and installation\nDevelop and own overall design concepts, storytelling and design presentation strategies\nBe a fearless integrator and advocate for diverse points of view and expansive thinking.\nDrive alignment in our designs with our, and our clients’, sustainable goals.\nBuild and sustain client relationships; act as the primary design interface with clients, team members, and a wide range of consultants and collaborators, both internal and external.\nCreatively align solutions to budgets.\nMentor and develop Gensler designers; provide creative direction to design teams\nParticipate in business development, marketing and recruiting efforts\nInteraction with clients while representing Gensler at meetings and presentations.\nBe a voice in our Community for the Power of Design\nYour Qualifications\nBachelor’s degree from an accredited school of design or architecture\n10+ years of diverse interiors experience, including experience in a leadership role\nExperience leading design teams through all phases of the design process\nLEED accreditation preferred\nStrong leadership, communication, and relationship management skills\nUnderstanding proficiency in design software programs (SketchUp, Revit, Photoshop, InDesign and Illustrator), with proficiency in Indesign, Powerpoint, Miro and sketching.\nDemonstrated commitment to sustainability and sustainable building practices required. Portfolios should include at least 1 project with this particular focus, and candidates should be prepared to talk to this in their interview, especially built projects with LEED, Living Building Challenge, WELL Building Standard , Fitwel and /or Net Zero Building certification\nLife at Gensler\nAt Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions and hackathons, to “Well-being Week,” our offices reflect our teams’ diverse interests.\nWe encourage our employees to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays and paid time off. We also offer a 401k, profit sharing, employee stock ownership and twice annual bonus opportunities.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\n#LI-SK1\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect - Workplace - Senior","company_name":"Gensler","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$96.9K - $123K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\nAt Gensler, we design for people. We leverage our global perspective and local presence to innovate at every scale. We’re not just designers. We’re tinkerers, craftspeople, visionaries, innovators and thought leaders. Fueled by passion and entrepreneurial spirit, our people bring innovative ideas to solve challenging problems. Our San Jose studio has a thriving interiors and architectural practice focusing on workplace. Through our integrated inside-out design approach, we impact both the people working in our buildings and the surrounding community with our inspirational and thought leading design solutions.\nYour Role\nAs a Gensler Architect, you will collaborate with a team of architects and designers to develop design solutions as well as coordinate the design through the construction administration phase of a project. You will be successful because you already know how to translate sketches and documents into realized 3D models and construction drawings and can research technical issues when they arise. You will join a studio focused on commercial office buildings for developers or build to suit buildings for technology companies. Your work ethic, combined with your commitment to collaboration and mentoring, makes Gensler the perfect place to nurture your career.\nWhat you Will Do\nParticipate in all phases of design\nCollaborate with design team, clients, consultants, contractors, fabricators, regulatory agencies and other vendors to meet overall project objectives.\nManage project team and coordination of consultants\nProduce BIM models and construction drawings\nResolve challenging technical and design issues with the team to produce innovative, technical and constructible solutions.\nFlexibility to focus on concurrent projects in various stages of development\nA quick learner with an ability to thrive in a fast-paced work environment\nEffective communicator, collaborative and team-conscious.\nProvide Mentorship and coaching to grow junior staff members\nParticipate in office culture and initiatives\nYour Qualifications\nBachelor's degree in Architecture from an accredited school\nRegistered architect\n10 - 15 years of experience in the profession of architectural design\nExperience managing multiple aspects of client, team, and project coordination, including full documentation coordination with structural, MEP, lighting, AV, landscape, and civil consultants\nExperience working directly with contractors\nExperience resolving complex technical and design issues\nProficiency with Revit, SketchUp, 3ds Max, and Adobe Creative Suite\nUnderstanding of how buildings are constructed and ability to create technical documents that succinctly, thoroughly, and accurately describe the work to be done\nKnowledge of California building codes, standards and building structures\nUnderstanding of sustainable and universal design concepts\nStrong leadership, organizational, communication and relationship management skills\nDemonstrated commitment to sustainability and sustainable building practices required. Portfolios should include at least 1 project with this particular focus, and candidates should be prepared to talk to this in their interview, especially built projects with LEED, Living Building Challenge, WELL Building Standard , Fitwel and /or Net Zero Building certification\nLife at Gensler\nAt Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.\nWe encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities. Our annual base salary range has been established based on local markets.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\n#LI-SK1\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Staff Level II / Architect II","company_name":"Valerio Dewalt Train","company_location":"Palo Alto, CA 94301 \n(Professorville area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$89.4K - $113K a year is Indeed's estimated salary for this role in Palo Alto, CA.\nReport inaccurate salary\nArchitectural Staff Level II / Architect II\nRequired work authorization:\nUnited States\n\nSummary: Assist in preparing complete and accurate working plans and detailed drawings from rough or detailed sketches or notes by performing the following duties.\n\nRequired Qualifications:\nB.Arch or M.Arch from an accredited school of Architecture.\n\nEssential Job Responsibilities\n6 or more years of architecture practice experience (including at least 1 year of U.S. experience)\nStrong design portfolio\nManaging clients with multiple projects.\nMaintaining relationships with clients to provide a high level of service.\nInvolvement with pre-design and programming phases of a project.\nOverseeing the production of design documents\nGuiding and producing all document phases of a project, SD, DD, CD and CA.\nCoordinating project consultant efforts.\nStrong collaboration and organizational skills are a must.\nHands on approach and flexibility are a must.\nConsults in the planning, design and coordination of large complex projects.\nResponsible for technical design aspects of an assigned major project including investigation, evaluation and recommendations.\nProvide technical guidance to less experienced staff.\nCarries out complex or novel assignments requiring the development of new or improved techniques and procedures.\nKnowledge of local building code is required.\nServing as the technical leader and project manager for significant development projects. The ability to manage several simultaneous projects is a requirement, overlooking different project teams.\nEstablishing the initial project schedule and regular maintenance of project schedules. This activity includes the recommendation of appropriate staffing for each design activity\nStrong Project Management skills\nExperience with Revit is preferred.\nU.S. Architecture license is preferred\n\nOther Requirements:\nExperience with Revit is preferred.\nU.S. Architectural License preferred\nKnowledge of the City Building Code is preferred.\nOther duties as assigned.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Manager (Page and Turnbull - San Jose)","company_name":"Page & Turnbull, Inc","company_location":"Hybrid remote in San Jose, CA","salary_range":"$80,000 a year","days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nSalary\n$80,000 a year\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nDisability insurance\nFlexible spending account\nHealth insurance\nShow 4 more benefits\nFull Job Description\n\nPOSITION: Project Manager\n\nLOCATION: San Jose\n\nPage & Turnbull is an award-winning firm of Architects and Cultural Resource Specialists who have a passion for conserving historic places and reimagining them for the way we live today. With offices in San Francisco, Los Angeles, Sacramento and San Jose, we’re growing and hope to have a meaningful impact on historic places in California and beyond.\n\n\nOur ideal candidate is creative, curious about the past and passionate about the role of design in shaping the future of our built environment. You are a leader with strong organizational skills, resourcefulness and critical thinking, as well as a passion for mentorship and collaboration. As a creative and engaged member of our team you will have ample opportunity to hone your technical and creative toolkit and support for your professional growth. You will lead challenging historic preservation and adaptive reuse design and consulting teams, interfacing directly with Clients and communities.\n\n\n\n\nOur team is committed to taking care of our people and building an inclusive, equitable and fun workplace. We are proud to support our team with a robust benefits package and we support mentorship, professional development, and community involvement for all of our team members.\n\n\n\n\nYOUR CONTRIBUTION IS IMPORTANT\n\nWith your enthusiasm and strong organizational and time management skills, you would have an immediate role in leading a variety of challenging historic projects encompassing a range of sizes and property types.\n\n\n\n\nPrimary responsibilities include:\n\nDeveloping and managing project work plans, budgets, & schedules.\nPreparing a variety of studies and reports, including, but not limited to Design Studies, Existing Conditions Assessments, Feasibility Studies, Code Analysis, and Historic Structure Reports.\nPreparing Contract Documents.\nLead permitting and entitlements processes\nManaging collaborative teams for large projects and working individually on smaller projects simultaneously.\nServing as the primary point of contact for clients.\nSupervising and mentoring junior staff.\n\nQUALIFICATIONS\n\n· Professional degree in Architecture\n\n· 8+ years professional experience\n\n· Knowledge of code and accessibility requirements and demonstrated ability to guide projects through permitting and entitlements processes\n\n· Ability to communicate clearly and persuasively through verbal, written and graphic communication formats\n\n· Project and task planning skills - ability to evaluate, prioritize and delegate multiple important tasks\n\n· Strong critical thinking, professional judgement and decision-making skills\n\n· Proficiency with REVIT preferred, understanding of capabilities, requirements on project documentation strategy required\n\n\n\n\nPREFERRED QUALITIES\n\n· Licensed Architect\n\n· Knowledge of sustainable design principles and LEED accreditation\n\n· Established knowledge of accounting and project management software\n\n· Commitment to participation in a professional organization\n\n\n\n\nRewards/Benefits/Compensation:\n\nHybrid work schedule\nFriendly and collegial atmosphere\nMedical, Dental and Vision benefits\nFSA/Flexible Spending Account\nEmployer paid long-term disability and life insurance plans\nNine paid holidays (includes one floating holiday)\nPaid vacation\nSick leave\n401k Retirement Plan plus discretionary employer contribution\nDiscretionary profit-sharing contribution\nCommuter Checks program\n\nSalary is commensurate with experience. Page & Turnbull is an Equal Opportunity Employer and a participant in the Federal E-Verify program.\n\n\n\n\nTo Apply:\n\n\n\n\nIf you have a passion for preservation, architecture, and design and want to work with smart and collaborative people who are dedicated to their craft and who understand that work satisfaction is an important part of our life, then please send a letter of interest, resume, and work samples in PDF format to resume@page-turnbull.com.\n\n\n\n\nTo make sure your information gets reviewed in a timely fashion, add “P&T [San Jose] – Project Manager” in the subject heading.\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architectural Designer/Planner/Team Leader","company_name":"Kenneth Rodrigues and Partners Inc.","company_location":"Mountain View, CA 94043","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\nDental insurance\nHealth insurance\nLife insurance\nOpportunities for advancement\nPaid time off\nRetirement plan\nShow 1 more benefit\nIndeed's salary guide\nNot provided by employer\n$74K - $93.7K a year is Indeed's estimated salary for this role in Mountain View, CA.\nReport inaccurate salary\nFull Job Description\n\nKenneth Rodrigues & Partners, Inc. (www.krparchitects.com) is looking for an Senior Architectural Designer/Planner/Team Leader who thinks creatively and generates new ideas, to join our architectural firm, located in Mountain View, California. KRP is an award-winning architectural firm that believes in the power of architecture to help lead the way to build great livable design-oriented communities.\n\nWe are seeking a talented and well-rounded person to join our team full time. KRP offers candidates the opportunity to be involved in every phase of the design and planning process. We encourage career growth and offer the opportunity for advancement.\n\nResponsibilities:\n\nManage, mentor and grow junior designers\nWork with team on conceptual design through entitlement process\nCoordinate with local planning & building departments\n\nQualifications:\n\n10+ years of professional architectural design and planning experience\nA professional degree in Architecture from an accredited university program\nExcellent communication, organizational, and management skills\nStrong leadership skills with prior experience in managing projects\nAbility to interface with clients and members of the community\nProficiency in AutoCAD and presentation graphics software (i.e. Sketchup, Photoshop, Illustrator, and hand sketching) is required\n\nKRP offers a competitive salary based on candidate qualifications and experience, plus full benefits.\n\nHow to Apply:\n\nPlease include position title and your name in the e-mail header and forward the following:\n\nCover Letter\nResume\nPortfolio samples\nSend via e-mail only, PDF format, 10MB max\n\nJob Type: Full-time\n\nBenefits:\n\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nRetirement plan\nVision insurance\n\nSchedule:\n\n5x8\n\nAbility to commute/relocate:\n\nMountain View, CA 94043: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 1 candidate for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Senior Architectural Project Manager","company_name":"Nelson Worldwide","company_location":"San Jose, CA 95126 \n(Rose Garden area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nDisability insurance\nFlexible spending account\nHealth insurance\nHealth savings account\nShow 4 more benefits\nIndeed's salary guide\nNot provided by employer\n$111K - $141K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nOur NELSON Pleasanton/San Jose team is currently seeking motivated, team-oriented, innovative Senior Project Managers to join our Bay Area office. We’re looking for strong talent to manage and lead the development and coordination on a broad range of multiple projects from concept to completion. This will require someone with business acumen, who can work collaboratively with the team, develop a partnership with clients, ability to deliver design solutions, clear communicator, strong presentation skills, with true passion, creativity, and acute attention-to-detail. This role will provide tremendous opportunities and involvement throughout the design and implementation processes.\n\nKey Responsibilities\n\nGenerate work plans, fee proposals and project schedules in response to RFP’s and other opportunities\nDevelop and execute contracts between NELSON and its outside consultants and clients for services\nMonitor project schedules and budgets as determined by the client\nParticipate in the design and project delivery process\nEnsure that design reviews occur and provide design solutions at the designated stages of projects\nConduct drawing reviews to ensure quality, completeness and consistency with client requirements\nManage the project contract performance and process, understanding the scope, budget, and quality agreed to by the client.\nDetermine project staffing assignments by identifying the skill sets required to execute specific tasks.\nEstablish both quantitative and qualitative goals and objectives for each project.\nEffectively manage team members to maintain positive interaction, while ensuring the highest product quality, meeting client expectations within the approved fee budget, project budget and project schedule\nResponsible for leading and coordinating efforts of work done by design team\nResponsible for communication with external stakeholders\nParticipate in local management meetings to review all projects status and provide recommendations for corrective actions when appropriate.\nStrong knowledge in construction drawings and construction admin/ on-site coordination.\nAbility to coordinate consultants through all phases of design, including MEP Engineers, Structural Engineers, etc.\nAbility to spark collaboration amongst all design team members to deliver a successful project.\nManage design fees and workplans for design team\n\nQualifications\n\nMust have experience in development\nBachelor’s Degree in Architecture or Interior Design.\nMinimum of 10 years’ experience working in the field of Interior Design or Architecture and at least 5+ years of project management experience.\nWorking knowledge of Revit and AutoCAD skills required.\n\nWe offer competitive wages based on skills and experience, excellent benefits package including; Paid Time Off, medical, dental, 401K, pre-tax Flexible Spending Accounts and Health Savings Accounts, company paid life insurance and disability, a wellness program, parental leave, and more. NELSON is an Equal Opportunity Employer.\n\nIf you feel this may be the career opportunity for you, please apply by clicking the link. Due to the large volume of candidates, only qualified applicants will be contacted. No phone calls or agencies please.\n\n#LI-LM1\n\n#IND123\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Sr. Licensed Architect","company_name":"Robson Forensic","company_location":"Campbell, CA 95008","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$102K - $130K a year is Indeed's estimated salary for this role in Campbell, CA.\nReport inaccurate salary\n\nSR. LICENSED ARCHITECT\n\nDo you want to use your training, education, and experience in a new and meaningful way?\n\nIf so, we are looking for a Sr. Licensed Architect to provide investigation, analysis, reports, and testimony where technical and scientific answers are needed to help resolve civil litigation and insurance claims.\n\nLocation:\n\nSouthern California or Las Vegas, NV\n\nDescription:\n\nThe Sr. Architect Expert will review and analyze documents and on-site conditions to determine and analyze facts and issues at hand. The Expert will use his/her years of experience and industry knowledge to assist our clients in performing their case duties typically in a legal environment.\n\nRequirements:\n\nDegreed Architect\nLicensure/registration is required\nAbility to get licensed in other states in region\n20% travel for casework in territory and potentially other states in region\nDesigned or worked on buildings with a variety of Use Groups - Assembly, Business, Educational, Mercantile, Institutional, Factory, and Residential, mixed-use.\nExperience with code evaluation, specification writing and/or diagnosing building defects and design analysis.\nExperience on construction sites performing construction administration; design/ build or construction management experience is a plus.\nExperience working for a construction company is a plus.\nMin. 15 years post degree experience.\nIn-depth knowledge of building safety and construction technology.\nProven ability to work both independently and as part of a comprehensive team.\nExcellent technical, analytical, writing and communication skills.\nBIM experience is a plus.\n\nDue to the seriousness and sensitivity of our work, we do stringent background checks on all our candidates. Candidates are required to pass a drug and background screening. Please be cognizant that we will be checking all aspects of your CV to make sure the information included is verifiable.\n\nWe are an Equal Opportunity Employer.\n\nAbout Us:\n\nRobson Forensic is a multi-discipline forensic expert firm with offices throughout the U.S. Our experts are seasoned, skilled professionals with impeccable academic and professional credentials working in an aggressive, competitive, and rigorous environment. You can read more about the company at: www.robsonforensic.com.\n\nHow to Apply:\n\nIf you are looking for a challenging and rewarding position, and you meet our minimum requirements, please apply and submit your resume and a cover letter (outlining your professional background and expertise).\n\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Staff Level I / Architect I","company_name":"Valerio Dewalt Train","company_location":"Palo Alto, CA 94301 \n(Professorville area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Indeed's salary guide\nNot provided by employer\n$71.7K - $90.7K a year is Indeed's estimated salary for this role in Palo Alto, CA.\nReport inaccurate salary\nArchitectural Staff Level I / Architect I\nRequired work authorization:\nUnited States\n\nSummary: Assist in preparing complete and accurate working plans and detailed drawings from rough or detailed sketches or notes by performing the following duties.\n\nRequired Qualifications:\nB.Arch or M.Arch from an accredited school of Architecture.\n\nEssential Job Responsibilities\n\n3 to 5 years of architecture practice experience (including at least 1 year of U.S. experience)\nStrong design portfolio.\nActive in the production of design documents, including: SD, DD, CD and CA.\nCoordinating project consultants.\nIndependently performs a variety of assignments requiring skills in all conventional aspects of architectural designs for projects of moderate size and complexity.\nStrong collaboration and organizational skills are a must.\nHands on approach and flexibility are a must.\nPerforms analyses of design, planning and occupancy studies and limited design layouts.\nPrepares project specifications, compiling and analyzing relevant data.\nWrites reports and specifications.\nReviews completed reports, plans, estimates and calculations.\n\n\n\nOther Requirements:\n\nExperience with Revit is preferred.\nU.S. Architectural License preferred\nKnowledge of the City Building Code is preferred.\nOther duties as assigned.\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Technical Designer - Interiors - Senior","company_name":"Gensler","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 19 days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$89.1K - $113K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\nAt Gensler we help companies innovate. We design spaces, services, and environments for the most innovative companies in the world, seeking new ways to provide value by fostering healthier, more effective workplaces. As a result of a growing diverse client base and increasing project work, we are searching for a Technical Designer that has 10+ years’ experience with a focus on interior architecture to join our team in San Jose.\nYour Role\nIn this role, you will provide design support for completion/execution of design concepts, prepare schematic, design development and construction documentation drawings, resolve design issues, analyze design options, and execute projects through construction administration.\nYou will be working with the team to complete assignments on schedule and with great quality to meet our clients’ expectations. You will be expected to resolve technical/design issues to maintain progress and quality control and to communicate between the project team and consultants. You will be responsible to meet building codes and all necessary deadlines in order to fully meet client expectations.\nWhat You Will Do\nCollaborate on all phases of a Corporate Workplace oriented interiors projects, including programming client needs, conceptual design, schematic design, and design development, construction documentation and construction administration\nAbility to ideate quickly through utilizing computational design tools\nDirect the technical coordination and documentation for construction of the project\nCollaborate with the team during the design, planning and development phases with building technology and code compliance expertise\nProduce drawings and details, which meet various and specific program requirements while also representing an overall design concept\nConduct on-site observations and document site reviews\nProcess submittals, RFIs, substitution requests, etc. during construction\nInterface with building and permitting officials during the permitting and construction phases of the project\nAssist in managing client expectations, team communication and consultant coordination\nContribute to office activities, initiatives, and learning programs\nYour Qualifications\nBachelor or Masters Degree in Architecture or Interior Architecture, preferably with experience designing corporate interiors projects\n10+ years of experience\nExperience resolving technical and design issues\nProficiency with Revit, SketchUp, 3ds Max, and Adobe Creative Suite\nUnderstanding of how buildings are constructed and ability to create technical documents that succinctly, thoroughly, and accurately describe the work to be done\nCollaborative and team-conscious\nStrong organizational and communication skills\nAbility to handle challenging situations with tact, grace and style\nKnowledge of California building codes, standards and building structures\nUnderstanding of sustainable and universal design concepts. LEED Accreditation is a plus\nFor consideration, please submit resume and work samples in PDF format.\nLife at Gensler\nAt Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to “Well-being Week,” our offices reflect our people’s diverse interests.\nWe encourage every person at Gensler to lead a healthy and balanced life. Our comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities. Our annual base salary range has been established based on local markets.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\nHiring Insights\nJob activity\nPosted 19 days ago"},{"job_title":"Lab Designer - Technology - Senior","company_name":"Gensler","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nHealth insurance\nPaid time off\nProfit sharing\nVision insurance\nIndeed's salary guide\nNot provided by employer\n$103K - $130K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\nYour Role\nGensler San Jose is seeking a Senior Lab Planner with pre-design, programming & laboratory planning and knowledge of specialty architectural environments.\nYou are a subject matter expert on the design and documentation of varying sized lab projects – clinical labs, R&D technology labs, electronic testing labs, or other technical lab types. Utilizing exceptional client relationship skills, and a portfolio of innovative design solutions with an emphasis on built work, you will work collaboratively with others within the offices in the region and the Gensler network.\nApply today to join our robust team of innovative designers and thinkers to technically execute dynamic best-in-class, sustainability-driven projects, help lead the dialogue on design innovation, and nurture the next generation of life sciences design professionals.\nWhat You Will Do\nWork directly with clients, scientists, researchers and related end-users to develop laboratory planning strategies at all levels of detail including new construction and renovations.\nOffer and support creative, sustainability-focused laboratory planning, technical design and detailing decisions that are in line with project goals; yet pushing the envelope beyond traditional approaches to lab design, particularly in private industry.\nServe as a technical advisor in one or more of the following markets: academic, clinical, forensic, government, public health and R&D.\nProvide technical lab, documentation oversight and quality control (QC) reviews. Provide or follow verbal and written instructions to revise, develop and produce plans, elevations and details appropriately.\nDirect document production in accordance with identified project specific checklists, Gensler standards and QA/QC standard program.\nDay-to-day project and client management of laboratory projects from initial planning through construction\nAssist in the development of standard materials that describe the portfolio, systems, processes of Gensler’s Life Sciences Practice Area.\nWork closely with office and studio leaders to identify and recruit best-in-class talent.\nLead the relationships with the client, contractor, agencies, as well as engineering and specialty consultants.\nPrepare and review proposals, contracts, and consultant agreements.\nManage mid-size to large project teams, mentor junior staff.\nYour Qualifications\nLicensed architect with Bachelor’s degree or higher in Architecture with at least 15+ years of architectural or related experience, inclusive of 10+ years’ experience leading the design of lab and life sciences facilities.\nRevit experience required.\nRegistered architect preferred.\nKnowledge of laboratory programming delivery and how design impacts those systems –including space, operational, and equipment programming, as well as MEP systems and casework.\nSubstantial experience working directly senior management representatives, scientists, laboratory managers and technicians, facilities and project managers, and other project stakeholders in determining and documenting programmatic requirements.\nLEED accredited preferred. Committed to the principles of sustainable design and resilient communities, able to demonstrate this commitment in a portfolio of work.\nDemonstrable working technical knowledge and skill set to guide discussions for laboratory (including vivarium) room/space development in conjunction with equipment and other technical attributes.\nAbility to work with end users to develop process flows, planning process and critical adjacencies of research and laboratory rooms for optimum efficiency and flexibility.\nLeadership experience, including managing client expectations, multi-disciplinary team, and meeting scope/schedule/budget.\nAdvanced knowledge of the architectural planning and design process, construction documentation, construction administration and code requirements.\nPossess strong presentation skills with the ability to articulate ideas in interviews and other presentations.\nSkilled at developing and motivating teams of people both internally and externally, along with a desire to mentor team members.\nLife at Gensler\nAt Gensler, we are as committed to enjoying life as we are to delivering best-in-class design. From curated art exhibits to internal design competitions to Wellbeing Week, our offices reflect our people’s diverse interests. We encourage every person at Gensler to lead a healthy and balanced life.\nOur comprehensive benefits include medical, dental, vision, disability, wellness programs, flex spending, paid holidays, and paid time off. We also offer a 401k, profit sharing, employee stock ownership, and twice annual bonus opportunities.\nAs part of the firm’s commitment to licensure and professional development, Gensler offers reimbursement for certain professional licenses and associated renewals and exam fees. In addition, we reimburse tuition for certain eligible programs or classes. We view our professional development programs as strategic investments in our future.\n#LI-SK1\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Job Captain/Project Manager","company_name":"Cuschieri Horton Architects","company_location":"Los Gatos, CA 95030","salary_range":"$30 - $50 an hour","days_ago_posted":"Employer\nActive 6 days ago","job_description":"Job details\nSalary\n$30 - $50 an hour\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nBenefits\nPulled from the full job description\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nParental leave\nShow 2 more benefits\nFull Job Description\n\nJob Summary\n\nREQUIREMENTS: - Minimum of 4 years of experience in an Architectural office working with a Licensed Architect - Proficiency with Microsoft and Adobe Software (Acrobat, Outlook, Word, Excel, etc.) - General technical experience and understanding of the CBC, in particular to the Accessibility code. - Ability to generate details and prepare an entire set of working drawings. - Strong proficiency with AutoCAD software (AutoCAD 2010 or newer) + general Revit knowledge - Positively work & collaborate in a team environment with our Staff, Consultants, and Clients. - Experience working on multiple projects through all phases of design. - Experience coordinating drawings and communicating with various Design Consultants NOT REQUIRED BUT POSITIVE ATTRIBUTES: - Enrolled with NCARB IDP program and/or taking exams in becoming a licensed Architect - LEED Experience and/or Accreditation - Strong technical experience with REVIT software and/or SketchUp\n\nJob Type: Full-time\n\nPay: $30.00 - $50.00 per hour\n\nBenefits:\n\n401(k)\nDental insurance\nFlexible schedule\nHealth insurance\nPaid time off\nParental leave\nProfessional development assistance\nVision insurance\n\nSchedule:\n\n8 hour shift\nMonday to Friday\n\nAbility to commute/relocate:\n\nLos Gatos, CA 95030: Reliably commute or planning to relocate before starting work (Required)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 2 candidates for this role\n\nUrgently hiring\n\nJob activity\nEmployer reviewed job 6 days ago\nPosted 21 days ago"},{"job_title":"Architectural Project Manager / Sr PM","company_name":"Watry Design, Inc.","company_location":"San Jose, CA 95110 \n(North San Jose area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nQualifications\n\nWork authorization (Required)\n\nBachelor's (Preferred)\n\nRevit: 2 years (Preferred)\n\nproject management: 4 years (Preferred)\n\nCalifornia Architect License (Preferred)\n\nBenefits\nPulled from the full job description\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nShow 3 more benefits\nIndeed's salary guide\nNot provided by employer\n$98.4K - $125K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nAre you looking for an opportunity to work with a collaborative, talented, passionate team where initiative is rewarded? Watry Design, Inc., an Architectural, Structural Engineering and Planning firm not only fits that bill, but offers far more.\n\nWe are seeking Architectural Project Managers and Senior Project Managers with 7 to 20 years of experience to work in our San Jose and Orange County Offices. These positions work on diverse projects for the private sector, municipalities, transit agencies, universities, medical facilities and more.\n\nIf your interest is piqued, send your resume, cover letter, and a link to your portfolio or work samples.\n\nArchitectural PM Responsibilities\n\nDevelop and monitor the team\nDemonstrate knowledge and understanding of Architectural codes\nBudget preparation and project status reporting\nAttend client meetings and prepare meeting minutes\nPut together fee proposals and schedule preparation\nManage technical coordination of the documents\nManage the bidding/negotiations phase\nDevelop designs and sketches to be incorporated into completed documents\nManage construction document preparation\nCoordinate the development of documents with other disciplines\nReview design and documents for code compliance\nManage project design\nMaintain project files\nManage the construction administration phase\n\nArchitectural PM Qualifications\n\nBachelor or Master’s Degree in Architecture or equivalent experience\nArchitectural license (preferred)\n7-10 years of experience required\n\nArchitectural PM Skills\n\nExcellent written and verbal communication and presentation skills\nStrong ability to prioritize and time management skills\nManagement skills including strong relationship skills, team building skills\nAnalytical skills such as financial performance, staff performance, resource allocation\nWord, MS Excel, MS Project, Revit\n\n-- Are you up for it? --\n\nWatry Design, Inc. is an EEO employer, providing equal employment opportunity to all employees and applicants without regard to age, race, color, religion, sex, gender, sexual orientation, ancestry, national origin, medical condition, disability, or genetics.\n\nJob Type: Full-time\n\nBenefits:\n\n401(k)\n401(k) matching\nDental insurance\nEmployee assistance program\nFlexible spending account\nHealth insurance\nPaid time off\nReferral program\nVision insurance\n\nSchedule:\n\nDay shift\nMonday to Friday\n\nSupplemental pay types:\n\nBonus pay\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\nRevit: 2 years (Preferred)\nproject management: 4 years (Preferred)\n\nLicense/Certification:\n\nCalifornia Architect License (Preferred)\n\nWork Location: One location\n\nHiring Insights\n\nHiring 2 candidates for this role\n\nJob activity\nPosted 30+ days ago"},{"job_title":"Architectural Sheet Metal Project Manager","company_name":"Air Systems, Inc.","company_location":"San Jose, CA 95122 \n(East San Jose area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":"Job details\nJob Type\nFull-time\nIndeed's salary guide\nNot provided by employer\n$81.9K - $104K a year is Indeed's estimated salary for this role in San Jose, CA.\nReport inaccurate salary\nFull Job Description\n\nAbout Us:\n\nAir Systems Inc. is a wholly owned subsidiary of EMCOR Group, Inc. EMCOR is the world's leading provider of mechanical and electrical construction and facilities services, including planning, consulting, and operations and maintenance.\n\nAir Systems Inc. is a TOTAL FACILITIES SOLUTION for HVAC, Architectural Sheet Metal, Preventive Maintenance & Service, Electrical, High Purity Process Piping, Plumbing, Building Automation Systems and Energy Solutions.\n\nJob Title: - Project Manager – Architectural Sheet Metal\n\nJob Summary:\nAir Systems is looking for a Project Manager experienced in Architectural Sheet Metal. Who likes the challenge of unique designs, projects and deadlines. He / She is able to run jobs big and small, coordinating multiple jobs simultaneously, while also providing leadership to large project teams and to the ASM department. The Project Manager works with customers to develop the project scope of work, budgeting and estimating costs, and oversees preparation of documents and Architectural Sheet Metal project plans. The Project Manager assists in procurement of equipment and materials and is responsible for reviewing, reporting, and projecting all project costs. He / She manages project roles, identifying and coordinating resource requirements. The most important aspect of the job is to provide customer satisfaction. The Project Manager ensures effective communications and assures relationships between customers and project team members are maintained.\n\nEssential Duties and Responsibilities: -\n\nDevelops and maintains professional communications with co-workers and clients\nMake sales contacts, research customer needs, and follow up on sales leads\nDevelop and maintain relationships with clients, assuring client satisfaction\nMeet established revenue and profit goals\nAttend client project meetings\nEstablish, manage, and provide leadership to job/project team\nFacilitates and troubleshoots problems associated with project\nPurchase materials and equipment as needed\nMaintain control and accurate projections of project costs\nProvide department leadership by example and mentoring.\nSupport accountability for individual projects as well as ASM department in general\nMaintains and follows established Air Systems Project Management procedures Qualifications: -\n5+ Years experience as a Project Manager in the Architectural Sheet Metal industry.\nIdeal candidate will have previous experience working with various projects to include Metal Roofing, Louvers, Column Covers, Architectural Flashings, Metal Siding/Exterior Walls\nProficient on MS Office Suite\nExcellent oral/written communication skills\nDeveloped presentation skills\nExcellent customer relations skills\nAttention to Detail\nProactive\nBe able to multi-task\nExcellent Organization\nAbility to problem solve\nTeam Player\nFlexible\nAble to work in a fast-paced environment\nCreative use of skills and resources to get the job done\n\nQualifications\n5+ Years experience as a Project Manager in ASM- Architectural Sheet Metal Industry.\nProficient on MS Office Suite\nDeveloped presentation skills\n\nProfessional Competencies Needed\n\nBe passionate\nCustomer focused approach\nDedicated to a job well done\n\nBe professional\nExcellent verbal and written communication\nStrong organization\n\nBe a problem solver\nAble to work in a fast-paced environment\nAble to manage multiple responsibilities concurrently\nAle to creatively use skills and resources to get the job done\n\nBe a partner\nTeam player\nCollaborative\n\nBe a performer\nFlexible\nDoes what is right, even if it's not easy\nAsks questions\n\n\nCalifornia is an “At Will” state. Employment with Air Systems an EMCOR Company is not for a specific term and it can be terminated by either the employee or Air Systems an EMCOR Company, with or without cause, and with or without notice at any time.\n\nWe offer our employees a competitive salary and comprehensive benefits package and are always looking for individuals with the talent and skills required to contribute to our continued growth and success. Equal Opportunity Employer/Veterans/Disabled\n\n\nExperience\nRequired\n5 year(s): Metal Roofing, Louvers, Column Covers, Architectural Flashings, Metal Siding/Exterior Walls\n5 year(s): Customer Relationships\n5 year(s): Estimating\n5 year(s): Architectural Sheet Metal\nHiring Insights\nJob activity\nPosted 30+ days ago"},{"job_title":"Project Architect","company_name":"HNTB Corporation","company_location":"San Jose, CA 95115 \n(Willow Glen area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Staff Architect- Infrastructure Design","company_name":"Tesla","company_location":"Fremont, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Manager, Application Architecture - DAS Audit & Assurance (Project Omnia)","company_name":"Deloitte","company_location":"San Jose, CA 95113 \n(Downtown area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Senior Project Architect","company_name":"STV","company_location":"San Jose, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Project Manager (Santa Clara)","company_name":"Impact Solutions","company_location":"Santa Clara, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Senior Wastewater Design Manager - Design-Build Team","company_name":"Lendlease","company_location":"Sunnyvale, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Architectural Sheet Metal Project Manager","company_name":"Emcor","company_location":"San Jose, CA 95122 \n(East San Jose area)","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Project Manager (Santa Clara)","company_name":"Food Management Search","company_location":"Santa Clara, CA","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null},{"job_title":"Project Architect","company_name":"DAHLIN Architecture | Planning | Interiors","company_location":"Pleasanton, CA 94588","salary_range":null,"days_ago_posted":"Posted\nPosted 20 days ago","job_description":null},{"job_title":"Senior Project Manager, Interior Architecture & Design","company_name":"Ware Malcomb","company_location":"Hybrid remote in Pleasanton, CA 94588","salary_range":null,"days_ago_posted":"Posted\nPosted 30+ days ago","job_description":null}]